{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "billing", "service": "Telkom", "description": "Billed on the cancelled contract", "suggestion": "Refund the customer and improve customer service"}, "meta": {"id": 3341993, "created_at": "2021-01-05 16:33:36", "review_rating": 1, "review_title": "billed on the cancelled contract ", "review_content": "Good day\nI have been calling Telkom from October regarding the billing on the cancelled contract , they billed me NOVEMBER r and December , i called in for refund on the 21OF DEC  and I spoke to Delisile which she promised that she will communicate with me regarding the refund and she even send the confirmation of the cancellation, she didn't call to provide feed back  she said it sent to the manager but no response they keep billing  me, i spoke to Pulane  after speaking to Delisile she escalated but still billed again and penalized for reversing the debit since they didn't refund me.\ni called in today which is the 01/05/2020 spoke to Fikile  requesting the paid up letter and cancellation letters she said i will get feedback before 12 but still its now 4:15 no call. i call again i spoke to a programmed consultant Princess  WHO WILL TELL ME ABOUT THE PROCESS OF TELKOM THOUGH SHE SEE THAT THIS IS NOT MY FIRST CALL and its not assistance . she said its escalated to Granny and this granny is not contacting nor  doing anything about the billing. my risk profile is ruined , my credit risk is ruined all because of the contract that i never missed any premiums until the agreed time.\n\nplease rectify and please train Princess that its not a problem to sometimes forget the book cause she sound like a robot , sometimes you must try to think on ways to assist if the process that YOU follow don't assist your customers.\n\nHerrison Malonga PLEASE CHECK IF YOU TEAMLEADERS DO CONTACT CLIENT CAUSE SINCE OCTOBER HAVING THE SAME QUERY WHICH ALL CONSULTANT THAT I SPOKE TO CONFIRM THAT I SUPPOSE NOT TO BE DEBITED AND WILL GET REFUND BUT no HELP.\n\nI wanted to upgrade and a consultant from sales team promise to call and neve called. so it seems like its Telkom values to avoid client and you never prioritize your client. I no longer want the upgrade.\n\ni ported my number from Vodacom to Telkom and this kind  of service makes me think that I took a wrong decision \n\nI will never advise a person to take a contract with Telkom ", "business_slug": "telkom"}}
