{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "Vodacom - A dishonest company. I have been trying to cancel my contract since July 2020. Finally, I got a consultant who assisted and my contract was canceled in October. All of a sudden, at the end of November, a debit goes through for the very contract he was offering which I had vehemently declined. I used their chatbot service only to find out they placed me in legal. Imagine the cheek! All these people make you fight for your last cent and create such drama instead of executing simple requests. The best part is no one calls you on the provided number you gave, which happens to be another service provider, but you have a sales agent calling on that number to sell you a Vodacom contract. I am really mad at Vodacom. Vodacom, where is your integrity as a consumer provider? Do you think you are above the consumer act? I want an agent, with powers - not someone who has to refer 5 times, to call me and remove the legal status which is due to your incompetence and not technical difficulties. I am giving you a chance... I challenge: Redeem yourself!", "suggestion": "Vodacom should assign a dedicated agent with the authority to resolve the issue and remove the legal status from the customer's account."}, "meta": {"id": 3342153, "created_at": "2021-01-05 18:30:46", "review_rating": 1, "review_title": "Vodacom's dishonesty", "review_content": "Vadacom -A dishonest company. I have been trying to cancel my contract since july 2020. Finally I got a consultant who assisted and my contract was canceled in Oct.  All of sudden end of Nov a debit goes through for the very contract he was offering which I had vehemently declined. I used their chatbot service only to find out they placed me in legal. Imagine the cheek! All these  people make you  fight for your last cent and create such drama instead of executing simple requests. Best part no one calls you on the provided number you gave which happens to be another service provider but you have a sales agent calling on that number to sell you a vodacom contract. \nI am really mad at Vodacom. Vodacom were is your integrity as a consumer provider ? Do you think you are above the consumer act?\nI want an agent , with powers- not someone who has to refer 5times, to call me and remove the legal status which is due to your incompetence and not technical difficulties. \nI am giving you a chance... I challenge: Redeem yourself!", "business_slug": "vodacom"}}
