{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Bad Service", "service": "Vodacom", "description": "Ive been experiencing problems with Vodacom Network for 6 months now. Constant drop calls, bad reception when speaking & miss calls on WiFi and direct calling, internet not availabe (have a Vodocom WiFi rooter), constant messages \"not connected to internet/out of service area\",  currently unable to download, waiting 45min for a ONE sentence WiFi messageto go through. Logging calls re the problem has come to nothing. Received sms informing me query been resolved / and now being closed. Trying to speak to a human is impossible - nobody's available. Taking the option of going through the ROBOT Thobi is another impossible mission. After escalating the issue with Vodacom over last 2 months and eventually got hold a human to speak to - I was told I'm allowed to cancel my contracts. Then I've discovered it is IMPOSSIBLE to cancel it. Eventually I spoke to a Mr. Onke Moya on Monday 11th January 2021 - he promised to solve my problem, cancel my contract and will call me back in 24hours. 24 Hours later I'm back to where I've started. Number he gave me DOES NOT EXIST. Trying to get back by cancelling ********** I discovered my bomber has been blocked by Vodacom due to the fact that they have received high volume calls from me.", "suggestion": "Vodacom should improve their customer service and address the network issues promptly. They should also ensure that their cancellation process is smooth and accessible to customers."}, "meta": {"id": 3349978, "created_at": "2021-01-12 14:58:19", "review_rating": 1, "review_title": "VODACOM BAD SERVICE", "review_content": "Ive been experiencing problems with Vodacom Network for 6 months now. Constant drop calls, bad reception when speaking & miss calls on WiFi and direct calling, internet not availabe (have a Vodocom WiFi rooter), constant messages \"not connected to internet/out of service area\",  currently unable to download, waiting 45min for a ONE sentence WiFi messageto go through. \nLogging calls re the problem has come to nothing. Received sms informing me query been resolved / and now being closed.\nTrying to speak to a human is impossible - nobody's available. Taking the option of going through the ROBOT Thobi is another impossible mission.\nAfter escalating the issue with Vodacom over last 2 months and eventually got hold a human to speak to - I was told I'm allowed to cancel my contracts. Then I've discovered it is IMPOSSIBLE to cancel it.\nEventually I spoke to a Mr. Onke Moya on Monday 11th January 2021 - he promised to solve my problem, cancel my contract and will call me back in 24hours.\n24 Hours later I'm back to where I've started. Number he gave me DOES NOT EXIST.\nTrying to get back by cancelling ********** I discovered my bomber has been blocked by Vodacom due to the fact that they have received high volume calls from me.", "business_slug": "vodacom"}}
