{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Phone line", "description": "Lack of knowledge and lack of urgency by Telkom and their officials. Phone line has been down for 15 days without resolution. Call center agents are unhelpful and unable to provide status updates. Escalation processes are ineffective.", "suggestion": "Improve training and knowledge of call center agents. Implement more effective escalation processes to ensure timely resolution of customer complaints."}, "meta": {"id": 3353571, "created_at": "2021-01-15 09:09:25", "review_rating": 1, "review_title": "Lack of knowledge and lack of urgency by Telkom and their officials..... Shocking", "review_content": "After a lightening storm on 31/12/2020 our phone line went down where we were unable to make or receive calls.\n\n1/1/2021 logged a fault online with ref no. **********8 - gave tech some time to attend to the fault as it was holidays and we are in level 3 lockdown.\n\n7/1/2021 - called in and spoke to Ntombi 14:12 at the call center explained the fault and she said it would be escalated and assigned to a technician. again gave some time for fault to be solved and tech to be assigned.\n\n11/1/2021 called in spoke to Nobantu 12:38 at the call center again explained the fault, same solution and gave a escalation reference number : 87782.\n\n13/1/2021 called in spoke to Silomela 8:28 at the call center explained once again, once again saying they have sent to the test center and technician will be allocated.\n\ncalled in spoke to Lisa 14:06 as tech still had not been allocated, explain, agent took my details like the agents before and said I would be contacted a little while later...... No call back!\n\n14/1/2021called in spoke to Phumla 10:45 explained, same solution, took details once again .... No call back all day.\n\n15/1/2021 called in spoke to Nolusindiso 8.10 same solution. I then asked to speak to someone senior .... 8:45 someone senior got to the phone Nanqanso, this lady was of no help and continued to explain what agents had explained before continued with excuses and could not provide info for the test center or why the tech was not allocated she gave no clear explanation as to how this will be resolved.\n\nIt has been 15 day without service of the landline. call center agents seem to be like robots with no clue how to assist or give customers a sense of the status of the fault logged. \n\nOur neighbours who have had the exact problem, we all logged the fault on the same day and all have bee sorted. but the call center agents have continuously maintained that no tech available.\n\nIt has been frustrating deal with the agents, as much as it is not totally their fault but they are the primary contact between customer and the company and their lack of knowledge and ability to assist leaves a lot to be desired. escalation processes do not work. \n\nAccount has been paid in full and we are with the service for half of the month already.\n\ncall logged 1/1/2020 \nref no. **********8\nescalation 11/1/2021\nref no. 87782", "business_slug": "telkom"}}
