{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Cell C", "description": "My contract with Cell C is ending and I served them with notice to discontinue. I asked them to reduce my spend limit, but they didn't do it. They claim I have already used more money than I actually did. I have had previous issues with Cell C's service and their staff's behavior.", "suggestion": "Cell C should improve their customer service, ensure that instructions are followed accurately, and address issues with their billing system."}, "meta": {"id": 3371684, "created_at": "2021-01-30 08:01:30", "review_rating": 1, "review_title": "Cell c milk my last cent because I am canceling my contract", "review_content": "So my contract is ending with ‘cell sea’ this month and I served them with my notice to discontinue my contract as I have never been happy with the substandard and corrupt ‘cell sea’ service. Days later again I phone cell c to reduce my spend limit as it has depleted R10.56 at the time and the agent promised to carry the instruction. Today I check my app and cell c did not  reduce the spend limit and they claim I have already used R76.76 and they can’t assist me. In the past I have asked cell c to reduce my spend limit and there has never been a mistake for them not to reduce a spend limit. Now that I am canceling my contract with useless ‘cell sea’ and they want to milk everything and anything because they have financial troubles. Anyone who plan to take contract with ‘cell Sea’ keep in mind that you will be subjected to their rude consultants who behave like robots and their non existent team leaders and management. This cell sea is more corrupt than the South African government. Cell c staff members have milked the company and now we must pay the price today. Their employees have inflated tender prices and now we have to suffer. Here is proof on why cell sea today is limping and how come auditors never saw this https://www.google.com/amp/s/www.timeslive.co.za/amp/news/south-africa/2021-01-22-former-cell-c-executive-arrested-in-connection-with-r64m-fraud/. If you are planning to sign up with cell sea keep in mind their prices increase without notification and cell c change their products without consulting or offering you options to choose from. Keep in mind cell sea staff member will lock your simcard if they can’t resolve your query and you are breathing at their neck. It makes sense why cell sea has migrated its customers to the two big networks. They don’t have resources and skill to handle such and you as a customer you should be asking yourself why do you buy vodacom or MTN when you can go directly to them and have better service", "business_slug": "cell-c"}}
