{"chatbot": {"related": 1, "evidence": "The customer mentioned trying to contact someone of authority and mentioned interacting with a chatbot.", "classification": "Customer service", "description": "The customer is complaining about the lack of resolution to their issues and the unhelpful responses received.", "suggestion": "Improve the chatbot's ability to handle customer complaints and provide more effective solutions."}, "complaint": {"classification": "Customer service", "service": "Vodacom", "description": "The customer is frustrated with the lack of response and resolution to their issues.", "suggestion": "Assign a dedicated representative to address the customer's concerns and provide a satisfactory resolution."}, "meta": {"id": 3377852, "created_at": "2021-02-03 18:47:43", "review_rating": 1, "review_title": "I need a hero ", "review_content": "I have tried numerous times to get through to someone of authority to get a resolve to a couple of issues - all related to my last post and an upgrade.\nAll posts here receive the same standard response blah blah blah, someone will be in touch with you. I had it on my last rant, and I'm sure I'll get it here. Some very important people at Vodacom made an executive decision that my problem had been resolved, and that despite the promises made, I didn't need to be contacted. Hello Peter I'm sure, would not tolerate 4 letter words !\n\nThere are more pillars and posts to be shoved around at Vodacom, than the Parthenon. fewer tour guides . \nThe general view is, that moving this person on to someone else, the problem will go away. Buried in an endless loop of incompetence and dropped calls. Good luck if you try call again. Start all over. Online help with that stupid Bot ? ha ha ha ...\nSend a mail to customer service....the automated response? Please note: \nThis is a system-generated email that requires your response in order to be processed. After that, a Customer Care agent will contact you within 24 hours.\n\nProtecting your Vodacom account from fraud is important to us, so before we can help you with your query, we need to verify that you are the owner of this account.\n\nPlease reply to this email with these three bits of personal information:\n\nID number or Company Registration Number for corporate accounts\nBank name and account type\nYour Vodacom account number\nHave you collectively taken leave of your senses !! you want to make sure I am who I say I am, from an email address on your system, and you want me to send my personal details to an automated mail address that could well be fraudulent ?? and thats for the privilege of having my query addressed. Go F yourselves! \nI have been at the sharp end of some of our pretty dodgy SOE departments, but you guys are seriously leading that competition - by a long shot !!\n\nNow - what is your complaint you may ask. Its not going to get resolved in this public platform, so I'm not going to air it here, save to say that complaint number 1 is the impossible task of finding some one that gives enough of an F to take responsibility, and solve the problem !! I cannot waste more hours ( I have called numerous times, mailed, chatted to the robot, been into a store) and I still sit feeling like my service provider ( there's a laugh) really doesn't give a continental stuff !! - and so I resort to Hello Peter.\n\nSurprise me Vodacom, if its within you. Someone with backbone, the will to make a difference and the authority to make a customer of 23 years - believe again. \n\n ", "business_slug": "vodacom"}}
