{"chatbot": {"related": 1, "evidence": "The complaint mentions the chatbot as one of the options the customer tried to contact for assistance.", "classification": "Ineffective customer support", "description": "The customer tried to contact the chatbot for assistance regarding a fraud issue but was unable to get any help.", "suggestion": "Improve the chatbot's functionality and responsiveness to better assist customers with their issues."}, "complaint": {"classification": "Poor customer service", "service": "Vodacom", "description": "The customer had a fraud issue and needed to discuss it with a human representative, but was unable to reach anyone through various channels of communication.", "suggestion": "Ensure that customers have access to human representatives for complex issues and improve the overall customer service experience."}, "meta": {"id": 3380641, "created_at": "2021-02-05 15:46:18", "review_rating": 1, "review_title": "The Most Feckless Company in South Africa", "review_content": "It was a difficult decision to rate Vodacom with one star since even no stars would have indicated a massive over-achievement by this money grabbing, third rate company.\n\nHaving been a victim of fraud, I needed to contact a human to discuss the details of the crime in an effort to get them to acknowledge and cancel a debit order, but at the same time to assist them in themselves not continuing to fall victim to this fraudster and incur more losses.\n\nContact \"Customer Service\" it says on the website. If I didn't know better, I died and am now spending and eternity in purgatory, because whether its 082 135, their so called \"online chat\" or even their more so called \"intelligent chat bot\", all roads lead to a dead end and you never get to speak to anyone about anything. Wait too long in the chat and it just drops you, the IVR never happens to have an option to speak to a human and the intelligent chat bot was clearly designed by someone with a room temperature IQ. Oh and don't try email the customer services mailbox either; For me, as a non-Vodacom customer, it asks you to tell it various pieces of information about a fraudulent account that was set up in your name, which you obviously won't have access to, and then when you don't provide that information, it simply ignores your email. Truly another award winning piece of development done there by Vodacom, well done.\n\nThis company does not care about anyone in the slightest. If you are at any point considering using them to provide you a \"service\", literally look anywhere else because it will probably be better. The message is clear: Give us your money, but we have no interest in talking to you about anything.", "business_slug": "vodacom"}}
