{"chatbot": {"related": 1, "evidence": "The complaint mentions the presence of a chatbot", "classification": "Customer complaint", "description": "The customer is complaining about the chatbot being in place instead of being able to contact Vodacom directly", "suggestion": "Improve the chatbot system to provide better customer support or provide alternative methods of contact"}, "complaint": {"classification": "Service complaint", "service": "Vodacom", "description": "The customer is complaining about Vodacom's inability to keep a tower on during load shedding, which poses a danger to customers' lives and prevents emergency phone calls", "suggestion": "Install a solar system or backup power solution to keep the towers operational during load shedding, and ensure that emergency phone calls can be made"}, "meta": {"id": 3385098, "created_at": "2021-02-09 16:35:29", "review_rating": 1, "review_title": "Vodacom charges large rates but cannot stay on during load shed", "review_content": "I have been looking for a way to contact Vodacom and complain but we cannot get to a call center and you have a bot in place... it amazes me that we pay so much for data, calls and sms... not to mention whatsapp data but with all our money you cannot keep a tower on during load shed. We cannot even make a 112 emergency phone call.. This leaves all your customers lives in danger for the time eskom is off. This is very careless of you when after the amount of money we giving you that you cannot put a solar system in place nor a security guard to watch a tower.. further more we pay for out whatsapp data..The whatsapp ticket in question belongs to us. We pay for that gig of data. Why send messages, pictures, videos and voice notes but we cannot make or receive whatsapp calls.  We pay for this and should be used to our discretion.. but now that you know regarding that that there are millions of people who are actually ****ed off about that part imagine somebody like me who is involved in road emergency... have you any clue what you have cost me every time the power goes off???? Do you even care??? Just so long as you f..ucking your customers then that's ok for you... I have been with you for years but years have past with load shed and you still ***** us where the sun don't shine.. You can go fly your kite where that sun don't shine and you have lost a customer. ", "business_slug": "vodacom"}}
