{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Bad Service", "service": "Vodacom", "description": "We attempted to contact Vodacom to change banking details to no avail as everything is digital to find that we have been handed over to the Collections Department. Phoning them again it was a Robot requesting all kinds of information followed by the # also to no avail as right at the end the line just went dead. In the interim an EFT payment for the amount of R665 went missing on Vodacom's side and any attempt of an online payment to get reconnected result in a technical error.\n\nAnother problem with Vodacom is we were offered an upgrade of our WiFi at a substantially reduced rate that we accept. 2 Month's down the line we found out that we have been lied to by an Agent. The subscription was not for the same Data Package we had but a great reduced one that is useless for our needs. Querying this resulted in absolutely nothing except a query number received by email.\nPlease note that all Vodacom email numbers supplied to us except for 1 bounced as non existent.", "suggestion": "Vodacom should improve their customer service and ensure that their agents provide accurate information to customers. They should also address the issue of missing payments and technical errors when making online payments."}, "meta": {"id": 3389529, "created_at": "2021-02-12 14:50:19", "review_rating": 1, "review_title": "Vodacom Bad Service", "review_content": "We attempted to contact Vodacom to change banking details to no avail as everything is digital to find that we have been handed over to the Collections Department.  Phoning them again it was a Robot requesting all kinds of information followed by the # also to no avail as right at the end the line just went dead.  In the interim an EFT payment for the amount of R665 went missing on Vodacom's side and any attempt of an online payment to get reconnected result in a technical error.\n\nAnother problem with Vodacom is we were offered an upgrade of our WiFi at a substantially reduced rate that we accept.  2 Month's down the line we found out that we have been lied to by an Agent.  The subscription was not for the same Data Package we had but a great reduced one that is useless for our needs.  Querying this resulted in absolutely nothing except a query number received by email.\nPlease note that all Vodacom email numbers supplied to us except for 1 bounced as non existent.", "business_slug": "vodacom"}}
