{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Poor Service", "service": "Vodacom Fiber", "description": "No internet access for two weeks despite multiple calls and no resolution. Delay tactics used by Vodacom. Frustration with the service and lack of ownership. Charged for service despite no internet since December 2020.", "suggestion": "Resolve the internet access issue promptly and provide better customer service. Stop charging for service not provided."}, "meta": {"id": 3393512, "created_at": "2021-02-16 14:14:06", "review_rating": 1, "review_title": "Fiber leaders in the country are the same as electricity leaders. ", "review_content": "I wish I could select zero stars rating but it won't allow me to reach this box.\nI am almost convinced that there are robots in the human form employed by Vodacom. Now two weeks since fiber has been reinstalled and configured, I don't have internet access. Almost daily and sometimes 2 and 3 calls in one day and no one is taking ownership of the situation and no one is actually resolving it. Delay tactics are on the cards and vodacom is using it very often. Between Vuma and Vodacom Fiber it appears that they are not able to solve the problem and get us connected. By the way this is the second time that I have reached my point of frustration and cannot accept this lousy form of service from a huge organization like Vodacom. I have a list of SR numbers and consultants who have been on the other side of the phone and each call result is the same, or 99 % similar where the consultant escalates the request by sending an email to the 'back office' occasionally marked as urgent then a new SR number is created and the clock is reset for 24 to 48 hours. I am being polite when I use the term frustration. Also Vodacom is charging me every month and I have no service since middle of December 2020. I am told that someone will be contacting me within a few hours but to no avail. I am a Vodacom client for many years now and this is the last straw. As soon as my contract expires, good bye Vodacom! ", "business_slug": "vodacom"}}
