{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Service", "service": "RAIN", "description": "RAIN's service has been poor and they have failed to respond to clients. The speed of the service has increased but not as fast as when it was first used. RICA verification is required again when using a new SIM. Refund request for second SIM activation has not been resolved for almost a week.", "suggestion": "Improve response time and communication with clients. Streamline the RICA verification process. Resolve refund requests in a timely manner."}, "meta": {"id": 3396353, "created_at": "2021-02-18 11:11:55", "review_rating": 2, "review_title": "Follow Up Review for rain Rain", "review_content": "Okay so update on my current issues and affairs with RAIN...Mhmmm!,\n\nso like I said rain just ain't raining no more. I believe that they are struggling I don't know what exactly it is, but If the pandemic is one of the reasons that may be for the service being poor then update us please keep[ us in the loop.\n\nI fail to believe that a company that is expanding rapidly the way they are fails to actually get back to its clients.\n\nI mean their response was fast they wanted to know what the email associated with the account, I did update them and I thought okay... nice that response time deserves another half a star.\n\nI'm a nice guy I don't like going ballistic so I do give them the benefit of the doubt. they sent an email saying they received my complaint and they would be on it...\n\nOKAY! cool right...\n\nNaaah NOT!...\n\nThe speed did in fact increase, but not as fast as the time we started using it but I wasn't complaining because I'm the only one using the network for now.\n\nSo I'm thinking okay these guys got it going so I'm like my phone has sim ports so I decide I want to get rain for my mobile \n\nHahaha! boy did i know...\n\nworst idea I've ever had in my life it's like one of those quotes where you hear people say if it's meant to be it will be but if it ain't then u will see by its actions.\n\nin this case, actions do speak louder than words. I don't know if this is like a security measure but why do I always have to RICA when I've already done that with my previous sim. Verifying that I am no robot now with a new sim I have to do it again...\n\nAh \"Sigh\",\n\nI give up man.\n\nthen now I want a refund,\n\nhahaha! The speed at which they took my money was like the Flash...but bringing it back is like waiting for rain in the desert they keep sending an automated message that won't help me saying that my request is logged and all those stories OMW!!! *Headache*\n\nI tried rain..\n\nThey remind me of an ex that always promised to change and I always stuck by them but was there ever change probably in the 1st week but as we continued it was back to square 1...\n\nIMAGINE...\n\nwell, all I want now is my money back for the second sim activation that I never got refunded for its almost a week now I haven't gotten a call I asked my partner if maybe she got a call but... nothing.\n\nthanks, rain I wish you all the best in the near future but this right here is something I cannot live with I tried, gave you a chance and I really wanted to see you succeed but there's no use...\n\nHit me up again when you have 5G in Durban id like to see what that looks like coz 4G ain't doing it for me...", "business_slug": "rain-internet-service-provider"}}
