{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Poor Service", "service": "Vodacom", "description": "Tried to call a service consultant as we are looking to upgrade our contract. Exceptionally poorly trained service consultants - almost robotic in nature. When you have monopolies like Vodacom, it is clear to see the drop in service levels. Instead of trying to resolve the problems you get passed around. Where have you seen a business who is given an opportunity of growth turn away clients. Have been trying to get additional paid services from Vodacom for our small business - and wow what a mission - Seems like they have adopted the old Post and Telecommunications mentality, disguised as Telkom that has been passed over to Vodacom. in times where businesses need dire growth, it is clear that Vodacom is comfortable - a real fat cat where customer service is the least on their mind.", "suggestion": "Improve the training of service consultants and focus on resolving customer problems efficiently."}, "meta": {"id": 3405036, "created_at": "2021-02-25 13:56:41", "review_rating": 1, "review_title": "Vodocam Stinks - ", "review_content": "Tried to call a service consultant ass we are looking to upgrade our contract. Exceptionally poorly trained service consultants - almost robotic in nature. When you have monopolies like Vodacom, it is clear to see the drop in service levels. Instead of trying to resolve the probleems you get passed around. Where have you seen a business who is given an opportunity of growth turn away clients. Have been trying to get additional paid services from Vodacom for our small business - and wow what a mission - Seems like they have adopted the old Post and Telecommunications mentality, disguised as Telkom that has been passed over to Vodacom. in times where businesses need dire growth, it is clear that Vodacom is comfortable - a real fat cat where customer service is the least on their mind.", "business_slug": "vodacom"}}
