{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Data Usage", "service": "Vodacom", "description": "No support on data problems with data been used and what for. Peer to Peer and Secure encrypted Login. How interesting - and I cannot find a way to disable peer to peer on my phone at all using the Internet or anywhere else - Is there anything i can do or anyone that can help. This started on the 1 March exactly for some reason - I was on Whatsapp within 30 mins i saw 100 Mb go BOOOF and i did not receive a pic or a video in that time as i was watching my data go boof in front of my eyes - that i quickly put off my data - but when i am on my home wifi", "suggestion": "Investigate the data usage issue and provide support to identify and resolve the problem. Provide a way to disable peer to peer on the phone if desired."}, "meta": {"id": 3414865, "created_at": "2021-03-04 23:23:11", "review_rating": 2, "review_title": "Peer to Peer and Secure encrypted Login ", "review_content": "No support on data problems with data been used and what for\nHi there I was just on a chat with Tobie from the bot factory - and 2 agents which one called back gave me 250 mg for the loss of data  from Vodacom help desk and ask for help on what is using up all my data and they told me they can not see and can help me to stop what ever is using up all my data. All I was told is to look at the data usage on the app witch dose not tell me any thing other then secure encrypted login and Peer to peer file sharing is using up all my data and when i ask what this is I was told they can not see any thing on there side and and can not help me fix what ever is using up all my data and I must just live with my data been used for some thing that I dont know what it is for or how to even stop it from been used. Thank you a lot for coming up with things to show are using my data but mean nothing to me as it could be any thing. Good way to show your data is been used up for some thing but what that some thing is any one can guess as no one will ever know as not even Vodcom knows what is using up all my data great to know my data usage is so privet that not even I know what i am using it on.\n\nHow interesting - and I cannot find a way to disable peer to peer on my phone at all using the Internet or anywhere else - Is there anything i can do or anyone that can help \n\nThis started on the 1 March exactly for some reason - I was on Whatsapp within 30 mins i saw 100 Mb go BOOOF and i did not receive a pic or a video in that time as i was watching my data go boof in front of my eyes - that i quickly put off my data - but when i am on my home wifi ", "business_slug": "vodacom"}}
