{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "MTN", "description": "I have been struggling with MTN customer service. They increased the price of my contract without notice, provided terrible signal, and failed to assist me after my contract expired. I have been unable to cancel my contract and the debit order continues to deduct from my bank account. Their customer service is unresponsive and unhelpful.", "suggestion": "Improve customer service by providing timely and effective assistance to customers, ensuring accurate billing and contract information, and resolving complaints promptly."}, "meta": {"id": 3417769, "created_at": "2021-03-08 11:41:58", "review_rating": 1, "review_title": "MTN Customer Service Sucks", "review_content": "Hello\n\nI have been struggling for quite some time with MTN cutsomer service, both while still having contract and after it.\n\nEnd of 2019 December I opened a contract for R200 pm 10G Day time and 10G nite time (it was a special at the time). Not long after I had the contract I had a sudden notification that the price would increase, resulting my contract being R250 pm and it being only 6 months after I signed my contract with them.\n\nLater on I no longer had signal at home and if there was it was one WhatsApp maybe every 2 hours I received, absolutely terrible signal. I logged numerious complaints... only after 3 months they finally decided they had enough of my every day calls about the complaint. Installed a receiver and a router for me for free.\n\nNot long after this my contract was due to expire soon. The app just showing me I can upgrade and not when at all. \n\nIn December of 2020 I noticed my debit order was suddelnly R247 and I didn't think much of it. I went to an MTN shop to query my contract expiration date and they informed me it had already expired in November 2020. They gave me my reference number and told me to phone 135.\n\nThis is where the customer service after contract expiry gets worse and worse.\n\nAfter calling 135 a bunch of times, being on hold for hours in conclusion the call ended while I was on hold for more than a hour. I tried again the next day being frustrated and the robotic voice told me 135 was no longer a MTN number but now a Cell C number and the call ended. \n\nSerching website after website for an alternative number, I finally decided to send an email to customer service (***********) and they adviced me to send my complaint to ***********. \n\nAfter doing so all I got was a reference number and I haven't heard a word again. It has been 3 months since the incident and the debit order keeps deduction itself from my bank all when I've been trying to cancel the forsaken thing. \n\nI have even asked my bank if they could stop it, but informed me they cannot because the reference number keeps changing. Resulting in a new debit cancellatoin each month. Since then I have been reversing the debit order monthly manually. Hoping that THEY WOULD CALL ME. \n\nInserted real emails between me and customer care:\n \n12/01/2021\nMessage:\tYour number 135 is no longer working, it is Cell C. The entire last week you were offline when I phoned to cancel my contract. Please contact me asap.\n\n12/01/2021\nGood day Clarissa,\nThank you for your email. \nWe apologize for the delayed response.\n Kindly be advised that your query has been escalated to retentions department for further assistance and they will revert to you as soon as they done with your request \nWe look forward to being of service to you.\n\n25/01/2021\nGood Morning\n I haven’t heard any response as of yet.\n I reversed the debit order, because I no longer want MTN services, please help me asap.The longer the response takes the more your company is proving to me that customer service is of no importance.\n This is a problem I’ve had with MTN since I got my contract and it is very unpleasant.\n Thank you\n \n01/02/2021\nGood day Clarissa,\nThank you for your request. \nWe apologise for the inconvenience and delays caused.\nKindly email the retentions department on *********** for further assistance.\nKind Regards,\nBoipelo Phiri\nMTN SA\nReference Number: ********** \n\nMe to Retentions:\n01/02/2021\nGood Afternoon\nI wish to end my contract. No one is helping me as quickly as I had hoped, or at all.\nFind attached previous emails.\nKind Regards\n\n\nIn short, they have absolutely the worst customer service. ", "business_slug": "mtn"}}
