{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Service", "service": "Vodacom", "description": "Very bad service from Vodacom. My phone stopped receiving text messages and calls. The Customer Call Centre Robot was unable to assist me. After multiple emails, my phone/sim was synchronized but to no effect. I was advised to try my sim in another phone, but it didn't work. I assume the sim itself is faulty. It has been five days and I still can't receive calls or SMSs, which is causing difficulties in working, banking, and social interaction. This is shockingly bad service.", "suggestion": "Resolve the issue with my phone/sim as soon as possible to restore normal service."}, "meta": {"id": 3422524, "created_at": "2021-03-11 10:01:08", "review_rating": 1, "review_title": "Very bad service from Vodacom.", "review_content": "I have had a Vodacom Pay as You Go account for some years, and it has always worked fine. Recently, my phone stopped receiving text messages, and then also calls. On Sunday I took the phone into a Vodacom centre in Somerset West, and was told that I needed to phone the Customer Call Centre, but that I should avoid speaking to the Robot, as it would not be able to help me. The Robot proved impossible to avoid, but gave me no assistance whatsoever, including because it wanted me to respond to SMSs, whereas part of my problem was precisely that I wasn't receiving SMSs. I then emailed Customer Care to see if I could receive assistance. After multiple emails, my phone/sim was synchronized, but to no apparent effect. I was advised to try my sim in another phone, and it didn't work in that, as I reported back to Vodacom by email. I assume the sim itself is faulty? The reference number I was given was A9-NNC8-LIRS.  But five days after my first approach to Vodacom, I still can't receive calls or SMSs, which is making working, banking, or social interaction extremely difficult. This is really shockingly bad service. My cell no is **********, but that information is largely academic, as I can't receive calls except for WhatsApp calls. My office landline is **********, and my email address is ***********.\n\nDuncan Brown", "business_slug": "vodacom"}}
