{"chatbot": {"related": 1, "evidence": "The customer mentioned the use of a chatbot called 'Tobi' on the customer care line.", "classification": "Customer care chatbot", "description": "The customer complained about the chatbot diverting their call and not being helpful.", "suggestion": "Improve the functionality of the chatbot and ensure it is compatible with all communication channels."}, "complaint": {"classification": "Customer care", "service": "Vodacom Customer Care", "description": "The customer had difficulty reaching a consultant and faced issues with the chatbot and online account access.", "suggestion": "Fix the issues with the call menu, chatbot, and online account access to provide better customer service."}, "meta": {"id": 3422807, "created_at": "2021-03-11 12:08:12", "review_rating": 2, "review_title": "Vodacom Customer Care", "review_content": "After listening to the automated menu on your customer care line far too many times and trying to wait it out for the consultant on nearly every menu option mostly unrelated to the issue I wanted to solve, I FINALLY managed to get through to a consultant who was very helpful. I can't even remember during which part of the menu I was finally offered the option to hold for a consultant because your customer care line keeps trying to divert to your \"self-help\" bot \"Tobi\".\n\nSuggestions from a customer if you do not want to lose customers in future:\n\n1. If you want people to use the bot, that's all good and well, but make sure it at least works before you place it in your call menu. \n\n2. After going through nearly your entire call menu to get to a consultant, I can at least let you know, your \"Tobi\" bot only \"works\" on SMS, not WhatsApp. Even if you select the WhatsApp option. I can also tell you, typing \"menu\" as instructed after the bot texts, does not work. Typing ANY word relating to possible Vodacom issues such as \"account\", \"billing\", \"cancellations\" (I can go on), does not work. An annoying message just pops up saying the bot cannot help me with this, please dial 082 135. The sad reality is that customer care number sent me to the bot more times than I can count. \n\n3. Another area that needs fixing is getting into my account online. Once I have a set fee for a year or more, I don't go into my account online. Therefore I can never seem to remember the password I use the random time a couple years ago that I wanted to check when my contract is due for an upgrade. If I click \"forgot password\", it sends me an OTP. Which is all good and well, that works. However, when they send a new password for you to use, even after 1 min, 1 hour, 1 day. It will never work. So I cannot get into MY Vodacom account, FORCING me to phone customer care, which is pretty much FORCING me to use the broken bot.\n\n4. After finally reaching a very helpful consultant which is all I was looking for in the first place and they asked me to rate their service, you give an option to give them a 10 for very satisfactory. However, every time I typed 10, it said I gave the consultant a 1, and asked if I meant to give them a 1. Why ask to rate a 10 if a person can't give a 10 rating? Why not just make 9 the highest rating?\n\nI think it is absolutely ridiculous that I had to spend at least 2 hours of my time trying to get into my account online and phoning customer care to speak to a consultant to finally fix such a small issue. Fortunately for you, I'm quite patient, but I'm definitely not happy with having to try so many different avenues which is what took up my time. I can tell you now, there are many customers out there that would never have put up with this. The punchline, I just wanted to find out why my account was so high last month because for some reason I didn't receive an invoice for last month when I moved from a normal cell phone contract to only a data contract.  \n\nOn a positive note, while I was trying to access a consultant, I eventually had an idea to contact you on FB messenger. I received a reply within 5 minutes. Unfortunately, it came through just after a consultant answered the phone and helped me. I wish I had thought of taking that route first as I could have had 2 hours of my life to do something more useful and I wouldn't have written this poor review.\n\nBy the way, I would have given you a rating of 1 but seeing as your actual consultants are polite and willing to help I raised it to 2.", "business_slug": "vodacom"}}
