{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "I had an issue with my mobile phone and took it to Vodacom repairs. They quoted me almost R4000 to fix the phone and couldn't provide any error codes or diagnostic output. I don't understand why I need to pay for a repair if it's within the contract and not due to negligence. I asked if I could pay the remaining 8 months and get a new contract, but they said it's against their policy. I'm unhappy with this service.", "suggestion": "Vodacom should provide transparent and detailed information about repair costs and diagnostics. They should also consider allowing customers to pay the remaining contract and get a new one if they are not satisfied with the repair options."}, "meta": {"id": 3422004, "created_at": "2021-03-10 18:15:41", "review_rating": 1, "review_title": "Second vodacom complaint.", "review_content": "Second complaint. \n\nNo one contacted me yet. Hope this is not a bot auto replying to users.\n\nI am a loyal Vodacom customer surprised at the ****ty service I received. When for the first time in 4 years of having a contract and having a remaining 8 months on my contract I had a issue with my mobile phone restarting and taking it in for repairs at Vodacom repairs Tygervalley and being quoted almost R4000 to fix the phone. Being a technical person I asked for error codes or what the diagnostic output was, and they couldn't provide me that other than the quote and saying they dont deal with the error codes. I don't know why I need to pay for a repair on the phone if its within the contract and it wasn't due to negligence. I then asked the agent if I could pay the existing 8 months and get a new contract but they said they unable to do this and its the Vodacom policy and openly admitted this is how they get users to sign up for a new contract. Not the smartest way to retain business. UNHAPPY CUSTOMER!!!!!", "business_slug": "vodacom"}}
