{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Service", "service": "Vodacom", "description": "Vodacom's incompetence is affecting my work. I recently ported over my number from Telkom to Vodacom, but I can no longer send and receive SMSes. I've followed the necessary measures provided by Vodacom to rectify the issue, but nothing works. I've visited a branch and called the call center, but the issue remains unresolved. The chatbot is useless and the 'talk to agent online' feature is non-existent. The email responses are unhelpful and repetitive. This issue is time-sensitive and impacting my job as I cannot receive 2FA pins. Overall, this has been a sour experience with Vodacom's poor cellular connectivity and lack of investment in staff. Additionally, their system for opening a contract was offline.", "suggestion": "Vodacom should improve their customer service by providing effective solutions to SMS issues, ensuring the chatbot connects customers with agents, improving the 'talk to agent online' feature, providing more helpful email responses, and implementing a system to check SMS traces. They should also invest in improving their cellular connectivity and ensure their systems are highly available."}, "meta": {"id": 3428227, "created_at": "2021-03-16 14:21:27", "review_rating": 1, "review_title": "Vodacom's incompetence is affecting my work... ", "review_content": "Recently ported over my number from Telkom to Vodacom. All went well except that I can no longer send and receive SMSes. I've followed the necessary measures provided by Vodacom to rectify the issue but nothing works. \n\nI've been to a branch, they didn't help at all besides logging a reference ticket.\n\nI phoned the call centre. Their call centre agent assured me the issue would be fixed after they \"fixed it on their end\", but was unable to tell me what exactly the fix does. Needless to say, I ended the call and restarted my phone - it didn't work. Back to square one.\n\nTheir chatbot is useless since it actually doesn't connect you with an agent - it's a glorified USSD intergration tool. Stop talking it \"AI\", it's not.\n\nThe \"talk to agent online\" feature is basically non-existent on their help portal. I get it, you want to reduce call volumes and get people to fix their own issues instead. But then don't advertise it in all your correspondence and provide hyperlinks for it.\n\nI've probably sent about 6 emails now, each response is essentially useless, and things I've already tried (and informed them of).  Once I reply to a request,  I have to reauthorize my request, each time. Really?\n\nSurely you have a system where you can check traces of SMSes to determine any issues before wasting a clients time? This matter is becoming time-sensitive now because it's preventing me from doing my job as I'm unable to receive 2FA pins due to, potentially, your incompetence.\n\nOverall, this has been a sour experience and for Vodacom (a multi-billion rand company) that's unable to invest in its staff and provide the only service that they're supposed to, cellular connectivity - they do a pretty poor job at it, unfortunately.\n\nAlso to mention, when I tried opening a contract up the other day, their system that facilitates the transfer was offline. It's 2021 and a multi-billion rand company is still unable to implement a highly available solution? Come on guys, seriously.", "business_slug": "vodacom"}}
