{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Unauthorized Debit Order", "service": "CELL C", "description": "On 16 March 2021 an unauthorised debit order for R173.54 went off my bank account without my permission. I never signed up for any CELL C contract and I have never been a CELL C subscriber. There is no direct contact number to lay such a complaint, only an automated robot instructing the caller to do everything else but report any fraudulent activity associated with CELL C. And judging by the number of reviews on this platform it seems this has become common practice for CELL C, and it's an ongoing issue with no sign of being taken seriously or being resolved by the company. I would appreciate some assistance because there is no human voice willing to take my call if I'm not calling from a CELL C number.", "suggestion": "Investigate the unauthorized debit order and refund the charged amount. Improve customer service by providing a direct contact number for complaints and addressing fraudulent activity promptly."}, "meta": {"id": 3431228, "created_at": "2021-03-18 14:39:38", "review_rating": 1, "review_title": "Debit Order for A Contract I Never Signed Up For!", "review_content": "On 16 March 2021 an unauthorised debit order for R173.54 went off my bank account without my permission, and I immediately reversed this and was charged for it. I never signed up for any CELL C contract and I have never been a CELL C subscriber. \n\nThere is no direct contact number to lay such a complaint, only an automated robot instructing the caller to do everything else but report any fraudulent activity associated with CELL C. \n\nAnd judging by the number of reviews on this platform it seems this has become common practice for CELL C, and it's an ongoing issue with no sign of being taken seriously or being resolved by the company.\n\nI would appreciate some assistance because there is no human voice willing to take my call if I'm not calling from a CELL C number.  ", "business_slug": "cell-c"}}
