{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "Vodacom runs their business as if they are the only service provider. When trying to cancel, they entice you to stay with giving you discounts. Then bills you incorrectly. To rectify they have to listen to the call and after listening to a call they have to collect the phone in order to rectify the issue. Then lose the phone. Then their customer care consultants are robots who can't assist you with anything. Then when you try and complain, the switchboard lady starts yelling at you telling you it's not her job function. Whole month later still not resolved. Does anyone know if you able to cancel a contract based on bad service? Will be cancelling all contract line with Vodacom asap and will make it my personal responsibility to ensure that I switch as many people across to other service providers who actually care about their customers...", "suggestion": "Vodacom should improve their customer service by training their consultants to be more helpful and responsive. They should also address the issue of incorrect billing and improve their complaint resolution process."}, "meta": {"id": 3432445, "created_at": "2021-03-19 13:55:20", "review_rating": 1, "review_title": "Vodacom Sucks", "review_content": "Vodacom runs their business as if they they are the only service provider.\nWhen trying to cancel, they entice you to stay with giving you discounts.\nThen bills you incorrectly\nTo rectify they have to listen to the call and after listening to a call they have to collect the phone in order to rectify the issue.\nThen loose the phone \nThen their customer care consultants are robots who can't assist you with anything\nThen when you try and complain, the switchboard lady starts yelling at you telling you it's not her job function.\n\nWhole month later still not resolved. Does anyone know if you able to cancel a contract based on bad service?\n\nWill be cancelling all contract line with vodacom asap\nand will make it my personal responsibility to ensure that I switch as many people across to other service providers who's actually car about their customers...", "business_slug": "vodacom"}}
