{"chatbot": {"related": 1, "evidence": "The customer mentions the Vodacom ChatBot and expresses dissatisfaction with its performance.", "classification": "Poor performance", "description": "The customer complains about the Vodacom ChatBot being helpless and ineffective.", "suggestion": "Improve the functionality and effectiveness of the Vodacom ChatBot."}, "complaint": {"classification": "Wrong order & worst customer service", "service": "Vodacom", "description": "The customer purchased a Power Bank and a Poloroid Smart Watch, but received two Power Banks instead. They have been unable to get assistance from Vodacom's customer service, experiencing high call volumes and being transferred between departments.", "suggestion": "Provide better customer service by addressing the customer's issue promptly and efficiently."}, "meta": {"id": 3434800, "created_at": "2021-03-23 11:59:38", "review_rating": 1, "review_title": "Vodacom (Wrong Order & Worst Customer Service)", "review_content": "\n2nd December 2020 , i purchased a Power Bank and a Poloroid  Smart Watch on the Vodacom app.\n\n The Courier delivered the Power Bank at first and then a week or so later the second package. To my surprise it was a another Power Bank. \n\nI tried calling numerous times and even mailing. Each time one department will send me to another. Vodacom what is this Nonsense about? I bought a product were is it? What is this extremely high call volumes your talking about? (If it is true stop selling, reduce, implement that you can assist the customer’s you already have). Please explain this Vodacom, how is it possible to rate service if it only rings, well zero if you ask me, felt like i am apart of ghost hunters and on the same note back ground music, tone it down a little soft and gentle would i prefer on the ear Vodacom especially holding line endlessly for the hope of a answer. What you can do is Vodacom answer and i will surely rate. Now moving to TOBi - The Vodacom ChatBot all that i can say ( Helpless and one big joke) keep to the basics, just answer, Vodacom try you explain my situation   to Tobi). \n\nVodacom in conclusion i am not young anymore playing hide and seek was fun some decades ago. If your not so EXSTREMELY busy please assist that i can get my product\n\nOne last thing Vodacom do not use this platform to raise your concern about scams and what not. Make it safe for Vodacom Customer’s POINT . What you can do is to explain your self Vodacom were it went downhill and warn Fellow South Africans what to expect from you. ", "business_slug": "vodacom"}}
