{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Failure to cancel contracts", "service": "Vodacom", "description": "Vodacom do not even deserve a star. This is the 2nd time that i have had to write a poor review on Vodacom and the 2nd time the review is about cancelling contracts that Vodacom choose not to cancel. I have 3 contracts that have come to their end of life and i have cancelled them (with reference numbers) but they are still not cancelled. I have moved to the UK and trying to phone Vodacom all the time gets expensive and there is no way to contact them by mail because my mail bounces back. Every month they debit me and get my money and earn interest on money that should be sitting in my bank account.\n3 contracts. 3 cancellations on 5 Feb 2021 at 13:24 but still being billed\na. ********** ref 1-**********85105\nb. ********** ref 1-**********295222\nc. ********** ref 1-**********4106\nAnd now \"Sarah\" (clearly a BOT says that they were \"quotes\" and now i get another reference 1-**********3190 .\nI JUST WANT TO CANCEL MY CONTRACTS! THIS IS UNACEPTABLE", "suggestion": "Describe what can be done to resolve the complaint"}, "meta": {"id": 3450072, "created_at": "2021-04-07 08:31:24", "review_rating": 1, "review_title": "Failure to cancel contracts.   ", "review_content": "Vodacom do not even deserve a star.  This is the 2nd time that i have had to write a poor review on Vodacom and the 2nd time the review is about cancelling contracts that Vodacom choose not to cancel.  I have 3 contracts that have come to their end of life and i have cancelled them (with reference numbers) but they are still not cancelled. I have  moved to the UK and trying to phone Vodacom all the time gets expensive and there is no way to contact them by mail because my mail bounces back.  Every month they debit me and get my money and earn interest on money that should be sitting in my bank account.\n3 contracts. 3 cancellations on 5 Feb 2021 at 13:24 but still being billed\na.  **********  ref 1-**********85105\nb.  **********  ref 1-**********295222\nc.  ********** ref 1-**********4106 \nAnd now \"Sarah\" (clearly a BOT says that they were \"quotes\" and now i get another reference 1-**********3190 .\nI JUST WANT TO CANCEL MY CONTRACTS!  THIS IS UNACEPTABLE", "business_slug": "vodacom"}}
