{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "Vodacom customer care and collections department did not assist the customer properly in making a payment arrangement, resulting in the customer's lines being disconnected. The Tobi app also did not work as expected.", "suggestion": "Vodacom should improve their customer care and collections services to ensure that payment arrangements are properly captured and implemented. The Tobi app should also be fixed to avoid wasting customers' data."}, "meta": {"id": 3463685, "created_at": "2021-04-19 08:45:12", "review_rating": 1, "review_title": "VODACOM DISAPPOINTS YET AGAIN WITH TOBI APP NOT WORKING???", "review_content": "On 7 April at 07:26 I made a phone call to ********** and was directed to customer care because the collections dept only opens at 08:00.  The reason for me calling this time is because I drive about 30 mins to work and wanted to to this before I get busy at work.  I spoke to a client services consultant and informed her that I wanted to make a payment arrangement as I only got half of my salary this month.  She took all details and made the arrangement,  I did not ask her name, but she said that she has escalated the query to the collections department and that they will contact me.  On 8 April I got a link to use \"Tobi\" on which I once again logged a \"promise to pay\" although I captured it for 3 months - I meant only for this month - but my point I am trying to make is that it was captured.  On Friday, 16 April my lines were disconnected.  I called the collections department and the lady who answered told me that if I give her the reference number of the call made to client services she will assist me.  On checking my messages I found that I did not receive a sms with the reference number.  I then told her but I capture a promise to pay on the Tobi app whereby she informed me \"that does not count\"?????  So why waste my data on the Tobi whatsapp app if it doesnt mean anything?? She had a bad attitude and didnt even try to assist me.  When I told her that I did call on the 7th she just simply said - proof it.  I then called the cancellations department because I am furious with Vodacom.  I truly have a problem to make payment, I do all I can to make an arrangement, someone at customer care does not do their job, Tobi is a non-working app and my lines get disconnected.  I was then informed by the person there that I should request the call recording as proof that I called on the 7th.  (This is service).  So I called customer care and requested the recording of the 7th of April to prove that I did make the call and that the customer care consultant didnt capture it on the system.  Then I called the collections department to tell them to listen to the recording as proof that I did indeed make the arrangement and that some incapable person didnt do their job and now I am being \"punished\" for it.  The consultant told me that he will refer it to his supervisor and they will call before 17:00 to give me feedback.  This didnt happen.  I have been a customer of Vodacom for many years.  I have in the past made payment arrangements and this is now the second time they disconnect my lines after I made arrangements.  My wish is to cancel this contract asap because the one time I truly have a problem I am not assisted or listened to.  VODACOM JUST DISAPPOINTS!!  Customer Care and Collections services SUCKS!!", "business_slug": "vodacom"}}
