{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Service", "service": "Vodacom Fiber", "description": "Vodacom Fiber service is the worst in South Africa. The customer experienced delays in receiving equipment, lack of communication, and multiple technical issues with the internet connection. The customer also expressed frustration with the limited support hours and inability to cancel the service.", "suggestion": "Vodacom should improve their fiber service by addressing issues with equipment delivery, enhancing communication with customers, providing 24/7 technical support, and allowing customers to cancel their service more easily."}, "meta": {"id": 3469568, "created_at": "2021-04-23 11:03:12", "review_rating": 1, "review_title": "VODACOM FIBER WORST IN SOUTH AFRICA", "review_content": "PLEASE PELASE DO NOT USE VODACOM FIBRE. What a waste of time. I decided to switch over to Vodacom Fiber. Received the rooter on Tuesday 20 April. This after numerous calls to find out where my equipment is. Every time they will log a call and you NEVER hear from them. I connected everything after I contacted the call Centre and the friendly guy assisted me until I had internet BUT on the tempory data stick supplied until Fiber is installed. No issue but the next day NO INTERNET CONNECTION. Started with my log after log after log after call after call. Every time you contact(After pressing number button after number button to get a \"Live person\", they say \"Someone\" will call you back. Then you wait and wait. Phone again and this time they phoned back. Tried but could not fix it. They will AGAIN escalade it. EVERY TIME 24 Hours the message says.  Thursday 23d ,48 Hours+ I tried again after coming home and NO internet. Again phoning and pressing hundreds of buttons to get to a person that can assist(After trying the chat bot and sms etc etc). NO,They cannot assist just fiber department and they close at 5pm.  WE WORK until 5pm and use internet AFTER work-***!! How can there be NOBODY that can assist. Wait ANOTHER 24 Hours. My previous supplier had a 24 Hours \"Person\" that assisted in minutes ,not a chat bot of such stupid things in place. No call centre wil escalade again,they WILL Phone us.  Again without internet teh evening. At 10,no call,I call them. Again up and down and this time they state that teh router is not configured and tehy will call us back on MONDAY 26 April ALMOST A WEKK LATER!!!!!!!!!!!!!!!!!!!!!!!! AND this does NOT mean it will be fix by then. Thursday evening I tell the  lady CANCEL my fiber immediately, I had enough. CAN YOU BELIEVE -the answer-I CANNOT CANCEL, Only fiber department AND THEY ARE CLOSE.  After decades with Vodacom and good service and recommending them-NO MORE VODACOM. AS my lines now expire I will switch. Thanks for nothing Vodacom. I am sure you will loose more customers because of the worst Fiber service in SA-I AM SURE ABOUT THAT.", "business_slug": "vodacom"}}
