{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Failure to respond to jump in contract price", "service": "Vodacom", "description": "Clearly Vodacom cannot keep their own promises and insist on phoning you when the agents and services available cant resolve the problem and refer the matter to the accounts office \"we will respond in 3-7 days\" but have no way of escalating or contacting the mythical back office to follow up when they don't meet this promised service level - in a word useless.... Current status from Vodacom - NO RESPONSE...", "suggestion": "Please resolve urgently."}, "meta": {"id": 3469305, "created_at": "2021-04-23 08:28:57", "review_rating": 1, "review_title": "Failure to respond to jump in contract price", "review_content": "Clearly Vodacom cannot keep their own promises and insist on phoning you when the agents and services available cant resolve the problem and refer the matter to the accounts office \"we will respond in 3-7 days\" but have no way of escalating or contacting the mythical back office to follow up when they don't meet this promised service level - in a word useless.... Current status from Vodacom - NO RESPONSE...\nConversation below:\nPROGRESS? – Well past your 7 day response promise?\n\nFrom: *********** <***********> \nSent: Sunday, 11 April 2021 9:10 AM\nTo: ***********\nSubject: Re: Vodacom Customer Care Reply - Authentication Response Ref: 0028XaG6W6448VY2\n\nGood day Len Berzen\n \nWe acknowledge the receipt of your email.\n \nApologies for not being able to contact you due to technical issue.\nPlease note your query has been escalated and reference number is 1-**********1897.\nIt will take 3 to 7 working days to get feedback.\nHere are some of Vodacom’s easy-to-use self-service channels available to you:\n•My Vodacom App\n•Vodacom Portal (www.vodacom.co.za)\n•WhatsApp TOBI **********)\n•USSD *135#\n \n \nRegards\nConnie Nthekenyane\neService Team\n \n\nOn 2021/04/10 10:41, Len Berzen Berzen, wrote:\nHi,\n \n \nAs requested,:\n \nPlease reply to this email with these three bits of personal information: \n1.\tID number or Company Registration Number for corporate accounts  ****** 083\n2.\tPhysical or postal address that appears on your account   PO Box ********\n3.\tYour Vodacom account number  I**********-3\nIssue is:\n1.\tMonthly bill has jumped R182 without explanation or notification,\n2.\tThis contract was confirmed for rollover at current rate with Vodacom as you have nothing similar currently,\n3.\tIf I need to sign a new contract: I do not want a contract with a device and I would expect a reduction not increase as my 2 similar Cell contracts cost me R299 each and offer more data and call time than yours.\n4.\tI have already wasted more than 4 hours trying to resolve this as suggested with your useless chat bot and your call centre that cant resolve this as it has to refer this to “contracts” who apparently take 7 days to answer and did not as promised send me a call number.\n \nPlease resolve urgently.\n", "business_slug": "vodacom"}}
