{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Connection issue", "service": "router", "description": "I still have an unresolved issue with my router, the consultant dealing with my query is robotic on emails or plain stupid, I have explained myself so many times, I had an old router before RAIN offered me their 5G option. My old router never had a connection issue in when I visit home in Bloemfontein as there are only has 4G coverage, and my old router was 4G. Now this new one doesnt connect at all even though it should connect both 4G and 5G. I have reset the router, moved it on all corners of the house, still no connection. The so called consultant keep telling to do the same thing over and over like I'm a retarded. I am over this nonsense. I am not willing to pay for the days where I couldn't use my WIFI because of your incompetence. RAIN is quick to collect money, but drags their feet's to resolve PAYING customer queries. My ref is **********", "suggestion": "Resolve the connection issue with the router and improve customer service"}, "meta": {"id": 3475658, "created_at": "2021-04-29 17:36:48", "review_rating": 1, "review_title": "Connection issue", "review_content": "I still have an unresolved issue with my router, the consultant dealing with my query is robotic on emails or plain stupid, I have explained myself so many times, I had an old router before RAIN offered me their 5G option. My old router never had a connection issue in when I visit home in Bloemfontein as there are only has 4G coverage, and my old router was 4G. Now this new one doesnt connect at all even though it should connect both 4G and 5G. I have reset the router, moved it on all corners of the house, still no connection. The so called consultant keep \ntelling to do the same thing over and over like I'm a retarded. I am over this nonsense. I am not willing to pay for the days where I couldn't use my WIFI because of your incompetence. RAIN is quick to collect money, but drags their feet's to resolve PAYING customer queries. My ref is **********\n", "business_slug": "rain-internet-service-provider"}}
