{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "Vodacom cut off my business phones multiple times without prior notification, leaving me vulnerable and unable to communicate. They also failed to inform me of outstanding payments and cut off my phones without warning. This put my safety at risk while driving and caused extreme stress and anxiety.", "suggestion": "Vodacom needs to improve their customer service by providing proper notification before cutting off services, informing customers of outstanding payments, and ensuring that their operators have the power and willingness to assist customers in emergency situations."}, "meta": {"id": 3479961, "created_at": "2021-05-04 09:29:01", "review_rating": 1, "review_title": "Vodacom is just a robot.. you need to bring the human factor back", "review_content": "So my business phones were cut off 4 times over the last week. Twice during my adventure tours leaving me vulnerable if anything negative were to happen. I was unable to send any messages make any calls which is crucial for my business. I had to use one of my client's phones to arrange the pick-up at the end of the tour and this was very embarrassing. Vodacom did not alert me prior to this and simply just cut off the phones whilst I was on tour. After calling the phones were put back on and I received an apology, the following day the same thing happened once again,,, this time the agent on the phone said it will definitely not happen again and 100% guarantee my phone lines will not be cut. The following day the phone lines were CUT ONCE AGAIN! I called Vodacom and they said that my account was 23c in arrears... So they just cut my phones off without any notification. I was not informed of the outstanding R0.23 on my account... so I paid this immediately. 3 days later it was turn of the month and once again my phones were cut, I called the number and was informed I owed R4600 from the last bill.. they just cut me without any warning.. I paid this last night. I had to leave for Cape Town (3 hour drive) at 5am and by then the phones were still not on. I was basically driving without any communication. on my way the car started to breakdown whilst I was on the phone with the operator. The lights were flashing on and off and all electronics were rapidly switching on and off as well as the cat cutting out. I asked him to please put the phone back on as I still had to get to Cape Town and my life was at risk if I was unable to communicate on the phone. He said that he can do nothing and the computer switches on and off automatically and although he understood my situation there was NOTHING he could do.. I managed to settle the car down and made it to Cape Town safely but had an extremely anxious drive past townships and high danger areas on the N2. It was an extremely stressful journey and I prayed all the way that the car would not break down and I was blessed with no more mechanical problems during the journey. \n\nBasically I pleaded to the operator for my safety and he said he could not do anything. I am done with Vodacom!!! I have had contracts for the last 15 years and never defaulted on my obligation but when you need their help all they say is that they cannot help as the system is computer driven...\n\nVodacom needs to look at this seriously as I may have been killed this morning if broken down in the wrong area. They put my life at risk and the risk of my 2 daughters losing their father. It is simply just disgusting! The human factor must be brought back into the business instead of robotic operators not having the power or will to go out of their way to assist customers. \n\n", "business_slug": "vodacom"}}
