{"chatbot": {"related": 1, "evidence": "The complaint mentions the chatbot named Tobi Bot", "classification": "Customer service", "description": "The customer is complaining about the chatbot not being helpful", "suggestion": "Improve the chatbot's ability to provide useful assistance"}, "complaint": {"classification": "Billing", "service": "Vodacom", "description": "The customer's airtime keeps disappearing and they are unable to get help from Vodacom", "suggestion": "Provide better customer support and address the issue of disappearing airtime"}, "meta": {"id": 3482906, "created_at": "2021-05-05 20:09:31", "review_rating": 1, "review_title": "Missing airtime and not way to get through to vodacom. Time for a massive boycott.", "review_content": "My airtime keeps disappearing. Vodacom uses any balance to automatically purchase airtime. Today I recharged with R110. R61 went to airtime advance. R23.96 to a call. I had a balance of 25.04. I wanted to buy a WhatsApp ticket for R3 as I was leaving the house where I have fiber. As soon as i dialed *111# and buy it automatically took R25 and it allocated me a data bundle for 100meg that I never requested. Ii have suspected that my airtime has gone missing but this time i saw it happen in front of my eyes. the system is programmed to make sure your balance is zero.. when you buy a product it keeps on promoting you tying to find how to use all your balance. I have had enough. Then I tried to get help but the STUPID Tobi Bot kept making a fool of me. that bot things is such a disrespect to clients! As usuall it did not help. I tried to log a query. that does not work.  I tried 135 that was another machine. there is no chat feature. basically you cannot get through to a help agent for Vodacom. They don't allow you to complain or get help! That was the last time. I am mobilising on social media and the news- its time for clients to boycott Vodacom. ALL the people I know on Vodacom say their airtime disappears and they cant get help. TIME TO BOYCOTT VODACOM. WATCH THIS SPACE. WE HAVE BEEN DISRESPECTED ENOUGH. ITS TIME FOR VODACOM TO BE SHOWN THE DOOR. If you think I am pulling wool over your eyes Vodacom, hide and watch. Its time this issue is solved publicly and  nationally. Time to embarrass them into changing their ways ", "business_slug": "vodacom"}}
