{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "Extremely bad service, annoyed customer. Unable to cancel Vodacom Tablet Contract despite multiple attempts and being given incorrect information.", "suggestion": "Provide better customer service and ensure accurate information is given to customers. Improve the cancellation process and provide alternative contact options."}, "meta": {"id": 3492072, "created_at": "2021-05-13 16:52:12", "review_rating": 1, "review_title": "EXTREMELY BAD BAD BAD SERVICE,   EXTREMELY ANNOYED CUSTOMER !  CANT BELIEVE YOU CAN BE SO IGNORANT ! ", "review_content": "Vodacom Complaint :  I have phoned Vodacom on no 135 date 12 March 2021 to cancel my Vodacom Tablet Contract **********. \nIt was suppose to be done 04 April 2021.  \nTo my surprise they billed me again 03/5/2021.  \nWhen I phone them on 135 12/05/2021, they said it I get cut off to phone **********.  They then said they can not help met as the person who started the cancellation must finished it.  I must phone **********. I have been phoning that number 8 times and all you hear is music and then the call is cut.  Not even a robot speaking to me. No options available to press 1 or 2.  What a JOKE !  \nI phoned Vodacom ********** back 9 times telling the same story every time and they tell me the same story every time they cannot help me, I must phone the 031 number. And they keep telling me they cannot help me,  the more I explained to them that there is no one at ********** they say that is the number I must phone,  They listened to my phone call on 12 March and they heard I said I want to CANCEL !   All my phone calls to them they keep saying they cannot cancel,  some Goman or Gowan person started the cancellation and must finished it,  Maybe he/she is sick or dead,  they also do not have an alternative number for me or email to contact.  I got annoyed and said to them I deal with Vodacom and not some other company they hire to help them (rewards company), they must cancel my contract.  They said they cant.  It is still not cancelled,  they are still deducting the amount every month and unfortunately I cannot stop my debit order because I do have my other phone on there. \nVODACOM ! WHAT IS WRONG WITH YOU ? \nThen a Khaya from Vodacom said I must phone the Vodacom Store on **********, they will be able to cancel.  And because he gave me an alternative number I must give him a Hello Peter nice score and he emailed me the link to my email address.  I phoned the store ********** and they said they cannot help me, they do not do cancellations since 2012,  only ********** do.    \nHOW AM I GOING TO GET MY CONTRACT CANCELLED EVERRRRRRRR VODACOM ?", "business_slug": "vodacom"}}
