{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "Vodacom has no customer service. The customer has been trying to resolve an issue regarding a contract that was continued without permission and has been paying for a service they are not using. They have not received any response or resolution from Vodacom despite multiple attempts to contact them.", "suggestion": "Vodacom should assign a representative who can properly address the customer's issue and provide a resolution. They should also improve their customer service to ensure prompt and effective communication with customers."}, "meta": {"id": 3496866, "created_at": "2021-05-18 15:43:38", "review_rating": 1, "review_title": "Vodacom has no customer service ", "review_content": "Vodacom has done it again.... Absolute no customer service whatsoever.  A call centre agent called me about three weeks ago to tell me about this amazing offering they have on my ****le deal that I can add an extra 10gig of data to it.... I was shocked, because last year June 2020 when another call centre agent called me and asked if I wanted to continue with my ****le package (after it had expired - it was a 2-year contract), I said NO THANK YOU, because I have fibre at home now, and never use that ****le anymore.  I told the call centre agent about it, and asked him if I was still paying for something I wasn't using, he then referred me to the cancellation department, who then said no I can't cancel the contract because it is a two-year contract, after which I said, but I never gave permission to continue with the contract.  I have been paying for something I am not using, I even told him that he can go look on the ****le history and see that I haven't been using it because I thought it was cancelled.  He then gave me some sort of weird (I only found out afterwards that it's not a proper reference number) reference number and said it would take 2 to 3 working days to resolve.  It's more than 14 working days later and I have still heard nothing from them.  And when I call the customer care line they send me from one to the other to the other person.  I even landed up one time when I called at the fraud department, that was when the lady said the reference number I had is not a Vodacom reference number.  Then she said I must email the fraud department with my dispute, I did that, and received another reference number but again 1 week later and still nothing..... Please can someone from Vodacom, someone that knows what's going on and someone that's not a robot, please talk to me and help me resolve this issue.  The end of the month is coming closer again, and I don't want to pay for another month of that ****le.  BTW  I asked for my recording (\"all calls are recorded for quality and security purposes\" supposedly) where I gave permission to continue with the contract, and again NOTHING!  Please help!!  ", "business_slug": "vodacom"}}
