{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "TELKOM", "description": "TELKOM has fraudulent staff members who upgraded the complainant's contract without consent and delivered the phone to a different address. The complainant has not received a response to their complaints via email, phone calls, and social media platforms.", "suggestion": "Investigate the fraudulent staff members, provide a resolution to the complainant, and improve customer service to address complaints promptly."}, "meta": {"id": 3502132, "created_at": "2021-05-23 16:37:05", "review_rating": 1, "review_title": "TELKOM HAS CRIMINALS WORKING FOR THEM", "review_content": " I am very very disgusted with the service i have received from TELKOM.\n\nTELKOM is a bunch of FRAUDSTERS !\n\nMy contract that i have had for 2 years now ends in 05June  2021\n\nI called in on the 5th of May to give a months notice of cancelation, i spoke to Lizzele Philips who advised me that i had ugraded my contract to R879  in April and the phone was delivered to an adress in Ladysmith. She said i had called in April and changed the adress. That is a load of ****, i received a call  a few months ago from your staff member stating that i was eligible for an upgrade and i said i will not be upgrading my contract. I did not call in to change an address, this was done by your criminal staff member who saw an opportunity but my question is, what type of processes do you have at telkom that allow sensitive information like 'postal address' to be changed telephonically, should this not be done at the branch????I really warn anyone who have an existing contract that is about to end, to ensure they follow up that TELKOM STAFF does not upgrade their contract without their consent and send the phones to their friends. Furthermore there is no security at all at Telkom, what authentication process was done when this phone was delivered to the fraudster??? I have never lost my ID so how did the delivery man authenticate this person?? \nOur private information is not safe at all with Telkom. I warn the public. \nAnyway I was told by this call agent  to send an affivadit, my proof of adress and copy of ID to the complaints department @ ***********. I sent the email the next day and received a non existance automated email.\n\n I called your call centre again, Spoke to Thembalethu Bhengu on the 6th of May at 4:30 who advised me to send my complaint to *********** or *********** and that she will escalate my matter to her Team leader who will contact me promptly, 15 days later, I have still not received a call!!!!!!! \nI need to know the name of that team leader, they clearly do not care about the clients needs and complaints. \n\n I have since sent the complaints and documents to the above emails addresses- no response ( not a shocker)\n\nI have gone on twitter and complained, Telkom doesn’t care – no response.\n\nI have gone on Facebook and complaint- chatted to a robot named Karabo again posted my complaint , but no help, the second time I posted my complaint on telkoms public Facebook platform– I was ignored!!! \n\n I am not accepting that debit for your incompetent , fraudulent staff members.\n\nMy other worry is this fraudster is still working for TELKOM and probably defrauding other innocent clients as no1 cares, they have ignored all my complaints sent to them via social media platforms, emails and calls! \n\n I will be approaching the Ombudsman, I understand the rules under FAIS ACT and that you only approach the ombudsman if the company has not resolved your issue. In this case I am being completely ignored!\n\n I will not rest until my matter is resolved and the parties who defrauded me are addressed.\n\n\n\n \n\n\n\n \n\n\n\n\n\n \n\n\n \n\n \n\n", "business_slug": "telkom"}}
