{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Telkom", "description": "Telkom did not inform me that the account was in arrears. There was no communication whatsoever. They usually send an SMS with the banking details if the account is in arrears a week or two later but there was no such this time around. I am required to pay a lump sum of R1,932 including the June debit order. I do not have a lump sum. I am willing to make a payment arrangement provided the line is reinstated since it was a non-performance issue on their side. Telkom did not do its part as a service provider. I don’t understand why the line should remain suspended when I am willing to make a payment arrangement. This would mean I am not getting a service at all yet, I should pay for data that I am not using. If I am going to lose all of May's data which I have not used, then why should I pay for May? Furthermore, if the line remains suspended until I pay off these arrears, will I accumulate the data that I have not used for the months in question because if the data will not accumulate, it does not make sense to pay for a service that was suspended and for data that I have not used and will never use. If Telkom insists that I pay the lump sum arrears first before reinstating the account, then I would like to cancel this subscription. Immediately. I will pay the cancellation fee of R807. So that no further amounts accrue and then I can make an arrangement to settle the arrears. I hope Telkom will have the decency to respond to this because, really, their customer care service is rotten. Their contact centre agents are programmed like robots. All they say is 'pay the outstanding. Then your line will be reactivated'.", "suggestion": "Telkom should improve their communication with customers regarding account arrears and provide options for payment arrangements to avoid service suspensions."}, "meta": {"id": 3513556, "created_at": "2021-06-02 13:20:51", "review_rating": 1, "review_title": "TELKOM'S ROTTEN CUSTOMER SERVICE!", "review_content": "I wanted lodge a formal complaint with Telkom first for poor customer service. But to put a cherry on top of their rotten service, they say I cannot lodge a complaint. My debit order date is the 5th of every month. On the 5th of April Telkom did not debit my account. There was sufficient funds in the account. Therefore, it was not a bounce. And if it was a bounce, the bank would have notified me of the bounce and would have charged me. I called the contact centre and I was informed that Telkom did not collect the money due to a system error. During that time, I did not receive any notification from Telkom or any type of communication indicating that the account was in arrears.\n\nI had service for the duration of April but in May I realised that I had no internet connection. I thought there was something wrong with either the router or sim card because I was unaware that the money was not collect. On the 25th of May, I inserted the sim card in my phone and it is only then that I learned my line has been suspended. And when I called, I learned that indeed it was suspended due to non-payment. As a result of Telkom having failed to collect the money.\n\nI am unhappy because:\n1.\tTelkom did not inform me that the account was in arrears. There was no communication non whatsoever. They usually send an SMS with the banking details if the account is in arrears a week or two later but there was no such this time around.\n2.\tI am required to pay a lump sum of R1,932 including the June debit order. I do not have a lump sum.\n3.\tI am willing to make a payment arrangement provided the line is reinstated since it was a non-performance issue on their side. Telkom did not do its part as service provider. I don’t understand why the line should remain suspended when I am willing to make a payment arrangement. This would mean I am not getting a service at all yet, I should pay for data that I am not using. If I am going to lose all of May's data which I have not used, then why should I pay for May?\n4.\tFurthermore, if the line remains suspended until I pay off these arrears, will I accumulate the data that I have not used for the months in question because if the data will not accumulate, it does not make sense to pay for a service that was suspended and for data that I have not used and will never use.\n\nIf Telkom insists that I pay the lump sum arrears first before reinstating the account, then I would like to cancel this subscription. Immediately. I will pay the cancellation fee of R807. So that no further amounts accrue and then I can make an arrangement to settle the arrears.\n\nI hope Telkom will have the decency to respond to this because, really, their customer care service is rotten. Their contact centre agents are programmed like robots. All they say is \"pay the outstanding. Then you line will be reactivated\"\n\n\n", "business_slug": "telkom"}}
