{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Billing", "service": "Telkom", "description": "I have been billed twice for amounts that I have already paid. They acknowledge the payment but still bill me again.", "suggestion": "Resolve the billing issue and ensure accurate billing in the future."}, "meta": {"id": 3552384, "created_at": "2021-07-07 07:26:14", "review_rating": 1, "review_title": "Telkom and Incompetence, imbecile extortioniers", "review_content": "I have never experienced such extortion at the hands of imbeciles. For 2 months now I have been billed twice for amounts that I have paid already.\n\nThey debit my bank account on different days to that which was agreed. Then when there are no funds in that moment its rejected right? But the second i get funds i pay via eft, they acknowledge it on my invoice that they received it, but a month later they bill me again because, like toddlers they didn't get their money the way they wanted.\n\nBut why acknowledge the payment if you gonna bill me again? Then I have tried to contact them, their customer care line doest exist, they say call 081180 but that just leads you to a robot. So they don't want to hear from me because they know they are greedy, imbeciles.\n\nThen I went to the branch, got \"assistance\" but nothing happened, just a logged case then a text to say it was resolved  but no correspondence. It was resolved in their eyes after they took my money the second time.\n\nI was put in touch with another consultant in Telkom business, but he was as useless as a camel in a dust storm. He said I must email him my proofs, which I did but no response, nothing. The address he gave me was ***********\n\nNow this is my last resort, they want R1267.89 for which I paid end of May, R959.81 for which I paid end of April. See the pattern? Next month they will want the amount I paid end of March. Extortion? Incompetence?", "business_slug": "telkom"}}
