{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Data Usage", "service": "Vodacom", "description": "Vodacom is unable to provide a detailed statement of where the customer's data is going. The Vodacom App shows conflicting data usage statuses. The customer is experiencing a significant drop in data without any apparent reason.", "suggestion": "Vodacom should provide an App that accurately shows the customer where their data is being used. They should investigate the issue and resolve any server setting issues that may be causing data problems for their customers."}, "meta": {"id": 3560488, "created_at": "2021-07-14 15:16:22", "review_rating": 1, "review_title": "Vodacom is unable to tell you where your Data vanishes to, through their own App and system.  Be prepared to loose (7Gigs in 3 days)data, and no one knows anything. ", "review_content": "I would like to understand how my Data provider can not tell me in a detailed statement where 7 Gig goes in 3 days.  I would also like to understand how the very same Vodacom App states that 2 Gig is \"used\" in my total availability of data, but when you go to the Calendar Custom data - it states that 21.13MG has been used in 2 days.  Is it then at all possible to trust their Vodacom App to declare that the data usage is correct?  On a normal working day, with Youtube Videos, I myself do not use 500 MG, How does 7 Gig just drop in a house where no kids has access to the data by themselves, and only 2 phones are connected - without upgrades done.  My data daily drops up to 2 gig, but I use other Wifi as well - while my personal data is turned off.  I find it criminal that a company's own App states 2 different statuses of data usage.  I've spoken to Vodacom via Messenger, and the very same \"robotic\" answers are being repeated.  I'm being reverted to a technician but the funny thing is that the technician tells me that all their customers who deals via Vodacom are unhappy and has all Data trouble, Server Setting issues.  I'm expected to change my server settings every time I use Data via Vodacom and another provider. My request to Vodacom is this:  Hand me an App that shows me exactly where my data is going.  You provide my data - but you can not show me where my data is going, yet, you expect me to pay you for data, so that my data can be \"lost\" / untraced.  Vodacom; Man-up to your service.  My car is more effective than you since it CAN tell me how many kms I've done and how many kms to the litre I get.  I've never had trouble with Vodacom, all of a sudden it's ridiculous. I am heading to a closed account = never to return.", "business_slug": "vodacom"}}
