{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Internet Connection", "service": "Telkom", "description": "Telkom disconnected my internet connection for reasons unknown to me. Tonight my phone says that there is no internet connection despite me having over 1.8gig on my telkom sim card. Then it says no internet connection and then from nowhere i can't use my data. There is NO customer service line that connects me to an agent, i simply want my phone and sim and data to work, because i am using my phone now and cell c sim card to write this but for some reason the telkom sim is not working in this phone. It is NOT network because my mom is right next to me using telkom on her phone. This is unacceptable and very unprofessional, when you are owed money you disconnect services, now that you owe me a day and i bought a ten day data connection i demand you fix this problem immediately and pay me back my days worth of data. I even tried whatsapping you and your robot knows nothing, give me back my internet connection on my phone", "suggestion": "Please investigate and resolve the issue with my internet connection. I also request a refund for the day of data that I was unable to use."}, "meta": {"id": 3570611, "created_at": "2021-07-24 21:26:48", "review_rating": 1, "review_title": "Telkom disconnected my internet connection  for reasons unknown to me", "review_content": "Tonight my phone says that there is no internet connection despite me having over 1.8gig on my telkom sim card. Then it says no internet connection and then from nowhere i can't use my data.  There is  NO customer service line that connects me to an agent, i simply  want my phone  and sim and data to work, because i am using my phone now and cell c sim card to write this but for some reason the telkom sim is not working in this phone. It is NOT network because my mom is right next to me using telkom on her phone. This is unacceptable and very unprofessional, when you are owed money you disconnect services, now that you owe me a day and i bought a ten day data connection i demand you fix this problem immediately and pay me back my days worth of data. I even tried whatsapping you and your robot knows nothing, give me back my internet connection on my phone ", "business_slug": "telkom"}}
