{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "customer service", "service": "MTN", "description": "MTN has the worst customer service. They have changed my debit date without my consent, causing financial penalties. They have also provided incorrect support on their Facebook page and ignored my requests. The overall service is below poor.", "suggestion": "MTN should improve their customer service by ensuring consent before changing payment methods, providing accurate support on social media, and addressing customer concerns promptly."}, "meta": {"id": 3572606, "created_at": "2021-07-27 08:25:52", "review_rating": 1, "review_title": "MTN has the WORST customer service.", "review_content": "MTN has either lost interest in servicing their clients at the level it used to service their clients or they have no idea on how to hire quality and friendly staff for their customer service department.\n\n My first complaint (Already Resolved however I thought everyone should see this as my Dad is now experiencing the same problem)\n\n- MTN has changed my debit date numerous times without my consent in my eyes I see that as a breach of contract, they have changed my payment methods from debit to EFT after I told them not to put my account on cash payment I don't have time to make payments take what I owe you and get on with it.\n\nThey stopped my account tried to debit me numerous times on the WRONG day which cost me penalties of R110 per debit order rejected.\n\nAfter I asked them to change the date, they debited my end of the month and then the beginning of the next me pushing me into arrears on my account & causing my next month to be financially unstable.\n\nSecond complaint\nMTN has a lack of service when it comes to its Facebook Page support.\n\nI have asked them for one thing they sent the wrong thing then I asked again and they said they would send it and I still have not received what I wanted.\n\nI can tell you now that I'm being ignored by MTN and as a customer probably not the only customer that spends thousands at MTN they should wake up and realize without their customers they wouldn't exist!\n\nI don' want to email them because you are answered by a robot, I don't want to phone them because you are answered by a robot at first.\n\nOverall I am deciding whether I should cancel my contract and not upgrade next month because the service is below poor.", "business_slug": "mtn"}}
