{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Poor Service", "service": "Vodacom", "description": "I recently received a phonecall from Vodacom telling me that my contracts are due for upgrade. I really was thinking, wow great service. THAT is where it is ending. They explained the package to me and with the start of the new month no airtime was loaded as per the contract. I tried to phone them, no answer. Then I tried to chat online with them, online chat is just ended before a consultant even speaks to you. Then I tried Mobi (the \"robot\") and also no success. Then I phone the customer service department and made the selection to cancellations. Somebody picked up and I could actually speak to someone. They mentioned to me that they will put me through to the correct department and even gave me a direct number. I asked them to please transfer my call to someone who I can speak to and not all these selections that I need to make. Well, they did transfer me, but the selections again and no answer. What do we need to do in order to sort out a query with Vodacom????", "suggestion": "Vodacom should improve their customer service by ensuring that calls are answered promptly, online chat sessions are not abruptly ended, and their chatbot (Mobi) is more effective in resolving customer queries."}, "meta": {"id": 3584119, "created_at": "2021-08-05 10:48:16", "review_rating": 1, "review_title": "Vodacom - Poor Service", "review_content": "I recently received a phonecall from Vodacom telling me that my contracts are due for upgrade. I really was thinking, wow great service. THAT is where it is ending.\nThey explained the package to me and with the start of the new month no airtime was loaded as per the contract.\nI tried to phone them, no answer. Then I tried to chat online with them, online chat is just ended before a consultant even speaks to you. \nThen I tried Mobi (the \"robot\") and also no success.\nThen I phone the customer service department and made the selection to cancellations. Somebody picked up and I could actually speak to someone. They mentioned to me that they will put me through to the correct department and even gave me a direct number. I asked them to please transfer my call to someone who I can speak to and not all these selections that I need to make.\nWell, they did transfer me, but the selections again and no answer.\nWhat do we need to do in order to sort out a query with Vodacom????", "business_slug": "vodacom"}}
