{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Billing", "service": "Vodacom", "description": "I was misled about the phone specifications and received a lower-end model. I requested a new device but it would take too long. I received a voucher as compensation but my debit order bounced due to incorrect payment date. I refuse to pay for Vodacom's mistakes and I am being harassed to pay the penalty. My service has been cut off.", "suggestion": "Put my service back on and ensure that no additional money is taken from my account other than the monthly payment for my phone."}, "meta": {"id": 3591635, "created_at": "2021-08-12 14:36:52", "review_rating": 1, "review_title": "I WILL NOT PAY FOR VODACOMS MISTAKES", "review_content": "So from the start of my contract which is less than 6months old the consult that actually wrote contract was misleading i was told i would get the samsung a21s with 6g ram an 64g space I however received the entry level with 3gig ram 32g space. I was then told that a new contract could be done an the phone collected but that could take up to a month if not longer until I receive a new device which I refused as I already sold my previous phone an need a phone for my job an they did not have a phone that matched the specs I was told for R230 a month which meant I would have to pay more at which point the manager apologized for the agent who was new an I requested some form of compensation at which point the manager sent me a R600 voucher, I accepted it but now the problem is that my debit order bounced due to the agent not following my instruction as I said I get paid the 20th an that should be my debit day an no later otherwise it will bounce hence I don't have a single debit going off later than the 20th an then 1 successful debit went of on the 30th however that funds was meant for something else but vodacom stole out my account an the 2nd time the debit went off the last day off the month again which then bounced an I was charged a mag tape fee of R150 from my bank for debit bouncing an vodacom is now harassing me with voice recordings to pay the penalty WHICH I WILL NOT DO!!!! My account is up to date but I refuse to pay for the incompetence of vodacoms agents, I lost the names of the original agent an Manger but over the past month I've spoken to koketso Maleka, Zanele Khumalo, Nelisiwe (did not want to give her surname), Nthabiseng Dube an Luwando Madodane who I have all requested to speak to a manager but to date all I get is voice recordings harassing me to pay the penalty of +-R108 for the debit bouncing, AND MY SERVICE HAS BEEN CUT!!!!!!!!!!!!!. I WILL NOT SPEAK TO ROBOTS OR ANSWER PRIVATE NUMBERS!!!! I AM TRULY SICK AN TIRED OF YOUR PATHETIC SERVICE, IF MY SERVICE IS NOT PUT BACK ON AND ANY OTHER MONEY IS TAKEN OUT MY ACCOUNT OTHER THAN THE MONTHLY R230 FOR MY PHONE I WILL 100% TAKE THIS FURTHER.\n\n\n", "business_slug": "vodacom"}}
