{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Billing", "service": "Vodacom", "description": "Vodacom is charging the customer for APPSUP content services that they never signed up for", "suggestion": "Investigate the charges and refund the customer's money"}, "meta": {"id": 3596744, "created_at": "2021-08-17 16:36:14", "review_rating": 1, "review_title": "Disappearing Vodacom Airtime, due to Illegal APPSUP Content Services that I never signed up for", "review_content": "Vodacom are stealing money shamelessly in broad daylight. I have a prepaid phone, and my airtime keeps disappearing. On inspection, I noted that someone somewhere has decided that I want APPSUP content services, which they have charged me almost R300 for in the last month.\nI never signed up for this, and I do not have any idea what it is, I have deactivated it, and then Vodacom decided that they should charge me a further R50 just for the fun of it, so I had to cancel this APPSUP content services again.\nWhen I try to phone Vodacom, they do not answer & do not assist in any way, they keep directing me to their chatbot, which is unable to give me answers.\nHow can Vodacom get away with this sort of thievery. They are billing customers for something they never signed up for, and not even letting the customer know that there is an active service that they are being billed for, until your airtime is gone & then only if you query it do you find they have signed you up for something you never requested or consented to.\nI ant to see proof of when I signed up for this service that they are billing me for, as I never clicked on any links or signed up anywhere for this. I do not even receive sms's or any product or service for this supposed APPSUP.\nWhat the heck is APPSUP, and what are you paying for.\nThis should be investigated by authorities, as this is happening all too easy & Vodacom just makes it your problem, and charges you money without having to ever prove that you even signed up for his rubbish.\nI want my money back that was shamelessly stolen from me, unless Vodacom can prove to me where I signed up for this ****.\nI am sure there are many many more people that they steal from in t his manner!", "business_slug": "vodacom"}}
