{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "After posting a few reviews and getting the automated robotic response from Vodacom that a service consultant will contact me I have not received any calls. save to upgrade the cell number that was supposed to be upraded initially. I am at my wits end as to where I go from here. I have called, emailed etc. Have also emailed asking for contact details of a supervisor or manager but have had no response. A simple admin error has now become a major source of frustration. I do not want them to take the new contact phone back I just want them to allocate it to the correct cell number under my contract. I seem to have exhausted all avenues as the response to my previous postings was that I would be contacted and prior to that they would collect the upgrade and resolve the issue. Has unfortunately not happened. I want to complain to ICSA but unfortunately the complaint has to be escalated at Vodacom before I can contact them. This was done and closed before the issue was resolved", "suggestion": "Vodacom should allocate the new contact phone to the correct cell number under the customer's contract and improve their customer service by promptly responding to customer inquiries and resolving issues in a timely manner."}, "meta": {"id": 3614237, "created_at": "2021-08-30 15:47:02", "review_rating": 1, "review_title": "Vodacom", "review_content": "Hi Hellopeter\n\nAfter posting a few reviews and getting the automated robotic response from Vodacom that a service consultant will contact me I have not received any calls. save to upgrade the cell number that was supposed to be upraded initially. \n\nI am at my wits end as to where I go from here. I have called, emailed etc. Have also emailed asking for contact details of a supervisor or manager but have had no response. \nA simple admin error has now become a major source of frustration\n#WIN\nI do not want them to take the new contact phone back I just want them to allocate it to the correct cell number under my contract.\n\nI seem to have exhausted all avenues as the response to my previous postings was that I would be contacted and prior to that they would collect the upgrade and resolve the issue. Has unfortunately not happened. I want to complain to ICSA but unfortunately the complaint has to be escalated at Vodacom before I can contact them.  This was done and closed before the issue was resolved\n\nCAN YOU HELP HELLOPETER? \n\nMany thanks", "business_slug": "vodacom"}}
