{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Rain", "description": "Horrible Criminal experience with Rain. I have had rain for a while and stopped services due to their bad service & how unresponsive they are. In a moment of desperation while waiting for fibre to be connected, I reactivated their services in beggining of August and made a payment using my card, I had bot received services to date and today on the 1st of September, they double debit my acc without consent There is no call centre nos to address this issue and their support platform online doesn't allow you to send more than one ticket...this is dodgy and criminal and I demand ALL my money back and am ready to throw away their router and never engage their services again. Would not reccomend this provider. Day light robbery. Terrible service (or zero service on this case)", "suggestion": "Rain should refund the customer's money and improve their customer service by providing a call center number and allowing customers to submit multiple tickets on their support platform."}, "meta": {"id": 3617349, "created_at": "2021-09-01 08:29:13", "review_rating": 1, "review_title": "Horrible Criminal experience with Rain", "review_content": "I have had rain for a while and stopped services due to their bad service & how unresponsive they are.\nIn a moment of desperation while waiting for fibre to be connected, I reactivated their services in beggining of August and made a payment using my card, I had bot received services to date and today on the 1st of September, they double debit my acc without consent There is no call centre nos to address this issue and their support platform online doesn't allow you to send more than one ticket...this is dodgy and criminal and I demand ALL my money back and am ready to throw away their router and never engage their services again. Would not reccomend this provider\nDay light robbery. Terrible service (or zero service on this case)", "business_slug": "rain-internet-service-provider"}}
