{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Contract cancellation", "service": "Vodacom", "description": "Impossible contract cancelation. Receiving unwanted data and harassment to upgrade despite multiple requests to cancel. No response to emails. Difficulty in reaching the cancellation department. Employees admitting intentional difficulty in the cancellation process.", "suggestion": "Provide a straightforward and efficient process for contract cancellation. Ensure that customer requests are acknowledged and addressed promptly. Train employees to provide proper assistance and support in canceling contracts."}, "meta": {"id": 3638167, "created_at": "2021-09-19 19:04:59", "review_rating": 1, "review_title": "Impossible contract cancelation. I'm not paying for this data. I challenge vodacom to sue me, I don't care.", "review_content": "Entlek vodacom thinks their clever.\n\nThey've been calling me since March this year every month to upgrade my contract. I've been telling them I don't want to upgrade and intend on letting my contract laps with no renewal. And mind you, I've been polite in every interaction. They continued giving me data and harressing me to upgrade. And I've been telling them, I don't want to. I even had to say it in Zulu. \"Lalela la my sister.. ANGIFUNI!!!\" \n\nMy contract end date is 28 July 2021. Were in September 2021 and they still recharging my number with data. I can even buy prepaid data to avoid using the data k don't want to use anymore.\n\nNo single vodacom employee wants to help me cancel this contract. I wrote them an email to kindly cancel my contract, as stipulated in consumer protection act. They don't respond to my emails. A lady phoned me again this past week asking me if I want to upgrade. When I tell her I want to cancel, she tells me I have to phone a different department. They ignore my email to cancel the contract, have time to phone me to upgrade, then tell me they can't help me cancel and I must phone a different department. Hori the cancelation department can't phone me, but the sales department will gladly harress and phone me every month while I'm at work with no appointment.\n\nAnd you know what's getting me worked up? They all say I must phone ********** to cancel. Fine! I swallowed my pride and phone the damn number. It's not even a human being on the phone. It's an automated robot that keeps insisting I upgrade. It speaks slow and only provides the option to cancel at the very end. After being extremely patient and followed procedure, I still don't receive confirmation of my cancelation. I still get ads to upgrade.\n\nI'm from a branch at Springsmall today. The employees there not only refused to cancel my contract, they admitted that vodacom management wants them to insist I phone that stupid number that does not work. Furthermore, they admitted that they intentionally make this process difficult on purpose. They legit admitted all this frustration that was caused to me was deliberate and they will continue to try and shoved these upgrade deals down my throat.\n\nOkay right vodacom... That's how you want to play? Continue loading my account with your data against my will, wena cleva. Angisho u cleva wena? Fede... I'm gonna make you very busy", "business_slug": "vodacom"}}
