{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "Worse customer experience, no assistance with returning devices", "suggestion": "Improve customer service by providing better assistance and communication to customers"}, "meta": {"id": 3640443, "created_at": "2021-09-21 13:20:49", "review_rating": 1, "review_title": "Worse custmer experience, no assistance with returning devices", "review_content": "I order a phone on the Vodacom Prepaid phone, The phones specifications said it was a dual SIM, once I opened the packaged I noticed it was a single sim device.\n\nThis started the most frustrating and worse telephone company experience to date. I tried the number **********4, numberous times and was told only Contract Customers can call, another call agent said i should hold on and kept me on for 20 minutes and then ended the call. Another agent said i should call 082144 but that number doesnt exist.\n\nI finaly tried the bot service from 11h30 till 13h30, they keep ending the chats without responding, I eventually got \"hold of Farisha on the chat, however she kept me waiting with no response for 20 minutes then the chat ended.\n\nMy final outlet was the customer care email, which I have sent, but apprently I must wait 24 hours. I was truly considering Vodacom as my Fibre service provided but with such ****py service I will advocate that no one takes anything from them.\n\nI search the Web on returning devicing and only got the T's&C' policy with no contact details. i tired returnignt the device on my Vodacom account but there is no option.\n\nPlease I am desperate and I only recieved my package this morning at 09h30. Who do we speak, does anyone return your calls. Such frustrating waste of time and money. Vodacom really suched the life out or me at such an early time of the time.\n\nWished I never done any business with them, wished I done more research on their customer care and Hellopeter reviews.\n\nMay this review help someone out there as I dont have much hope in Vodacom contacting me.", "business_slug": "vodacom"}}
