{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Credit theft", "service": "Cell C", "description": "Cell C deactivated the sim card and took back all the unused credit without refunding or re-issuing it", "suggestion": "Cell C should refund or re-issue the unused credit when reactivating the sim card"}, "meta": {"id": 3647352, "created_at": "2021-09-28 14:11:50", "review_rating": 1, "review_title": "Credit theft at Cell C, the company itself! Don't believe it? Read this!", "review_content": "I have recently had one of many experiences of a sim card crash. This time it was my child's cell phone sim card, and there was around R300 credit on the sim, shared to him between my wife and I over time. After the sim \n\ncrashed, we did not have the time to buy him a new sim and do a sim swop for a few months. When we finally found the time to buy a sim and do the sim swop for him, we were told that Cell C had in the meantime decided \n\nthey will not only deactivate the sim (which they now claim was due to Rica policy), but that they will take back all his unused credit!\n\nI was shocked when the consultant told me with appology there's nothing they can do about it because it is company policy that once the sim is deactivated Cell C will take back all the credit we bought that is on that Sim, \n\nand that they cannot refund it or re-issue the credit once the sim is reactivated.\n\nMost Cell C agents (both at the stores and at the call center) do not know the procedure for reactivating permanently deactivated sims. Fortunately after making a big fuss a line manager at the call-center told me what to do, \n\nand when I went to the store itself I learnt further parts of the procedure, which I will now share in total as it might also help other customers:\n\nHow to reactivate a permanently deactivated Sim:\n\n1. Obtain police Affidavit to say we wish to use the sim again which was deactivated due to extended period of inactivity.\n\n2. Visit a Cell C store. Ask the agent to call the TPHD department which will assist the store agent to reactivate the sim.\n3. At this stage the TPHD department will require you to provide the store agent with the Rica user's ID, proof of residence and the affidavit you obtained from the police station. Once these have been captured, the store \n\nagent will perform a sim swop and you will have to discard the old sim even if it was not damaged, and you will have to pay R11 for a new sim.\n\n4. Remember Cell-C will steal any credit you had before the permanent deactivation took place and there's no way of getting it back.\n\nAnother unscrupulous feature of Cell phone companies which I found out about is that by default, they activate a service on all user Sims, called Background services. This allows partner companies to subscribe you to \n\nmusic, games and other things they claim to offer, and charge you a premium fee which is quietly taken out from your airtime credit without you knowing.\nYou have to deactivate this nonsense otherwise your money can be lost.\nFortunately we can still deactivate this. The day may come when you probably won't even be able to do that too. I mean if they can activate this feature without you knowing, then in time they can take that further by \n\npreventing you from deactivating it too. As we know, this is human nature: if you can get away with one wrong deed by justifying it Etc, then you will try to take it further. So beware of this.\n\nWith Cell C for now at least, you deactivate this background services feature using the following command from your phone's dialer:\n*133*7422*.\n\nFinally one last useful tip:\n\nCell C activates International roaming by default so you will pay huge international call charges, perhaps without realizing it when travelling.\nYou have to deactivate International Roaming if you do not want to lose your credit that way.\n\nTo Opt out of International Roaming:\nDial *106*3# from your phone's dialer.\n\nI hope these tips will help some of you out there.\n\nPlease remember that the call center agents are often helpless when companies make bad policies to exploit their customers. We consumers must find ways to tramp on the right toes to effect changes. Screaming at front-end \n\ncustomer agents is like shooting a messenger: You will get nowhere except to irritate the agent. They don't care about our threats because it doesn't affect them personally, so don't waste your time.\n\nWe have to think up ways of reaching the company investors. We must create an awareness big enough that investors will be forced to put pressure on policy makers in the business. I believe fantastic platforms like \n\nHellopeter can play a major role in this.\n\nIf anyone has any thoughts on this, let's talk. You can write me on ykhandoo followed by the At sign followed by webmail dot co dot za. I have masked this E-mail address to prevent spam robots. Once I have talked to \n\nsome of you I can set up a conference where we can discuss together for those interested.\nThe conference will be a general discussion on how to impact bad business practices from any large corporation by tramping the right toes to get the right things done. I think it will be an interesting discussion so do write to \n\nme and share ideas. We will all probably learn a lot this way.\n\nKind regards,\n\nYogan Khandoo", "business_slug": "cell-c"}}
