{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Poor Support", "service": "Vodacom", "description": "I have been trying to reach you for the past 2 days, Your online chat bots stops working, I asked to receive a call back which hasn't happened either and finally my phone call keeps dropping every time I try call the call center. Earlier this month, I canceled my contracts with your legal department and we agreed on a remaining amount of R3000 to be paid monthly at a rate of R1000. The conclusion was that you would send me a invoice with the banking details and reference number I must use to make the payments. To date, I have not received this mail and the payment is due now but I am unable to effect payment without the account number and reference number to be used.", "suggestion": "Please provide me with the account number and reference number so I can honor my payment arrangement."}, "meta": {"id": 3650347, "created_at": "2021-09-30 13:49:11", "review_rating": 3, "review_title": "Poor Support", "review_content": "Good Day Vodacom,\n\nI have been trying to reach you for the past 2 days, You online chat bots stops working, I asked to receive a call back which hasn't happened either and finally my phone call keeps dropping every time I try call the call center.\n\nThe purpose of this review is to request assistance:\n\nEarlier this month, I canceled my contracts with your legal department and we agreed on a remaining amount of R3000 to be paid monthly at a rate of R1000. The conclusion was that you would send me a invoice with the banking details and reference number I must use to make the payments.\n\nTo date, I have not received this mail and the payment is due now but I am unable to effect payment without the account number and reference number to be used.\n\nCan you please provide me with these details so I can honor my payment arrangement with you.", "business_slug": "vodacom"}}
