{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Network Coverage", "service": "Prepaid", "description": "Huge Prepaid Network Coverage problem and no way of contacting Customer Care!! We all have a problem with network coverage on Prepaid package. Our Wifi on Contract works mostly well but the whole Area with prepaid Cell signal is a huge problem for all. I phoned 10210 a Robot picked up sent me a sms with a link to a Whatsapp portal there i selected the option to test my network coverage and a message on Whatsapp came back stating there is a known problem with Network Coverage but this was useless to me as nothing is being done about this no fault reporting no nothing so this Whatsapp portal is of no use! I also inbioxed Telkom on Telkom and Telkom Business still waiting for a reply. #Telkom can you please fix this problem with network Coverage in our area it is a huge problem for all. Thank you Regards", "suggestion": "Please improve the network coverage in the area and provide a more effective way for customers to report network coverage issues."}, "meta": {"id": 3654943, "created_at": "2021-10-05 07:31:48", "review_rating": 3, "review_title": "Huge Prepaid Network Coverage problem and no way of contacting Customer Care!!", "review_content": "We all have a problem with network coverage on Prepaid package. Our Wifi on Contract works mostly well but the whole Area with prepaid Cell signal is a huge problem for all. I phoned 10210 a Robot picked up sent me a sms with a link to a Whatsapp portal there i selected the option to test my network coverage and a message on Whatsapp came back stating there is a known problem with Network Coverage but this was useless to me as nothing is being done about this no fault reporting no nothing so this Whatsapp portal is of no use! I also inbioxed Telkom on Telkom and Telkom Business still waiting for a reply. #Telkom can you please fix this problem with network Coverage in our area it is a huge problem for all. Thank you\n Regards", "business_slug": "telkom"}}
