{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "I am a 20 year customer who never missed a payment and for about the last 5 years Vodacom is getting worse every year. I am trying to terminate a contract for more than a week now. The contract's 24 months was out in Feb 21 so the special is not valid. The persons that call you to upgrade can't end your contract and they talk all over you. Vodacom has no email for complaints and the phone number to end the contract cuts off in half a second. The other option is to use TOBI, a robot, but it doesn't work either.", "suggestion": "Improve customer service by providing a reliable phone number for contract termination and ensuring that the TOBI chatbot is functional."}, "meta": {"id": 3656723, "created_at": "2021-10-06 08:23:48", "review_rating": 1, "review_title": "VODACOM TRAP ME", "review_content": "Hi sorry that there is not a rating for minus 1 star. Anyway I just want to say I am a 20 year customer who never missed a payment and for about the last 5 years Vodacom is getting worse every year. I am trying to terminate a contract for more than a week now, is there anybody who can tell me how to do that, Let me explain. This contract's 24 months was out in Feb 21 so the special is not valid okay the persons that call you to upgrade can't end your contract so they talk all over you as if you are an idiot and believe me they are real scammers every time I did anything whit them I end up paying more. Vodacom have NO email for complaints they have 2 ways to end you contract you can call ********** witch is the correct number but just try to dial it please it cut itself off in half a second I am trying from 2 phones for more than a week SO IT DON'T WORK. The other option is to do it with TOBI witch is a ROBOT please try that IT DON'T WORK. You know what the best of all is this review will not have any effect on my problem Vodacom will just commend that they sort out the problem without doing anything. JUST WANT THE PEOPLE TO KNOW ANY ADVISE IS WELCOME PLEASE.", "business_slug": "vodacom"}}
