{"chatbot": {"related": 1, "evidence": "The customer mentioned interacting with a chatbot on the call center and WhatsApp channels.", "classification": "Customer service", "description": "The chatbot provided incorrect information and did not offer a solution to the customer's issue.", "suggestion": "Improve the chatbot's ability to understand and address customer concerns. Provide an option for customers to speak with a human representative."}, "complaint": {"classification": "Fraud", "service": "Mobile contract upgrade", "description": "The customer's contract was renewed without their consent, possibly due to identity theft. They have reported the issue as fraud but have not received any response.", "suggestion": "Investigate the fraudulent activity and provide a resolution to the customer. Ensure proper identity verification procedures are in place to prevent unauthorized contract renewals."}, "meta": {"id": 3657142, "created_at": "2021-10-06 11:30:16", "review_rating": 1, "review_title": "Fraudulent upgrade with no proof of identity.", "review_content": "After trying to upgrade my mobile contract I was told that my contract had already been renewed through the call centre, I told them that I did not renew my contract and was told to call a different number to try and get the recordings, I then called the number and was told they dont have me on their system, I then went to the Northgate store and was told the contract was indeed renewed by the call centre and only they could give me the recordings. seeing as I know I did not renew my contract I can only assume this was done by someone else who has my information and as such I have opened up a case of fraud through the Telkom fraud channel over 2 months ago, to date I am still being debited for a phone I did not receive and have not heard anything back from the fraud department. \n\nToday I tried to call the call centre again but was told by a bot that I need to use the Watsapp channel and then was hung up on, there isnt even an option to speak with a human, on the watsapp channel there is also no option to chat to a human.", "business_slug": "telkom"}}
