{"chatbot": {"related": 1, "evidence": "The customer mentions being faced with a chatbot when trying to call Vodacom for assistance.", "classification": "Customer service", "description": "The customer is frustrated with the chatbot and its inability to resolve their issue.", "suggestion": "Improve the chatbot's ability to address customer concerns and provide a more efficient resolution process."}, "complaint": {"classification": "Terrible service and breach of rights", "service": "Vodacom", "description": "The customer is complaining about receiving spam marketing messages despite opting out and not wanting to receive any marketing/advertising. They are also dissatisfied with the lack of response and resolution from Vodacom.", "suggestion": "Resolve the issue of spam marketing messages, ensure prompt response and resolution to customer complaints, and comply with consumer rights and privacy laws."}, "meta": {"id": 3659178, "created_at": "2021-10-07 14:27:58", "review_rating": 1, "review_title": "TERRIBLE SERVICE and Breach of my rights", "review_content": "I first raised this issue last week. I am absolutely frustrated now and worried that Vodacom is taking advantage of my rights as a consumer (consumer pro act).\n\nI am on prepaid with a new number the only places that have my new numbers stored on their databases are my bank and Vodacom.\n\nBut almost daily I am send spam mail from vodacom with the option to send \"STOP\" to opt out which I do. ONLY to be sent a sms the next day from another vodacom marketing team to which I have to sent \"STOP\" to now sign out of this one.\n\nNow when trying to call ANYONE at vodacom to assist with this you are now faced with a chat bot which sends you around in circles.\n\nOnce someone at Vodacom sees this message I would like to once again officially state it in writing. I DO NOT WANT TO RECEIVE ANY MARKETING/ADVERTISING. If I have a query about a product or offering, I WILL BE IN CONTACT WITH YOU. \nwith many witnesses now to this statement and request as a consumer.\n\nEagerly awaiting a non bot response from Vodacom on the above issue\n\nbelow is vodacoms respsonse \"Dear Customer,\n \nThank you for the time and effort taken to voice your dissatisfaction to our office. It is with the cooperation and feedback from valued clients such as yourself that we are able to identify any areas of improvement within our organisation.\n \nKindly be advised that your permissions have been updated and opted out of receiving marketing messages. This process can take within 2-3 working days.\n\nRegards\n \nConsumer Website Team\"\n\nSTILL NO PHONE CALL 5 business days later after the initial complaint. AND I AM STILL RECEIVING MARKETING SMS'S after I was informed via a sms that I my permission to contact information has changed.\n\nDo i need to go to the newspapers or court to have this issue sorted out?\n\nyou are in breach of the CONSUMER act Vodacom so I demand to be removed from your  lists now. And if it a 3rd party that now has my information you are in breach of the POPI act.\n\nI am EXPECTING A PHONE CALL WITHIN 24HOURS of this complaint", "business_slug": "vodacom"}}
