{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Poor Service", "service": "Telkom platform and app", "description": "I have been trying to do an upgrade for my laptop since the Telkom app says i am due for an upgrade and the app itself has not been functioning properly. When I went to Telkom shops, they told me I am not due. I tried to do an upgrade online but they could not finish the process because my physical address has changed. I went to a shop to change my address and found out that the same shop that told me I can only upgrade online has the exact same package deal as online. After waiting for days, I was informed that Telkom no longer has stock of the device I wanted, even though it still appears available online.", "suggestion": "Telkom should improve their app functionality, ensure accurate information is provided in their shops, and update their online stock availability."}, "meta": {"id": 3661823, "created_at": "2021-10-10 14:38:24", "review_rating": 2, "review_title": "Poor Service on all the Telkom platform and an app that has misleading information", "review_content": "I have been trying to do an upgrade for my laptop since the Telkom app says i am due for an upgrade and the app itself has not been functioning to it normal capacity since i think last year June, but when i went to two Telkom shops in Hillcrest they told me i am not due. I tried to do an upgrade online where my application was successful but they could not finish the process because my physical address has changed which I did change the last time I was taking the same contract that I was due for an upgrade. Went to a shop to change my address and only to find out that the same shop that told me i can only upgrade the online deals only online have the exact same package deal as online, a very nice lady by the name of Sindi helped me to calculate the repayment including the new contract (since i was not due for an upgrade) due to no stock she said in about 3 days she will call be to come and collect the device as the stock appeared to be in the process of being delivered the following few days and after 5/6 days of waiting i get a call that Telkom no longer have stock of the device because the stock has been recalled but the same stock still appear online as available (https://secure.telkom.co.za/today/shop/personal/product/c-HP-Notebook-15-inch-i3-E5576-Bundle-smartBroadband-Wireless-5GB/?#!k=product-detail-82787), and no one can explain to me what is really happening since almost all the social media platforms are robot automatic replies. this is really sad since i have been a customer for over 8 yrs and i need the device to write my online exams", "business_slug": "telkom"}}
