{"chatbot": {"related": 1, "evidence": "The complaint mentions the chatbot Tobi Bot and the frustration of dealing with recorded options.", "classification": "Customer service", "description": "The customer is complaining about the difficulty of reaching a human operator and the frustration with the chatbot and recorded options.", "suggestion": "Improve the chatbot functionality and provide easier access to human operators."}, "complaint": {"classification": "Customer service", "service": "Vodacom", "description": "The customer is frustrated with the lack of communication about an outstanding amount and the difficulty of contacting the accounts department.", "suggestion": "Improve communication with customers regarding outstanding amounts and provide better access to human operators in the accounts department."}, "meta": {"id": 3679741, "created_at": "2021-10-26 10:08:30", "review_rating": 1, "review_title": "Vodacom is useless and clearly don't want their money", "review_content": "I am trying to open a new contract with Vodacom.I was informed there is an amount outstanding in my name of a contract I had 4 years ago.That contract was closed years ago with the settlement amount I received from Vodacom at that stage.Never have they sent me communication that anything was outstanding in 4 years.\nNone the less I agreed to pay whatever is outstanding and gave permision for a debit order to go off.\nIt was suppose to be done yesterday. So far the debit order has not been done by Vodacom.Trying to get hold of a human being in the accounts department is impossible.Trying to speak to an operator is impossible.I have tried every number on their site.The Bots and useless voice message promting you to enter cell numbers,ID numbers,to say something after the beep etc is the WORST waste of time ever and calls get cut.\nCould Vodacom please just have an actual operator answer your call when you phone.These recorded options and that stupid useless Tobi Bot is beyond frustrating and of no use.I want to pay my account,but Vodavon doesn't seem to want my money as I can't get hold of someone in accounts no matter what.Please please please please can someone from Vodacom accounts phone me.I can't believe thst you have to go through all that recording **** to get help.Please get rid of it and have an actual operator assist you.I am waiting fir your call.Otherwise Vodacom must never ask me to settle an amount because they clearly don't want the money or new bussiness.", "business_slug": "vodacom"}}
