{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Cell C", "description": "I have been experiencing issues with Cell C's customer service. They have not answered my previous complaint and have been unresponsive. They added daily interest to my account without proper explanation. They delayed the cancellation process and did not provide a satisfactory response to my questions. I paid the outstanding amount to end my ties with Cell C, but I have not received any communication from them after the payment.", "suggestion": "Cell C should improve their customer service by addressing complaints promptly and providing clear explanations for charges. They should also ensure timely communication with customers after payments are made."}, "meta": {"id": 3692844, "created_at": "2021-11-06 07:13:15", "review_rating": 1, "review_title": "Cell C-horror journey part 2", "review_content": "So my saga with CellC continues following my previous complaint which was unanswered with bot like private replies and the only answer I got from them was to hand me over to some collection agent that added daily huge interst to what you owe. I still don't know how or why I owed them this as they don't take clients seriously. I was a client for 8 years and they didn't even feel the need to give me the courtesy of a proper engagement. None of the questions I asked were answered. The cancellation process was delayed from their side to begin with. Still don't know how they gave me a last and final payment or they wouldn't let me port away. This was paid and my number was ported to great service provider  Telkom mobile. This was over a year ago. Then I find out I owe Cell C an amount from 6 months ago. How ? Anyway I decided to pay the amount to keep my sanity and at least I can then break my ties with Cell C who I will never do business with again and I tell my story to ally friends and family who ask my opinion on them of course. Anyway I still haven't heard anything back after making the payment.\nI'll probably get a bit answer unrelated to my questions again", "business_slug": "cell-c"}}
