{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Sim Swap", "service": "MTN", "description": "Lost phone with sim card and did a self-service sim swap, but the sim swap failed and faced multiple issues with MTN stores and call center", "suggestion": "Resolve the sim swap issue and improve customer service"}, "meta": {"id": 3703780, "created_at": "2021-11-15 19:57:59", "review_rating": 1, "review_title": "Re: MTN Sim swap complaint [#**********]", "review_content": "Good Day MTN South Africa \n\nI am writing this as a very disappointed and annoyed MTN client. Lost my phone with sim card on 06/11 and did a self service sim swap on 07/11 which was Sunday morning,  I answered correctly the questionare and got a confirmation sms to say sim swap is in progress should be completed in 2-24 hours. I later than day called the call center to blacklist my device I was however told I can't do that as it's after hours, cool I then asked to check the status of my sim swap and I was advised yes it's in progress I should wait until the following day. As the following came and the 24 hours lapsed I called again the call center only to be told that no my sim swap failed as I had dialed and used the sim cars of which it was utter nonsense as for the period from Sunday until Monday I was using a MrP sim card,  the agent then suggested that we do the sim swap tellephonically and I agreed as they said the questions will be the same,  to my surprise I was told I failed authentication ofwhich I didn't understand now because it was the same questions and answers as per the self service I did the previous day. I tried to speak to one of the TL's thinking it might help the situation but also with him it was as if I'm talking to a robot, no courtesy at all as I was quickly brushed off and refered to go instore with copy of certified ID and saps sworn affidavit.  Cool I quickly rushed and dodged work and went to the Westgate mall store only to be told when I got there that the new store manager's rule is that no sim swaps are to be done at that particular store,  I was utterly shocked to say the least. Cool as angry as I was I went on Thursday now 11/11 to the Randburg square MTN store only to get there I'm rudely told that number one they don't do sim swap at the store they just send the docs to the call center to process it, such bull disturbed me as I was expecting this to be my last resort, secondly I was told that the affidavit that I wrote was inconclusive(wow) how does an official saps signed and stamped document become inconclusive... while I was still outside the store I called the call center again and told them what had transpired, for a minute the agent seemed to understand until she asked me to give the lady at the store the phone  and I don't know what they said to each other that made it seem as if I was lying with everything I've been telling them or asking them to help me with.  To cut matters short I was dismissed without getting any assistance whatsoever,  flip I had to go back to the saps and re-write the affidavit.  Having to work long hours and having to do all of this was frustrating to say the least.  Cool Saturday (13/11) afternoon I managed to go to MTN Maponya mall to try again,  got there stood in the queue then boom we were told sim swap system is \"offline\" one of the personnel tried to give an excuse to say it's due to the looting in July most MTN subscribers now flock to the Maponya mall store in the turn the system is \"over flooded\" that's the wording the guy used,  we should come back the following day (Sunday) morning between 9-12 as that's when the system is up and running. Cool so me being me I wake up the following day being Sunday 14/11 crossing fingers now that the system is up and running since I did all that needed to be done from my side. I get to the store the same guy now tells me bull**** that one of the \"managers\" that are supposed to authorize sim swap is not I  for the day and thus I can't do the scanning of the docs however they can ask me questions if pass then they can do the sim swap,  of which it didn't and still doesn't make sense to me m***m.  Cool I agree to that however when I get to the counter I get a different story now to say they can't do the questions they'll have to scan the docs of which that's what I was expecting from the start,  Cool docs where seeminngly scanned and again I was told the TAT 2-24 hours, sharp.  It's Monday today I was advised that I will have to dial *123*888# to check the cellphone number,  I've been doing this since mid day and all I get is (service temporarily unavailable 503) when I called the call center today I was told that there isn't a Sim swap request showing for my number,  the last one was on 07/11... that left me flabbergasted to say the least.  Msooon WE MTN please help me with this sim swap maan ****it!!!!", "business_slug": "mtn"}}
