{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Billing", "service": "Vodacom", "description": "We bought two x 2Gb data bundles via Nedbank from the UK for a visit to South Africa. The option said R149 for a month Both my husband and I was dependant on the data for communication. We then received sms's to say no its only for a few days not a month -i tried the customer care and the Tobi bot but no success -so bought 1x R149 option again for myself and a 4Gb option for my husband for a month -this time his went the right way by my R149 option again let me know I dont have a full month as indicated with choices on banking app in the last case Capitec. I then bought 4Gb for  myself but the point is I lost 300rands and had to take an option for nearly double the price just not to loose again. Bodacom has a problem and I pay for it -i woul at least want my money back i unneccarily spent! I should say that in each instance i contacted customer care with no luck and the last time i spent 40min with a nice lady from Stellenbosch Square -please advise this cannot be happening", "suggestion": "Please refund the customer the money they unnecessarily spent and ensure that the data bundles are accurately described and provided for the specified duration."}, "meta": {"id": 3712552, "created_at": "2021-11-22 23:35:40", "review_rating": 1, "review_title": "Vodacom problems with app sales of data", "review_content": "We bought two x 2Gb data bundles via Nedbank from the UK for a visit to South Africa. The option said R149 for a month Both my husband and I was dependant on the data for communication. We then received sms's to say no its only for a few days not a month -i tried the customer care and the Tobi bot but no success -so bought 1x R149 option again for myself and a 4Gb option for my husband for a month -this time his went the right way by my R149 option again let me know I dont have a full month as indicated with choices on banking app in the last case Capitec. I then bought 4Gb for  myself but the point is I lost 300rands and had to take an option for nearly double the price just not to loose again. Bodacom has a problem and I pay for it -i woul at least want my money back i unneccarily spent! \nI should say  that in each instance i contacted customer care with no luck and the last time i spent 40min with a nice lady from Stellenbosch Square -please advise this cannot be happening", "business_slug": "vodacom"}}
