{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Security", "service": "MTN", "description": "MTN allowed a scam to go on for months, resulting in the customer being scammed and now being asked to pay for it. The customer provided OTPs as requested by someone claiming to be from MTN, but the system was not secure and allowed unauthorized access.", "suggestion": "MTN should improve their system security to prevent unauthorized access and scams. They should also take responsibility for the scam and not hold the customer liable for the fraudulent charges."}, "meta": {"id": 3716543, "created_at": "2021-11-25 13:35:56", "review_rating": 1, "review_title": "MTN GIVES SCAMMERS ACCESS!!!!", "review_content": "So I was just scammed by something MTN had been aware of for months!!!! The entire story was on Carte Blanche 3 months ago (I found out after doing research about the scam) so why do you allow allow scam to go on for this long and not do a thing about it???\nNow they want me to pay R8000 which the scammed spent on my account after their systems aren't foolproof and anyone can clearly enter it!\nI was called by a certain mister who calls himself Jason Oosthuizen. He claimed he was calling from MTN and someone tried to do a simswop on my account the morning, is this correct. I immediately said no, it's not. He said they'll block it and I need to send him the OTP that was sent to me from MTN's system. He then mentioned the name of the person wanting to do the simswop and asked if I knew anyone by that name, I said no. He also said the email address was changed to that person's email address and gave it to me. I again said no, that's not correct. He sent another OTP from MTN's system and said I must provide that so he can change it. Again I gave it and he gave me a reference number, his name and IP address (all fake obviously). Then the call just dropped. I got another sms to say my limit has been increased to over R9000 and then they started spending. I had to quickly search for the fraud department number and had to listed to the stupid robot talking while they are spending! Eventually I get to someone, hold for a long time until she says her system is frozen so she can't do anything and I need to call back. In the mean time, they're still spending. I call back, speak to someone else, he changes my limit and then the call drops again. I call again, speak to someone else, explain it all for a THIRD time! She then says MTN won't pay that and I'm liable for it since I gave the OTP. NO, I'm not liable for YOU securing your system and making sure it's foolproof! You can't expect clients to pay for your stupidity! Clearly your system is NOT SECURE as these hackers entered your system, sent OTP's from your system and even increased my limit, without me doing ANYTHING! So how the hell can you expect clients to pay because your system is NOT SECURE?????? We already pay you enough to have all your **** together but now we have to pay for you to be stupid as well?????\nThis is not right in any way and what makes it even worse, you don't give a **** and never bothered to do anything about the scam to stop it. So what does that mean? Obviously you're in on it too!!!! I am NOT paying for your insecure system and your debit order will be disputed! Even if I get a bad credit record, you will NOT benefit from your own scam!", "business_slug": "mtn"}}
