{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Unsatisfactory Customer Experience", "service": "Telkom", "description": "Telkom debited my account for an amount that I had already settled, and now I need to go through a lengthy process to get a refund.", "suggestion": "Improve customer service by prioritizing and resolving customer complaints more efficiently."}, "meta": {"id": 3722840, "created_at": "2021-11-30 16:15:21", "review_rating": 1, "review_title": "Telkom Unsatisfactory Customer Experience", "review_content": ">18th of November 2021 I settled Telkom's account in full for an amount of R656.59. No further amounts were to be debited as the account was permanently suspended/closed, and this was the final invoice reference A**********92\n\n>The payment confirmation reflects on their system as such too (verified at a Telkom Promenade Mall Branch)\n\n>Today Telkom debited my account for an amount of R656.59 which I had already settled as confirmed by their system at the Promenande Mall branch. \n\n>As such this amount is due to me, as it was fraudulently debited.\n\n>I seeked to remedy the situation and get my funds back but the process is so ridiculous. I'm expected to go print a bank statement (at my cost), wait 7 days for their system to reflected that indeed they debited my account, and then I can file for a refund. \n\n>When these businesses as a customer you are in the negative, they request payment immediately and make all sorts of legal threats as well as charging you any penalties for any additional fees. \n\n>Strange how when they are on the other side there's so much bureaucracy and red tape in order to get your money as a customer.\n\nOne thing I've come to realise with most companies is that they lost touch with prioritizing customers. Our problems aren't prioritized and escalated quickly enough. You are expected to understand as if you are being done a favor.\n\nFor sales the line goes straight through to a person, when it's customer complaints issues you interact with a bot before ever making contact with a person and that's if you even lucky or have airtime to wait more than  10mins or 20mins on the phone. I'm convinced this is done deliberately to discourage consumers making more complaints.\n\nMy piece of advice: before dealing with any business; work backwards. Call their customer lines and see how long you wait before you are helped, go on platforms like these and see how exisiting customers issues are handled. This will save you a lot of headache ahead.", "business_slug": "telkom"}}
