{"chatbot": {"related": 0}, "complaint": {"classification": "Poor Service", "service": "Vodacom", "description": "Shocking service from Vodacom Westwood Mall and Call Centre. Delayed upgrade, conflicting information, unresolved issues, lack of assistance, and poor customer care.", "suggestion": "Improve customer service, provide accurate information, resolve the pending upgrade, and ensure timely delivery of phones."}, "meta": {"id": 3726206, "created_at": "2021-12-02 12:07:20", "review_rating": 1, "review_title": "Shocking service from Vodacom Westwood Mall and Call Centre", "review_content": "On Monday my husband went to Vodacom at Westwood Mall to do his upgrade which became due on 01 November 2021.  After waiting an hour to be assisted, he was finally helped by Rico, an unsupervised trainee.  My husband had to fill in two sets of documents and then was told that the upgrade was complete.  Rico went to get his new phone and then told him that no, he cannot take the phone - after all the paperwork etc had been completed.  No valid reason as to why he could not take the phone was given.  Matter was discussed with the store Supervisor, Wandile - and still not resolved or proper explanation given.  My husband then proceeded to upgrade another number that he has online - this was done on Monday, we received the email to confirm the order, and to date no phone has arrived.  Vodacom online also stated that he could upgrade his current line, the one that he wanted to upgrade in store, and he proceeded to once again do the upgrade procedure online - only to be told at check out that there were no deals available for him ... even though he had chosen the deal he wanted! Phoning Vodacom Customer Care proved useless.  The upgrade department told him that he had already received his new upgraded phone from Vodacom Westwood Mall!  The very same phone that Westwood Mall told him they could not give him. Another surprise was that it appeared a further upgrade was loaded and pending on the system - Rico the trainee at Vodacom Westwood Mall does not seem to know what he is doing - he has loaded two contracts now - and not even given one phone!.  Complaint was lodged with reference 1-**********9081 - sms received.  A short while later a further sms was received saying the ticket was closed and matter was resolved - no telephone calls or advices how the matter was resolved were received.  To date we still cannot proceed with the upgrade on line.\nTelephone calls to Vodacom customer care are fruitless and interaction with Tobi the Bot System is pathetic.  The phone that was upgraded has still not been received.  Finally managed to get hold of Prudence in customer care who advised that the matter was with their back office for review and that there is a back log - however, an email and sms confirming the order has already been received.  Where in this world does someone have to wait more than three days for their new phone? in the past we have upgraded and the phone has been delivered even the following day!.  No one at Vodacom seems to want to help, and Covid is to blame for a lot of delays... convenient i would say.  Personnel at Westwood Mall also don't seem to care about their lack of service.  I would like this matter sorted out !", "business_slug": "vodacom"}}
