{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Privacy", "service": "Vodacom", "description": "I am receiving unwanted calls from random companies and people, even after changing my number. I am frustrated and concerned about my privacy.", "suggestion": "Please remove my number (###########) from any lists and ensure that it is not shared with random companies. I expect my privacy to be respected."}, "meta": {"id": 3727759, "created_at": "2021-12-03 10:25:14", "review_rating": 1, "review_title": "POPIA", "review_content": "I am Livid!!!\n\nI've had the same number for years.  All my job applications and family, friends and colleagues  have this number, but it became a nuisance whenever I answered and it was either someone trying to sell insurance, loans, contracts  or robots screaming in your ear about promotions.\n\nI'd receive 5/6 calls a day sitting at work, thinking it was something really important.  I got so fed-up that I changed my number and only gave it to my mother, thinking the rest can whatsapp me if it's really important. \n\nThis morning, the new number was ringing, I answered, thinking it could only be my mother as I am at work and everyone else can see me in my office or use the landline.\n\nIt was another insurance seller.  Now, the only people who have this number is my Mother and Vodacom and there is no way anyone else can call me.  What happened to privacy?????  Who the hell gave them the right to just hand out my number to random companies and people.  Have they no respect??\n\nIf I receive one more call from some random person trying to sell me something I will be taking this further.\n\nI have had enough of these money casing, disrespectful people.\n\nI'm sure there are plenty more people that feel the same who will want to stand together to stop this nonsense.\n\nThey need to remove my number (###########) immediately from any lists they think about forwarding to random companies!!!!!!  I have to start from scratch, yet again, blocking thousands of numbers!!!\n\nIf they want to respond, they can email I will be blocking any weird numbers I receive", "business_slug": "vodacom"}}
