{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Billing", "service": "Contract cancellation and billing", "description": "I canceled my contract in October 2021 but called in September already I went over to prepaid. Paid my last invoice in October. I thought everything was OK until I got an invoice again for an amount to be paid. I called and was told it's for another phone that was on the contract. I disagreed to pay because my instruction was to cancel ell the contract. I was told I need to pay R1158. I paid it. A week later I got a voice message I'm in arrears I need to make a payment. I queried again and was told I need to pay I escalated the query and was referred to a escalation manager.who than confirmed that yes I canceled the contract but 1 number was not cancelled it will be reversed and I don't need to make a payment. I was happy and thanked him. A week later I got calls again I'm in arrears. I went to the the shop again and was put through to accounts. The lady that assisted me was very rude and said she will send my account to Legal. I told her it's not my fault where is the amount coming from you need to pay it's not our problem I was very upset because her behavior was not pleasant. I went back to the office and send an email to ***********te I haven't received any response. An hour later I got an sms I have been handed over to Attorneys I received phone calls for payment. I'm very frustrated because they didn't cancel the contract in October. I had to pay another 1658 being abused by calls voice messages I paid the amount. I'm now listed with 3 Collections departments.i can't find anyone to assist me. 082135 no operater available you must speak to Tobi robot. I'm being threatened to pay again. After all these years being treated like this is unacceptable. I need my money to be refunded to me.", "suggestion": "Investigate the issue thoroughly and refund the customer's money. Improve communication and customer service to avoid such situations in the future."}, "meta": {"id": 3728962, "created_at": "2021-12-04 01:51:23", "review_rating": 1, "review_title": "Billing", "review_content": "I canceled my contract in October 2021 but called in September already I went over to prepaid. Paid my last invoice in  October. I thought everything was OK until I got an invoice again for an amount to be paid. I called and was told it's for another phone that was on the contract. I disagreed to pay because my instruction was to cancel ell the contract. I was told I need to pay R1158. I paid it. A week later I got a voice message I'm in arrears  I need to make a payment. I queried again and was told I need to pay I escalated the query and was referred to a escalation manager.who than confirmed that yes I canceled the contract but 1 number was not cancelled it will be reversed and I don't need to make a payment. I was happy and thanked him. A week later I got calls again I'm in arrears. I went to the the shop again and was put through to accounts. The lady that assisted me was very rude and said she will send my account to Legal. I told her it's not my fault where is the amount coming from you need to pay it's not our problem I was very upset because her behavior was not pleasant. I went back to the office and send an email to ***********te I haven't received any response. An hour later I got an sms I have been handed over to Attorneys I received phone calls for payment. I'm very frustrated because they didn't cancel the contract in October. I had to pay another 1658 being abused by calls voice messages I paid the amount. I'm now listed with 3 Collections departments.i can't find anyone to assist me. 082135 no operater available you must speak to Tobi robot. I'm being threatened to pay again. After all these years being treated like this is unacceptable. I need my money to be refunded to me.", "business_slug": "vodacom"}}
