{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Service", "service": "Telkom", "description": "Telkom is really the worst Service Provider. Stay away from them. I went online and ordered an iPhone 13 on Contract. They called me back and took my details. Seven days later, I received my phone. This is where everything started. When you try to get ahold of their call center, it sends you an SMS that you should contact them via Whatsapp, and the call drops. When you try to get assistance on Whatsapp, the options are limited via a robot, and no option to transfer to a Human or get a callback. I finally got through to the call center, the guy I spoke to did not have any information on my MSISDN/ Number change request. After 45 minutes on the call, he finally logged a call/ fault for me. This was after I had explained how this process works, due to my experience in Telecomms. I am currently struggling to activate insurance on my phone. The insurance guys says they only do claims, I should call the customer service and the customer service guys says they don't do insurance activation, I should call the insurance guys. I asked for the customer service manager by the name of Menzi Magubane and he refused to take my call. What kind of Mickey Mouse operation is this? The agent Lwandile Gumede speaks over me with such a bad attitude \"I told you\". If you have any option to take your business elsewhere, please do so. I see that none of the other reviews have been attended to, which really means they don't care. I have had contracts with Vodacom and MTN but never experienced this ever. I regret moving to Telkom. It's really the worst decision ever.", "suggestion": "Telkom should improve their call center service, provide better assistance on Whatsapp, ensure their agents are knowledgeable and respectful, and address customer complaints promptly."}, "meta": {"id": 3737939, "created_at": "2021-12-10 13:41:21", "review_rating": 1, "review_title": "Telkom is really the worst Service Provider. Stay away from them.", "review_content": "Telkom is really the worst Service Provider\n\nI went online and ordered an iPhone 13 on Contract. They called me back and took my details. Seven days later, I received my phone. This is where everything started.\n\nWhen you try to get ahold of their call center, it sends you an SMS that you should contact them via Whatsapp, and the call drops. When you try to get assistance on Whatsapp, the options are limited via a robot, and no option to transfer to a Human or get a callback.\n\nI finally got through to the call center, the guy I spoke to did not have any information on my MSISDN/ Number change request. After 45 minutes on the call, he finally logged a call/ fault for me. This was after I had explained how this process works, due to my experience in Telecomms.\n\nI am currently struggling to activate insurance on my phone. The insurance guys says they only do claims, I should call the customer service and the customer service guys says they don't do insurance activation, I should call the insurance guys. I asked for the customer service manager by the name of Menzi Magubane and he refused to take my call.\n\nWhat kind of Mickey Mouse operation is this? The agent Lwandile Gumede speaks over me with such a bad attitude \"I told you\".\n\nIf you have any option to take your business elsewhere, please do so. \n\nI see that none of the other reviews have been attended to, which really means they don't care.\n\nI have had contracts with Vodacom and MTN but never experienced this ever. I regret moving to Telkom. It's really the worst decision ever.", "business_slug": "telkom"}}
