{"chatbot": {"related": 1, "evidence": "The complaint mentions interaction with RAM's ChatBot.", "classification": "Delivery", "description": "The complaint is related to the delivery process of an online upgrade.", "suggestion": "Improve the accuracy of address information in the system to avoid delivery issues."}, "complaint": {"classification": "Non-delivery and broken promise", "service": "Online upgrade", "description": "The customer did not receive the delivery as promised and faced issues with address information.", "suggestion": "Investigate the reasons for the delivery delay and ensure proper communication with customers regarding address changes."}, "meta": {"id": 3738186, "created_at": "2021-12-10 15:58:05", "review_rating": 1, "review_title": "Non-delivery and broken promise", "review_content": "I did an online upgrade on 01/12/2021. I was duly notified that there was no stock and again duly notified and kept in the loop once the stock arrived as well as being adviced when the parcel was handed over to RAM couriers. The delivery was scheduled for Wednesday at my home address but I had notified both Vodacom and RAM that I had to be at the office and requested change of address. On Thursday I had made a follow up with RAM's Xavier who ensured me that my parcel would be out on delivery the next day, Friday 10/12/2021. I have not received the delivery as promised. When I followed up around lunch time I was told by RAM that my parcel is still with them, all the drivers were out for the day already. I was not given a proper reason t=why my parcel was left behind. The excuse I was given was that the drivers were not sure of my delivery address as the address they (RAM) had on the system was incorrect. I have proof I had received via RAM's ChatBot that actually the alternative (work) address I had given was indeed CORRECT and that was just a lousy excuse as to why my parcel was not loaded in the morning. I am not impressed with this and almost on the brink of cancelling the whole thing!!", "business_slug": "vodacom"}}
