{"chatbot": {"related": 1, "evidence": "The complaint mentions a customer care robot named Tobi.", "classification": "Customer Care", "description": "The customer had a bad experience with the customer care robot Tobi.", "suggestion": "Improve the customer care robot's ability to handle customer complaints."}, "complaint": {"classification": "Service", "service": "Vodacom", "description": "The customer had a bad experience with the unlock summer rewards program and the customer care service.", "suggestion": "Resolve the issue with the unlock summer rewards program and improve the customer care service."}, "meta": {"id": 3745154, "created_at": "2021-12-16 22:06:14", "review_rating": 1, "review_title": "Never call this line again....VODACOM CUSTOMER CARE", "review_content": "Have you ever been so embarassed by a company that you have been loyal to for over a decade..well today was my day. The unlock summer rewards is a joke and i am considering using a different service provider because of my experience and the way it was handled when i calked the customer care ( another joke...customer care with a robot tobi) this is the 2nd year in a row that i am having a bad experience because of a reward programme vodacom is offering their customers....laft year i won an online FREE course and to get my account being debited by the company vodacom partnered with. Today i went to purchase a reward i received from vodacom at hungry lion, only to find the code does not work and the staff at the store confirming that customers are coming there and experiencing the same i experienced...error when xode was entered.  I called the customer care line with so many voice prompts i eventually selected customer care for special customers. When i explained to the consutant what my dilemma was....he kept on repeating that i must never ever call that number again...very unprofessional to tell this to a customare....vodacom i just lost all faith in you guys...goodbye", "business_slug": "vodacom"}}
