{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Contract Cancellation", "description": "Vodacom is incompetent at cancelling contracts. Despite multiple attempts to cancel the contracts, the debit orders are still going through. The cancellation department requires a Power of Attorney and ID copy from the customer's brother, who is not in South Africa. Emails sent to the cancellation department have not been received. Visiting Vodacom stores did not resolve the issue. Vodacom's customer service is unhelpful and incompetent.", "suggestion": "Improve the contract cancellation process by ensuring timely and accurate cancellation of contracts. Streamline communication channels and improve responsiveness to customer emails. Train customer service representatives to provide effective assistance and support in resolving contract cancellation issues."}, "meta": {"id": 3745861, "created_at": "2021-12-17 12:29:12", "review_rating": 1, "review_title": "VODACOM TOTALLY INCOMPETENT AT CANCELLING CONTRACTS", "review_content": "I have given Vodacom one star, but in reality it should be at least mine 5 stars.\n\nIn April/May this year my brother went into a Vodacom store to cancel three contracts.  He was told to phone the cancellation number, which he duly did.  He was assured by Vodacom that the last debit order would be at the end of June 2021.  He stipulated that two of the numbers were to remain under his name as Pay as You Go.\n\nHere we are in December, and surprise, surp[rise, the debit order for all three contracts are still going through.\n\nSince my brother is bot in South Africa, he asked me to follow up with his cancellation.\n\nI phoned the cancellation Department, and was told that since I was a third party that they could not help me.  In order for me to do the follow up, they would need a Power of Attorney from my brother giving them permission to liaise with me about these contracts, as well as a copy of his ID.  They gave me the e-mail address to which he should send the e-mail with the required attachments.\n\nThis was done on 5 Deem her 2021.  When I phoned the cancellation Department on 6 December, I was informed that they had not yet received the e-mail.  I double-checked the e-mail address, and it was sent to the correct address.  Since my brother had cc'd me ion on the mail to Vodacom, I forwarded the mail I had received to them.\n\nWhen I phoned them on 15 December 2021, I was told that they had not received either mail.  This is 10 days after the first mail was sent to them.  I was told that they get thousands of mails every day.  I was then told that the best thing to do was to go into a Vodacom Store with the Power of Attorney from my brother and I would be helped, as well as a request would be put I for a full refund from July 2021 to date.\n\nI went to two Vodacom Stores on 16 December, and neither store could help me, as the cancellations have to be done telephonically.\n\nI have tried everything possible to get these contracts cancelled, but Vodacom is not at all helpful.  I cannot believe that 10 days after e-mails are sent, they have not yet been received.\n\nSadly, Vodacom, although being a corporate Company, is totally incompetent to help any customer, unless there is a sale involved, where they would be falling over themselves to assist the customer.\n\nHow else can a contact be cancelled?  we have tried telephonically, by e-mail, going into the store, but nothing works.", "business_slug": "vodacom"}}
