{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Unethical", "service": "Vodacom", "description": "Vodacom refused to honor an upgrade promotion and dismissed the customer's claims", "suggestion": "Vodacom should honor the upgrade promotion and improve their customer service"}, "meta": {"id": 3749246, "created_at": "2021-12-20 23:48:03", "review_rating": 1, "review_title": "Vodacom Unethical Pathetic Service", "review_content": "If I could give a zero to Vodacom- I would. Because of their size and market dominance, they are high and mighty enough to fob you off and dismiss your claims, as nonsense and simply indicate that the matter has been resolved, for all the world to see. If you have an issue, for instance, my issue was that I wished to upgrade my Vodacom Internet data from an existing contract to the new one that I applied for on Black Friday,as the deal was too good to pass up. Despite my provision of evidence that I applied for the upgrade and that I was well within the time frames of the promotion, Vodacom decided that I did not qualify for the upgrade and that the system had rated me on a low scale- Obviously, this is not true but merely fabricated, as I have never missed a single payment on my account, and was willing to forward them a bank statement for the past two years to prove my case. All this is, including this complaint is in vain, as the team in charge of sorting out these matters or complaints, simply states that the matter has been resolved, so the public see that they supposedly resolved issues, but do absolutely nothing in addressing them. You are dealing with scammers, who falsely advertise deals and then when you have fallen for the bait, refuse to honor the deals they advertise. BE CAREFUL!! You the customer will have absolutely no one to assist you should you have a query that requires resolve. You can try to phone all the numbers that are advertised on the net, all you'll get is a robot, and when you do eventually speak to a human, they will not be able to sort out your problems. All the staff will do is escalate the problems and you will receive an email within 24 hours to say that the matter has been successfully resolved, whilst knowing full well that they have done absolutely nothing. Find a network that will treat the customer fairly and resolve issues, stay away from Vodacom, as I promise you, you will have endless hassles, that will remain unresolved for the duration of your contract. My hope is that people will wise up, wake up and start treating these companies like Vodacom that take their customers for granted with the same disdain they use in their resolve of issues of their customers.", "business_slug": "vodacom"}}
