{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Billing", "service": "Vodacom", "description": "Vodacom is unwilling or unable to cancel contracts and continues to charge the customer even after a year. The customer has made multiple calls to customer care but the issue remains unresolved.", "suggestion": "Vodacom should immediately cancel the contracts and stop charging the customer. They should also provide a refund for any incorrect charges and ensure that the issue is permanently resolved."}, "meta": {"id": 3749661, "created_at": "2021-12-21 10:08:40", "review_rating": 1, "review_title": "Vodacom unwilling or unable to cancel contracts, still charging after a year.", "review_content": "Words can not express.  Vodacom's incompetence border on the imbecilic. to the mainstream consumer, DO NOT DO BUSINESS WITH VODACOM.\n\nDecember last year I called customer care to cancel my contracts with Vodacom and explicitly told the operator that I was moving my business to MTN for various reasons.  A few months in I am still getting debit orders deducted from my account.  I called customer care again, since you can't inquire on your account in store anymore and do business like a human being face to face, and I was left on hold for half an hour.\n\nI thus decided, since I gave explicitly asked to CANCEL all contracts and close all accounts, to cancel the debit order with my bank.  Then the robotic calls commenced telling me I am owning Vodacom.\n\nIn the third quarter of 2021 I made a call to customer care again to solve the problem and the imbecile on the other end drove me to profanity, problem still not solved.\n\nIn November 2021 I called again, now the forth time and explained to the lady the whole situation.  She managed to rectify the back charges, but I am still getting charged!\n\nListen Vodacom, I do not want to be affiliated with you anymore!  I want this issue rectified ASAP.  I refuse to pay another cent.  I refuse to do business with your farce of a company any longer.  I have contacted you enough, I demand someone with more than three neurons in their melons to contact me and solve this problem permanently!", "business_slug": "vodacom"}}
