{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Service", "service": "Vodacom", "description": "WOW Vodacom what horrible service you have still no response for more than a month. Its been 1 month since I reported and found out about the fraud on my name. I did what was requested yet you still took the payment from me knowing that it's fraud. On top of that, no one has called to assist even with me asking for help. I have waited the time out you gave and I still don't have my money. This amount is nothing to me, it's everything we live on. I would like my money ASAP or I will go to the Ombudsman today as no one at Vodacom is interested in helping. I have done nothing but be patient and I have no more left. I want my R4700 and I want it today. This is my whole salary. It's funny I could not get a R130 contract but you allowed this to go through for a fraudster and staff doing fraud on clients' profiles. I want action to be taken with all that did this to me and proof of that also. And you as a company need to have procedures in place to assist with this faster and have people to escalate this to and not robots answering on request 1 time only. I will not leave this as is even with my money back. I will make sure you do something about the horrible staff you have and the service you offer. I need proof for my Buro and for my info to be rectified.", "suggestion": "Provide a prompt response and resolution to the customer's complaint. Take immediate action to refund the customer's money and investigate the fraud. Implement procedures to handle such cases faster and have dedicated staff to escalate and assist customers. Improve customer service and ensure that human representatives are available to address customer concerns."}, "meta": {"id": 3761426, "created_at": "2022-01-04 09:24:03", "review_rating": 1, "review_title": "WOW Vodacom what horrible service you have still no response for more then a month", "review_content": "WOW Vodacom What horrible service you have.\n\nIts been 1 months since I reported and found out about the fraud on my name i did what was requested yet you still took the payment from me knowing that its fraud on top of that no one has called to assist even with me asking for help.\n\nI have waited the time out you gave and I still don't have my money to you this amount is nothing to me its everything it what we live on.\n\nI would like my money ASAP or I will go to the Ombudsman today as no one at Vodacom is interested in helping you had a great Festive had your salaries and I did nothing for my family as I was waiting for you to repay my money back this is unacceptable i have done nothing but be patient and I have no more left i want my R4700 and I want it today this is my whole salary its funny I could not get a R130 contract but you allowed this to go thru for a fraudster and staff doing fraud on clients profiles.\n\nI want Action to be taken with all that did this to me and proof of that also.\n\nAnd you as a company need to have procedures in place to assist with this faster and have people to escalated this to and not robots answering on request 1 time only.\n\nI will not leave this as is even with my money back i will make sure you do something about the horrible staff you have and the service you offer.\n\nI need proof for my Buro and for my info to be rectified.", "business_slug": "vodacom"}}
