{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Fraud", "service": "Vodacom", "description": "Vodacom has been charging the customer for a contract they did not take, bypassing the debit-check system. The customer has been unemployed and does not go anywhere due to Covid, so they question how they got a contract. The customer has contacted Vodacom and their bank, but has not received satisfactory assistance. Vodacom continues to debit the customer, even at odd hours. Contacting Vodacom is difficult and the chatbot is not helpful for fraud. The customer wants compensation for their time, stress, and bank fees, and plans to lay criminal charges against Vodacom and contact the ombudsman.", "suggestion": "Investigate the fraudulent charges and provide a resolution to the customer. Improve customer service and communication to address complaints effectively."}, "meta": {"id": 3765813, "created_at": "2022-01-07 09:24:48", "review_rating": 1, "review_title": "Fraudulent debits by Vodacom from a non-customer", "review_content": "This is a fraud complaint. Vodacom have been charging me since September 2021 for some contract that I have not taken, and they have by-passed the debi-check system! I have been unemployed since 2020 and do not go anywhere due to Covid. How did I get a contract? \nI have contacted *********** clearly stating my case, asking on three separate emails if the contract is on my name, yet my question was ignored every time. I have reported this to my bank as fraudulent charges, they have been reversed but the bank has charged me fees to reverse these illegal debits by Vodacom. Even with so many failed payments, Vodacom continues to debit me, with a higher amount each month. They have also been making debits at odd hours in the morning, around 2am!\nContacting Vodacom is a nightmare. You have to be a contract customer to get through or else you’re on your own! Tobi, their bot is of no use for fraud!\nYou may only email the fraud department; you cannot call them. I had sent my bank withdrawals with all the descriptions of the debit, including the amounts which they have deducted and, have sent them which I believe to be the “contract number” that was on my bank statements description. The fraud department are no help and don’t even care to assist you! They do not call you even after you requesting for someone to call! They do not read your emails properly or either don’t care to assist you! They only reply to say they want your ID and signature 3 times on the ID. I have explained more than once on the email that I am not comfortable giving them my signature as I do not know whether the contract is on my name! My signature may not even be necessary! I do not want to have my signature on Vodacom’s email system as I do no longer deal with the company, nor care to deal with them in the future as fraud is rife in this company, evident from all the complaints on Hello Peter.\nI have also requested to see the mandate, but nothing was ignored. They have no respect for people who have been robbed by the company, things have to be done their way or the highway apparently! \nLET ME BE CLEAR, I DO NOT TRUST VODACOM! Why do you want my signature before confirming if the account is on my name!!! Who knows what other nefarious activities you can do with my signature, and furthermore, the agent that is dealing with the case does not give out their full name, so how can you ever trust them?\nI firmly believe my details were acquired from Vodacom’s very own database as I was a contract customer over a decade ago, which means, they already have my signature! If I had to guess, their employees are probably re-using old details to hand out contracts to others, that’s how they by passed Debi check!\nWhat gives this company the rights to demand my signature if I am not their customer?!? They are withdrawing my money fraudulently, and do not even care to stop it! I have provided my cell number which can be RICA verified, my ID, and offered to provide my bank statement. They can FaceTime or call me to verify my identify! If this is on my name, confirm it, then I will provide my signature, but don’t ask me for my signature before you confirm if it is on my name!!!!!!!\nThey are causing me undue stress in my life! I have to send an email each month and check on my bill to see if I have been charged. This costs me time, and data! Vodacom are stealing time away from my life and you must pay for that. I want compensation for my time, stress experienced and all my bank fees! My next step is to lay criminal charges against Vodacom and contact the ombudsmen about how Vodacom has handled this situation!", "business_slug": "vodacom"}}
