{"chatbot": {"related": 1, "evidence": "The complaint mentions the chatbot named Tobi as the only point of contact for assistance.", "classification": "Customer service", "description": "The customer is complaining about the lack of human support and assistance from Vodacom when facing issues with fraudulent activity on their account.", "suggestion": "Improve the chatbot's capabilities to handle fraud-related issues and provide a more efficient and satisfactory customer support system."}, "complaint": {"classification": "Customer service", "service": "Vodacom", "description": "The customer is dissatisfied with Vodacom's lack of support and assistance when facing fraudulent activity on their account.", "suggestion": "Vodacom should prioritize customer support and provide adequate assistance to customers facing issues, especially related to fraud."}, "meta": {"id": 3769676, "created_at": "2022-01-11 09:28:29", "review_rating": 1, "review_title": "Vodacon diaries - consumer company that hates consumers", "review_content": "I believe consumer focused companies should never be measured by their ability to sell you new products but rather by how they stand by and support you when their services let you down. \n\nVodacom is one of those consumer companies that is only to happy to take your money for the average service they deliver, but completely abandons you when you most need them when their own service, systems and people fail you. \n\nVodacom is not a brand to be trusted or relied on, they will consistently fail you and charge you handsomely for the priviledge.\n\nWhile I was traveling out the country some random individual did a sim swap and a substantial upgrade on mobile phone account all via a call center. This resulted in a number of other attempts to access other relationships I hold by the parties who conducted the fraudulent upgrades. Sim swaps and fraudulent upgrades occur, that I understand does happen. However when you paint your company as a technology company that is nothing without humanity, you then cannot remove humanity from your organisation and leave your customers to fend entirely for themselves.\n\nThere is a not a human employee of Vodacom that you can talk to find out why your account is blocked, how a fraudulent transaction was carried out and when your services will be reconnected as everything channels through Tobi the chatbot who is able to sell you more airtime or upgrade a phone but fraud ... no can do.\n\nAll staff in the stores are franchise staff, who face the same challenges as the consumer, so again no easy fix and they are largely helpless unless you need airtime or an upgrade. \n\nSpeaking of upgrades, short of providing a DNA swap I get asked for all kinds of supporting documents when upgrading mobile phones in pursuit of RICA, FICA and other regulatory requirements. So my only conclusion is that there is some form of syndicate operating within Vodacom to enable this activity without the same level of due diligence taking place. \n\nMy question to Vodacom is why focus so much getting customers into you ecosystem if you have no plans to support them once they are in it. I have been a customer for 20 years (not loyal, just easier not to change to another provider that is as bad as yourselves) and have grown to dislike the company intensely - not because I feel I am overcharged (although I am) or because I constantly drop calls (which I do) but because when I need assistance to resolve issues there is no one to assist adequately or timeously. \n\nBe better", "business_slug": "vodacom"}}
