{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Deception", "service": "Vodacom", "description": "Vodacom deceived the customer by offering reduced monthly payments and additional data without disclosing the associated costs. The customer's details were shared with another company without consent, resulting in unauthorized deductions from their account. The customer also experienced poor customer service and was unable to resolve the issue.", "suggestion": "Vodacom should investigate the deceptive practices and take appropriate action against the consultant who misled the customer. They should refund any unauthorized deductions and ensure customer details are not shared without consent. Additionally, Vodacom should improve their customer service by addressing system issues and providing timely assistance to customers."}, "meta": {"id": 3772444, "created_at": "2022-01-12 16:38:41", "review_rating": 1, "review_title": "Vodacom deceived me", "review_content": "During December 2021 I received a call from Vodacom advising that they like to thank me for being a Vodacom loyal customer and they would like to reduce my monthly payments by R35 in one of my contracts. The consultant also said to top it up Vodacom will give me 20GB for my tablet and 20GB for the pocket router which they couriered. Keeping in mind that their calls are recorded I kept on asking the consultant if I will be paying extra for this and she assured me that this comes at NO EXTRA costs.. I also did not agree to the disclosures she read to me as they sounded like a contract agreement (listen to the call). A week later I got a random debit order of R35 from Vodacom and this morning I received a statement which reflects an additional contract of R199. I called the customer care to query this and they advised that Mondo actioned the above and I should call them to cancel as I was deceived. This is concerning that Vodacom shared my details with another company and let them deduct my account without my concern. Anyway, I called Mondo and spoke to Glora who advised that all their systems are down and can’t access anything and gave me this reference number 123LM3M which I doubt its legit. I asked Glora to get their Team Leader or manager to give me a call as I wanted to lay a complaint against the consultant that misled me and she advised that I should expect it in an hour. 6 hours later still nothing from them so I called again and got through to Trisha( apologies if I got the spelling incorrect) who said she can’t help me as their systems are down and I must waste my airtime and time to call them again. I asked to speak to her manager and she said she’s transferring me but I think she put me on hold instead as I waited on the line for more than 11 minutes waiting for the manager to pick up the phone and eventually someone dropped my call. This is so frustrating as I need to juggle between my meetings and making sure that this is sorted. I tried to call Vodacom again and guess who I was transferred to??? TOBI the robot!!\n\nI’m really really disappointed in Vodacom for giving my details to another company to deceive me and this goes against TCF!! Come collect your pocket router I don’t want it and cancel the contract which I did not agree to!", "business_slug": "vodacom"}}
