{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Marketing", "service": "MTN", "description": "Spam a dozen times a day and they won’t stop. They changed my prepaid plan to some kind of discount deal and now every single time I make a call, I get an immediate SMS - while I’m dialling - telling me I can get XYZ discount by dialling a number (which doesn’t even work - I either get a “competition ended” message or an error message). The SMS doesn’t include a stop or opt out option - which is a contravention of the POPI Act in itself. After 8 weeks of complaints via Facebook, Messenger, email and via their website (all ignored) I appear to have some kind of contact with either a bot or a person who responds like a bot! They’ve been telling me for the past week to change the emergency alerts setting on my phone (which I can’t find) or the cell broadcast setting (can’t find that either) so now they’re telling me to contact Apple for help. Surely the onus isn’t on me to block them by changing my settings? They’re spamming me a dozen times a day and seriously stressing me out. Why can’t they just stop sending me invalid discount “offers” and respect my choice not to want this incessant spam?", "suggestion": "MTN should immediately stop sending spam messages and provide a clear opt-out option in their SMS. They should also address the customer's complaint and provide a resolution to stop the spamming."}, "meta": {"id": 3801180, "created_at": "2022-02-03 16:02:17", "review_rating": 1, "review_title": "Spam a dozen times a day and they won’t stop", "review_content": "I’ve been with MTN for decades and having opted out of receiving marketing communications from them, all was well until last year. They changed my prepaid plan to some kind of discount deal and now every single time I make a call, I get an immediate SMS - while I’m dialling - telling me I can get XYZ discount by dialling a number (which doesn’t even work - I either get a “competition ended” message or an error message). The SMS doesn’t include a stop or opt out option - which is a  contravention of the POPI Act in itself. After 8 weeks of complaints via Facebook, Messenger, email and via their website (all ignored) I appear to have some kind of contact with either a bot or a person who responds like a bot! They’ve been telling me for the past week to change the emergency alerts setting on my phone (which I can’t find) or the cell broadcast setting (can’t find that either) so now they’re telling me to contact Apple for help. Surely the onus isn’t on me to block them by changing my settings? They’re spamming me a dozen times a day and seriously stressing me out. Why can’t they just stop sending me invalid discount “offers” and respect my choice not to want this incessant spam?", "business_slug": "mtn"}}
