{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "Incompetent customer service, continuous back and forth, issue not resolved, lack of communication, dropped calls, rude and obnoxious behavior, lack of knowledge and understanding", "suggestion": "Improve customer service by providing better training, effective communication, and knowledgeable service consultants"}, "meta": {"id": 3816512, "created_at": "2022-02-15 15:20:06", "review_rating": 1, "review_title": "Incompetent as can be", "review_content": "Dear Vodacom,\n\nWhere oh where do I start with you guys?\n\nHere I am, yet again, dissatisfied by the customer service received and the continuous back and forth because Vodacom just does not care. \n\nI have been dealing with Vodacom since 01 February 2022 and its now the 15th and my issue is still not resolved. \n\nOn 01/02/2022 a service request was logged and was given a turnaround time of 24-48 hours. No feedback given as advised by the representative. \nOn 04/02/2022 I spoke to an agent named Leena who was helpful and advised me that there was an issue at the base station that was affecting my fiber however it was coming up slowly area by arear. \nShe further advised me that the ticket logged on 01/02/202 was closed on 04/01/2022 by a person named Lebz Mgabashe who said they spoke to account holder and advised everything was up. This is utter bull**** as there was not a single form of communication made to the account holder. \nOn 11/02/2022 I reached my point with you people. I spent more than 3 hours on call with Vodacom to get something as simple as damn login details for my router and had no joy in having this provided to me. (Not surprising at all!) I spent 25 minutes on a call and that call dropped and dear Ntsoaki did not bother to call back. I called back, spent another 22 minutes with Ntokozo who also “dropped the call” and did not bother to call back. \nOn 15/02/2022, all I asked from Chumisa was to check if there has been any feedback regarding the ticket that was logged on 11/02/2022 , to which she replied that an email was sent to the account holders address. This was not the case as there was no email sent. I requested for her to forward that email to me and she said she could not trace it. After 35 minutes of trying to resolve my matter, she says she found the email. \n\nBased off this lovely short story above, do you understand my level of frustration? Do you understand how much time I have wasted with incompetent people from Vodacom? Do you understand that all this time I am wasting trying to give some kind of knowledge to the people I speak with is now back logging me from my work. Some of them are downright rude and obnoxious and start giving you attitude. \nEvery single time, without fail, I have to bring the roof down in the office to get my point across and it really is not fair for me to put my colleagues through negativity because of Vodacom. \n\nI’ve even spoken to someone from head office who had no idea of the process and procedures followed, who lacks understanding and can’t tell his ass from his elbow.\n\nI dread calling for assistance from Vodacom every time there’s an issue because I know my day is going to get ruined trying to get a simple query out of people who do the bare minimum and just rock up to do their job to get a salary. \n\nVodacom literally has the account holder wanting to stop dealing with you guys and go to another service provider who has less drama and a little more knowledgeable service consultants. \nWe have been a customer with Vodacom well over 10 years and it seems each time I call for assistance, it keeps getting worse and worse, Tobi the chat bot is better at getting things done! I’m appalled by such service from such a reputed company. Please do not say that you as Vodacom can do such things knowing full well that it is impossible for your personnel to do. \nI trust this email does not go in vain and some corrective action is taken regarding the aforementioned because if this email does go in vain, Vodacom can say goodbye to its loyal customers. No loyal customer enjoys such putrid customer service.", "business_slug": "vodacom"}}
