{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Internet Service Provider", "service": "Rain Internet Provider", "description": "Rain Internet Provider is not providing internet service and has not responded to customer's complaints and requests for support. The lack of service has caused the customer to lose a deal with a gaming company and has negatively impacted their online presence and fan base.", "suggestion": "Rain Internet Provider should promptly address the customer's complaints, provide compensation for the lack of service, and improve their support and technical knowledge to prevent similar issues in the future."}, "meta": {"id": 3816069, "created_at": "2022-02-15 12:18:45", "review_rating": 1, "review_title": "Rain Internet Provider providing no internet just stress", "review_content": "Ive been a rain user since 2018 and its been working fine considering im located close to 3 signal towers.\n\nHowever since end of January i experienced issues which occasionally does occur and lasts for a few days due to prior experience. After a week passed i decided to drop them a mail in order to try and resolve the issue since im using the connection mainly for managing and growing my YouTube channel, after receiving no response by week 3 i then popped them a follow up mail detailing all the troubleshooting ive done up to that point which then managed me to get a response with options from support to do thing's ive already done (no help), the issue then got escalated and eventually o grt a mail from someone named Marvin Jacobs claiming my issues should be resolved after i turn off my router for 15min which didnt work.\nNow every email i send goes to a nonresponsive robot requesting that I rate a non existing service.\n\nI have since lost a deal with a gaming company which took me years to aquire, its past week 3 and no support is being offered with no resolution.\nDo not use rain, they are unethical and lack knowledge to provide support within the field there business operates. They lack common decency to offer there clients compensation for the lack of service they providing regardless of what the client pays for. I've sent them video proof of webpages not being able to load ass well as a speed test that displays a connection speed rated below 0.10kb/s per second which is lower than a 2g connection on a 4g line?\n\nDont use rain unless u want endless connection issues with untrained staff that only knows about rebooting and resseting devices in an age where even 5yr olds carry the knowledge of trying a reboot to resolve issues.\nIve lost traction in my ventures, ive been unable to respond to check my social accounts or to respond to the small fan base thats taken me years to grow(probably lost them by now) all ive gained after 3 to 4 years of loyal service is a feeling of depression.", "business_slug": "rain-internet-service-provider"}}
