{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Poor Service", "service": "Rain", "description": "The customer is complaining about the poor service provided by Rain. They mention issues with product delivery, slow internet speed, and lack of support.", "suggestion": "Rain should improve their product delivery process, ensure better internet speed and connectivity, and provide prompt and effective customer support."}, "meta": {"id": 3818352, "created_at": "2022-02-16 15:38:25", "review_rating": 1, "review_title": "The Epitome of, \"How NOT to run a business\". Useless to say the least!", "review_content": "Let me put it this way... If Rain shut their doors and closed \"shop\", the stress, frustration, and anxiety levels of people in South Africa would be a lot less. That is how useless Rain is. HelloPeter should have a negative or at least a zero rating system, even a 1-star rating is way too much for this company.\n\nI understand that the delivery of the product is through a third-party courier company but even Rain couldn't organize that properly. I ended up fetching the product myself. Let me not even talk about why I had to spend almost 3-hours in the reception with the correct documents for RICA...\n\nOnce I got the product, I was like an excited 5-year old at Christmas, getting back home with my \"plug-n-play\" ZTE 5G Router, I followed the instructions and got everything set up thinking \"Oh yeah! 5G 25MB/sec at R499, here we come, WooHoo! \n\nBefore I carry on and Rain comes back with the commonly used \"weak signal\" excuse, let me inform you firstly that your website put me square in your 5G zone. I am less than one kilometre from one of your signal towers. I am in a second-floor apartment with the modem facing towards the tower, and it's by the window! At best, (2-3 am) I am getting no more than 2-4MB per second on a speed test app as well as google's speed tester. That's on WiFi (both Android and Windows PC). When connecting the RJ45 cable that comes with the router (in the original box), it drops all connections (zip, zero, nada) Not even the WiFi works!!! Keep in mind that ALL the white lights on the face of the modem are lit up like a Christmas tree! The only setting I can have the router on is the default \"Wireless Broadband\" \"Auto\" doesn't work as well as the \"cable\" connection.\n\nThen there's the support, or shall I say the NON-EXISTENT support. After numerous attempts at calling their zero eight one number, I finally get through (this is the first time). I speak to someone whose only response was, \"I understand your problem\" but has no solution! After I remind him to offer the support he is supposed to give me, he comes back with... \"let me do some research and I'll get back to you... This was a week ago! ... On my second call, repeating my issue again, I was told that this issue needs to get escalated to the technical department and that it could take up to 72 hours just for someone to get back to me (and who's to say they'll even have a solution)... Here's silly me thinking that I was chatting to support, as that's the option I chose from the annoying bot that answers the call... And yes, you guessed it! I'm still waiting for a response.\n\nSTAY AWAY FROM THESE PEOPLE!!!!! They are worse than Eskom, seriously. At least Eskom gives you electricity more times than they load shed. This company is the epitome of, how NOT to run a business.\n\nI would cancel, however, reading some of the other comments in this thread, I'll just put a stop-order on my account and they can come and fetch their useless router if they even get to phone me. Personal experience so far ... I'm thinking I'll sit with this router for a long long time... Fair enough, I'll have no internet due to the stop-order but they can come and fetch their router as I had to fetch when I ordered it.", "business_slug": "rain-internet-service-provider"}}
