{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Horrible Service", "service": "Vodacom insurance", "description": "I handed in my phone for repairs at Vodacom Eastgate and have not received it back to date. The promised repair time was 2-3 days. I had to buy another phone due to work requirements. I also received a text stating that I need to pay an amount of R3448.48, which I did not understand as I filled in insurance forms. I went to a Vodacom store for assistance in Mall of Africa and was told to call for a follow-up. The call lasted for 23 minutes with no solution. I was told that the IMIE number was incorrectly completed by the Vodacom consultant and was requested to go to the store to request them to correct it. I have been inconvenienced and have wasted time, airtime, and money due to the horrible service.", "suggestion": "Vodacom should improve their repair process and ensure that repairs are completed within the promised timeframe. They should also ensure that their consultants accurately complete customer information to avoid errors and inconvenience to customers."}, "meta": {"id": 3836558, "created_at": "2022-03-02 08:38:07", "review_rating": 1, "review_title": "Vodacom insurance - horrible service", "review_content": "I handed in my phone for repairs at Vodacom Eastgate and have bot received it back to date and we are now on 2 weeks when the promise waz 2 -3 days. I even had to buy another phone due to work requirements. \n\n\nI got a text stating that I need to pay an amount of R3448.48 and I did not understand this as I filled in insurance forms.\n\n\nI went to a Vodacom store for assistance in Mall of Africa and I was requested to use my airtime again and call for a follow up. I called and the call lasted for 23 minutes until I hung up as there was no solution. I was told that the IMIE number was incorrectly completed, this was done by the Vodacom consultant but I was requested to go to the store to request them to correct it. This is after I was moved from pillar to post and the call centre consultant put me through to insuarance to assist stating that they already had my IMIE number and I just need to confirm the details but here I was being told to waste time again and resolve an error made by their consultant.\n\nThe sms sent with numbers to contact is also useless as the landline doesn't go through and the watsap number sent also did not help as there was no response to the watsap sent.\n\nYes I knoe this delay has to do with the fact that ny contract was approaching term and contract was ending of which I did not want to renew.\n\nI have been inconvenienced and have wasted time, airtime and money to get a new phone because of the horrible seevice.\n\n\nThis is for job number **********7.", "business_slug": "vodacom"}}
