{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Billing", "service": "Contract cancellation", "description": "I've been trying to cancel my contract since Jan 2022. The two-year contract ended in Jan which I finished. I've called ********** numerous times. Your f(*&(*& robot confirmed that my contract is cancelled successfully. After the money was deducted from my account and I called ********** again, again I was told my contract is cancelled successfully. This time I talked to a consultant. The lovely consultant told me that customers are not aware that they need to speak to a consultant to successfully cancel their contract. Please fix this. She made me take a contract for R79 PM. I called again on 22 Feb to make sure it won't be deducted as I got an SMS that says R239.99 would be deducted. Another lovely consultant assured me that my contract is cancelled and only R79 would be deducted. Yesterday you deducted R239,99. Please fix this and refund me and don't ask me to post it on your Facebook page.", "suggestion": "Please refund the deducted amount and ensure that the contract cancellation process is clear and properly communicated to customers."}, "meta": {"id": 3836719, "created_at": "2022-03-02 09:39:11", "review_rating": 2, "review_title": "Refund my debit order for cancelled contract", "review_content": "I've been trying to cancel my contract since Jan 2022. The two-year contract ended in Jan which I finished. \nI've called ********** numerous times. Your f(*&(*& robot confirmed that my contract is cancelled successfully. \nAfter the money was deducted from my account and I called ********** again, again I was told my contract is cancelled successfully. This time I talked to a consultant. The lovely consultant told me that customers are not aware that they need to speak to a consultant to successfully cancel their contract. Please fix this.\nShe made me take a contract for R79 PM.\nI called again on 22 Feb to make sure it won't be deducted as I got an SMS that says R239.99 would be deducted. Another lovely consultant assured me that my contract is cancelled and only R79 would be deducted.\nYesterday you deducted R239,99.\nPlease fix this and refund me and don't ask me to post it on your Facebook page.", "business_slug": "vodacom"}}
