{"chatbot": {"related": 1, "evidence": "The customer mentioned that they can only speak to a chatbot on the website.", "classification": "Customer Support", "description": "The customer is complaining about the lack of response and support from the chatbot.", "suggestion": "Improve the chatbot's responsiveness and provide better customer support."}, "complaint": {"classification": "Service", "service": "Telkom Openserve", "description": "The customer had a terrible experience with Telkom Openserve. They did not receive the promised router and have been unable to reach out to ask for it. The customer has also not received any response to their emails and the tracking app provided is not working.", "suggestion": "Deliver the promised router, improve communication and responsiveness to customer inquiries, and fix the issues with the tracking app."}, "meta": {"id": 3839035, "created_at": "2022-03-03 12:08:36", "review_rating": 1, "review_title": "Telkom Openserve Highly do not recommend", "review_content": "Highly do not recommend this ISP, having a terrible experience. I signed up early Feb to FTTH. I waited 2 weeks and metro Fibre was sent out to do the installation and Telkom only sent out a UPS no router as promised in the package. I have been trying so hard to reach out to ask for the router to be delivered but it's like the company doesn't want to hear their customer. When you go on the website you can only speak to a chat bot, I have been waiting up to now for call back that was logged on the website. I have sent numerous email and no reply to date. There's no call centre number l feel really lost as a customer not sure what else to do. They also send you a link to an app to track your order, alas that is not working because it tells me there is no such service number  or order number even though that is what they sent to me on SMS. I'm so dissapointed,  I just wish I never signed up and should've known better from a company with such low ratings, do not sign up with this company not good at all", "business_slug": "telkom"}}
