{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Unfair price increase", "service": "Contract", "description": "I received an email stating that my contract price will increase by 5% on 1 April. I had previously signed a contract where I was paying R149 per gig, but the price per gig dropped to R85. When I asked if my monthly contract would decrease, I was told no because I had committed to pay R149 for 24 months. Now, when I ask why my contract is increasing, I am told that Vodacom has the right to increase prices. It seems unfair that they can increase prices but not decrease them. Additionally, the contract includes SMS bundles that I do not use. As a result, my wife and I will be migrating our packages to the lowest top-up available and waiting until the contract expires to change providers. We will also be canceling our fiber and switching to a cheaper provider with better benefits. This will result in R3000 being taken off Vodacom's books. I have also experienced poor customer service, with over 40 minutes of waiting on hold. Screenshots were taken as evidence. Furthermore, for only R52 per month, Standard Bank gives me R220 airtime and data per card swipe. I will use my dual SIM phone to make calls and receive from Vodacom's downgraded package until I can migrate my number.", "suggestion": "Vodacom should reconsider their price increase and provide more flexibility for customers who have signed contracts. They should also improve their customer service and offer more competitive pricing compared to other providers."}, "meta": {"id": 3842663, "created_at": "2022-03-06 19:50:58", "review_rating": 1, "review_title": "Unfair price increase", "review_content": "I got an email saying my contract price will it increase on 1 April by 5%.\nOn my last contract I was paying R149 per gig, the price per gig dropped to R85. I asked if my monthly contract would decrease, I was told no as I signed a contract and committed to pay R149 for 24 months. For enough the contract was signed.\nNow when I ask why my contract is increasing now I am told vodacom can has the right . Besides committing to a contract for 24 months. \nOnly when it's an increase it will change but not a decrease. A contract bundled with sms that no one uses. Un the next few days bot my wife and I will migrate out packages to the lowest top up available and ride out the contract till it expires and then change providers.  We will also be canceling our fibre during the week and get a cheaper provider with better benefits. \nThis week R3000 will be off your books . Hope the 5% is worth it. And still increase prices but still no customer service over 40 min on hold screens shots were taken.\nPs for R52 a month standard bank gives me R220 airtime and data per card swipe.  My dual sim phone will make the calls and will receive from vodacom downgraded package till I can migrate my number", "business_slug": "vodacom"}}
