{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Service", "service": "MTN", "description": "Pathetic level of service. The customer has been experiencing multiple problems with their HiSense phone purchased from the Checkers Norkem Park branch. The phone loses signal, drops calls, has delayed connection, produces distorted sound, freezes during video playback, and has issues with notifications. The customer has been trying to get a spare device for repairs but has faced delays and a lack of communication from MTN. The customer is frustrated with the poor service and its impact on their professionalism.", "suggestion": "MTN should promptly address the customer's complaints and provide a solution to the issues with the HiSense phone. They should improve communication with customers and ensure timely resolution of problems."}, "meta": {"id": 3843053, "created_at": "2022-03-07 09:55:51", "review_rating": 1, "review_title": "Pathetic level of service", "review_content": "Thursday morning I sent a mail through to the complaints department, voicing my utter disgust at the service I have been receiving from one of your branches. Now, two days later I have still heard nothing from anyone. \n\nI suppose you have the sale, making your money monthly, so why should you give a rats ass about the problems people are experiencing!!\n\nThis was what I sent through last Thursday....\n\nSeveral months ago, I upgraded my cell phone contract with MTN at your Checkers Norkem Park branch. I have always had Samsung devices, but got assured by the sales people there that the new HiSense device was a better option. \n\nI have been back to the shop a few times to complain about problems that I have been experiencing with the phone, which they have tried to remedy, and in the end, just tell me that they are not sure what could be the problem. Thats where it has been left. The problems that I mentioned to them, have increased, and a number of other problems have begun with the phone. \n\nRoughly 3 weeks ago, I went into the shop, to ask if they had a spare device, they could loan me so that I could send my phone in for repairs. They said they didn't have a spare device with internet abilities, but rather a cheap entry level phone, but would arrange with HiSense to bring a spare device through for me to use while mine was in for repairs. I explained the need for an Android device, as I deal with the mining industry, and have to be reachable 24 hours a day in the event of an emergency. I went back to the shop where I took my contract through on Friday the 25th February, to find out if they had managed to arrange a spare phone. Only then did they get in touch with HiSense, to see if one could be arranged. Nearly 2 weeks after I had first asked them to arrange something. They were told by Patience that she wasn't in the office, and should call back on Monday the 28th. I went back to the shop again on the Monday just after lunch, to be told that a spare device should be arriving on Wednesday the 2nd March and that mine can then be booked in to sort out the faults. I went through to the shop at 15h00 yesterday, to be told that they still had not arrived with the spare phone as yet. Neatly 3 weeks, and there seems to be a don't care attitude from MTN about their customers and the difficulties they are experiencing. \n\nProblems that I have mentioned to them are as follows:\nThe phone continually loses signal down to zero. I will receive a notification of a voice mail without my phone even have rung.\nDuring calls, the phone drops signal off, clients can barely hear me, and I have to then try and phone them back when the signal decides to return.\nThe phone will regularly just cut calls completely whilst I am on the phone with someone.\nWhen I try and phone anyone, it takes ages before it decides to connect and start ringing.\nOn many occasions, when the phone does connect and ring when contacting someone, it sounds like a high-pitched robot sounding ring tone. Then if someone does happen to pick up, their voice sounds like a high-speed robot on helium. I then have to cancel the call either during it ringing, or when they answer, and then phone them back. This is extremely unprofessional as it appears like I am trying to give them a missed call to phone me back. The level of people I deal with in the mining industry, CEO's and CFO'S, this gives the impression that our company is on prepaid with giving missed calls. \nIf I try and watch some videos, the video is completely frozen, yet the sound is playing in the back ground. I have to double tap the screen to enlarge it before it actually plays.\nWhen I try and put an address into google maps, it takes roughly 10 minutes to even find where I am and calculate the route. This is off my home Wi-Fi. \nI have to have applications like email, LinkedIn, Microsoft teams on my phone for work purposes. If I go into them whilst I am out the office, I will get follow up notifications should I receive anything through any of these apps. If I am on my laptop, and an email or LinkedIn notification comes in, I generally swipe it off my screen as I can address it on my laptop. The phone will suddenly just stop sending notifications to me for no reason at all. I will have clients phoning me if I am out the office, asking why I have not responded to their mails, when I have not even been notified of it. \nIf there are occasions where I contact someone via Wattsapp call, I am told that I either sound like I am on the toilet with the extreme hollow sound, Or like I am the robot that has taken helium with how my voice sounds.\nWhen I was at the MTN shop on Monday, I made mention that I am now so frustrated with the phone, and the fact that it is starting to make my work look unprofessional, that I will even give them the choice of which wall in their shop I will throw the phone through. They took this as a joke. The sad part, is I was dead serious with how highly irritated I am with the phone, and the fact that the service is actually beyond pathetic. This is all a bad reflection on MTN as a group!\n\nI would like to know how this issue will be resolved, and how long exactly it will take to rectify it? I should've stayed with my gut instinct and remained with Samsung as I always have, instead of being told otherwise. \n\nI await your speedy response with regards to this well overdue, and extremely frustrating and **** poor level of service I am currently receiving.", "business_slug": "mtn"}}
