{"chatbot": {"related": 1, "evidence": "The customer mentioned that they tried using the live chat bot but it was not helpful.", "classification": "Customer support", "description": "The customer complained about the chatbot being useless and unable to connect them to a live chat agent.", "suggestion": "Improve the chatbot's functionality to better assist customers and ensure it can connect them to a live chat agent when needed."}, "complaint": {"classification": "Billing", "service": "Phone contract", "description": "The customer's bank account was debited for the monthly contract fee even though the contract was cancelled and all outstanding fees were paid upfront.", "suggestion": "Credit the money back to the customer's account and ensure that debit orders are not processed for cancelled contracts."}, "meta": {"id": 3844803, "created_at": "2022-03-08 09:44:10", "review_rating": 1, "review_title": "Cancelled contract debited", "review_content": "I did an early cancellation of my contract in February, as I was leaving the country. I paid an exorbitant amount for this early cancellation. My phone contract was cancelled a few days later and I was moved to pre-paid immediately.\n\nFast forward to the 1st March, and my bank account was debited the monthly contract fee, even though the contract was cancelled and ALL outstanding fees paid upfront via the early cancellation fee.\n\nI asked my wife to contact you as she's still in South Africa, but she was just told they can't help her and that I need to contact Vodacom via live chat or an email to customer care. I sent an email to customer care 5 days ago (reference 002BVaH1VDMXFQGK, as per the auto email I received), but have not been contacted at all. I just tried using your live chat, but Tobi the bot is useless and can't connect met to a live chat agent.\n\nI need that money credited back to my account, as that debit order should not have gone off. The contract is cancelled and paid in full.", "business_slug": "vodacom"}}
