{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "Vodacom cancelled my active sim card without warning, which I have been using for my security system for about 10 years. My security system has been compromised and my sim card number has been allocated to another client. I cannot get personal service or contact someone to assist or explain why my sim card was cancelled. I also cannot get a refund of my airtime.", "suggestion": "Vodacom should provide better customer service and allow clients to contact someone for assistance. They should also provide an explanation for cancelling sim cards and offer refunds for unused airtime."}, "meta": {"id": 3854414, "created_at": "2022-03-15 13:34:22", "review_rating": 1, "review_title": "Vodacom bad practise", "review_content": "Vodacom has cancelled my active sim card (without warning)  which I have been using for my security system for about 10 yrs. There was about R20 of airtime left on it. Admittedly it was used intermittently over the years as it only sent alarm activation sms's and occasional test reports. But it was active. It was even linked to my active profile  on the Vodacom  website. In addition my security system has been compromised for a time of which I was not aware , which could have exposed me to danger and loss of goods.\nThey have now allocated my sim card number to another client.\n \nIt is futile to contact Vodacom as all one gets is an automated response and a computer Bot who cannot deal with out of the ordinary problems. This is a frustrating practise of large corporations like Vodacom these days. There is no provision by these corporations like Vodacom  for any means by their clients to get personal service or to contact someone to assist or to be able to contact a Manager. The Managers and Directors have placed themselves beyond reach of their clients.\nSo now I have no recourse or means of getting a refund of my airtime from Vodacom  which they appropriated for themselves or even an explanation as to why they cancelled my sim card.\nI am intending to lay a charge in the Small Claims Court against Vodacom and subpoena  their MD appear before it, as a matter of principle.", "business_slug": "vodacom"}}
