{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "VODIACOM", "description": "You are thieves, hiding behind untrained voices that may as well be robots. I am Fuming, Raging, Spitting-Mad. I am also STUNNED that there seem to be no other negative VODACOM reviews on this platform. I was a Vodacom customer for going on 20 years. I had a contract which came to an end November 2020. On 01 November I sent a letter to Vodacom informing them that I did not wish to renew my contract. Several months later, the madness started. The story is too long, arduous and insane to repeat AGAIN, simply because I have told this story, OVER AND OVER AND OVER AND OVER. A mere 5 times this morning alone. The passing of the buck, sent from pillar to post, the lack of accountability - is CRIMINAL. To add insult to injury .... they kept charging me. I AM AGHAST, and despair. HOW IN GOD'S NAME am I going to fix this/ The Legal Department did give me some advice. - to simply pay the ARREARS which has tripled over the past year. I am sitting here, literally suppressing a scream. VODACOM your service is a disgrace....", "suggestion": "Investigate the customer's complaint thoroughly and provide a resolution that addresses their concerns. Improve customer service training and accountability to prevent similar issues in the future."}, "meta": {"id": 3865277, "created_at": "2022-03-24 11:48:33", "review_rating": 1, "review_title": "VODIACOM - You are thieves, hiding behind untrained voices that may as well be robots.", "review_content": "I am Fuming, Raging, Spitting-Mad.  \nI am also STUNNED that there seem to be no other negative VODACOM reviews on this platform.  \nI was a Vodacom customer for going on 20 years.  I had a contract which came to an end November 2020. On 01 November I sent a letter to Vodacom informing them that I did not wish to renew my contract.   \nSeveral months later, the madness started.  The story is too long, arduous and insane to repeat AGAIN, simply because I have told this story, OVER AND OVER AND OVER AND OVER.  A mere 5 times this morning alone.  \nThe passing of the buck, sent from pillar to post, the lack of accountability - is CRIMINAL.  To add insult to injury .... they kept charging me.  I AM AGHAST, and despair.  HOW IN GOD'S NAME am I going to fix this/  The Legal Department did give me some advice. - to simply pay the ARREARS which has tripled over the past year.  I am sitting here, literally suppressing a scream.  VODACOM your service is a disgrace....", "business_slug": "vodacom"}}
