{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom Repairs Shop at Vincent Shopping Centre Mall", "description": "The customer visited the shop for cellphone repairs with an approved insurance claim. After two months of waiting, the phone was not fixed and the staff said they were still waiting for parts. The customer was not informed about the delay and when they went to check, the parts had been returned. The customer is disappointed with the lack of communication and assistance from the staff.", "suggestion": "Improve communication with customers and ensure timely repairs by properly managing parts inventory and providing regular updates on the status of repairs."}, "meta": {"id": 3881677, "created_at": "2022-04-05 17:15:27", "review_rating": 1, "review_title": "VINCENT East London VODACOM REPAIRS SHOP - IS A MESS!!!!", "review_content": "I must say I am very disapointed with the service I have received from vodacom. The Vodacom Repairs Shop from Vincent Shopping Centre Mall is absolutely a mess. \n\nIn January 2022 I have visited the shop for repairs on my cellphone with insurance approved the claim. The staff member who was assisting me said I can leave the phone so that the technician can order parts and fix the phone. After two full months with no communication nothing, I decided to go and fetch my phone and when I get there the phone was not fixed and they said they are still waiting for the parts to arrived (imagine after two months waiting). I said they must give me my phone to use it because only screen was broken and it was still working. I said they must tell me when the parts arrived to so that I can return the phone for repairs. Monthend of March I went there to ask if parts have not arrived and they said they arrived and they returned them back because no one knew where to fit them and I was bot called to return the phone. The lady said they will call and re-order them again and they will arrived on the 4th of April 2022 and When I went there to check   THERE WAS NO PARTS.\n\nAs from yesterday I told myself that I WILL NEVER EVER GO THERE AGAIN I AM DONE WITH THEM.\n\nI have also noted the following things from their staff members:\n\n1. NOT EVEN A STAFF MEMBERS WITH A NAME TAG.\n2. NO ONE IS WILLING TO ASSIST \n\nI AM VERY DISAPOINTED WITH THEIR SERVICE!!!!!!!", "business_slug": "vodacom"}}
