{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Bad service", "service": "Vodacom", "description": "I took out a contract in December for a Huawei Nova 9 and had issues the whole time with the screen not switching off when on a call and putting the caller on hold and phoning someone else. Took the phone in multiple times for repairs but the issues persisted. The phone I received as a replacement also had the same issue. I requested to cancel the contract or get a different phone, but my requests were not fulfilled. The phone was sent to the wrong location and I have been facing delays and lack of communication from Vodacom.", "suggestion": "Improve customer service, ensure proper inspection and repair of devices, fulfill customer requests promptly and efficiently."}, "meta": {"id": 3887045, "created_at": "2022-04-08 21:57:11", "review_rating": 1, "review_title": "Bad service", "review_content": "I took out a contract in December for a Huawei Nova 9 and had issues the whole time with the screen not switching of when on a call and putting the caller's on hold and phoning someone else. Took the phone in and waited about a month and got it back with the same issue so I took it back again and waited another month and they supplied me with different Nova 9 and it had the same issue so I sent it back again and waited another month. The phone came back and it was a dual Sim with the same issue and if I phone from Sim 1 the other people can't hear me and say it sounds like a robot so I took it back for the 4th time and asked them to cancel the contract as I have been paying the whole time and not having a phone or let me take a different phone like Samsung or something with the same value but not a Huawei but that did not happen and I am still waiting for the phone as they sent it to Cape Town instead of Port Elizabeth as I went in to the store to find out what's going on for about the 30th time. I spoke to Riaan Van Wyk that is in charge of Vodacom repairs in Cape Town today and he said that he is aware of the problem with my phone as he had the job number without me giving it to him and said that he would phone me back in a bit that was 1 o'clock and I'm still waiting. I must say that this is the worst service that I have ever had in my life I actually had to do an early upgrade just to have a phone as I have no idea when that phone will get back to me and 10 to 1 it would have to go back with the same issues I really don't think that the technicians do an proper inspection on the units as the manager at Vodacom Baywest used the phone to test it the last time it went in and it did exactly what I was complaining about and the worst of it all is that I have 3 contracts with Vodacom and my fiber for my internet is with them as well. If I had to tell someone to get a contract it will not be with Vodacom!!!", "business_slug": "vodacom"}}
