{"chatbot": {"related": 1, "evidence": "The complaint mentions automated bot responses", "classification": "Customer Service", "description": "The customer is complaining about the lack of customer centricity and the repeated automated bot responses", "suggestion": "Improve the chatbot by providing more personalized and helpful responses"}, "complaint": {"classification": "Customer Service", "service": "Fibre update", "description": "The customer is complaining about the lack of communication and resolution regarding their Fibre update, as well as the cancellation of their account and debit order", "suggestion": "Resolve the Fibre update issue, provide clear communication and updates to the customer, and address the high mobile data cost burden"}, "meta": {"id": 3897369, "created_at": "2022-04-20 06:38:23", "review_rating": 1, "review_title": "Zero Customer centricity", "review_content": "#gatvolvodacom please advise on my Fibre update, it’s evident that there is zero customer centricity. I have now spent hours of my time trying to get some sort of indication when my issue will be resolved and just to get clarity on the way forward regarding my current account and wether it now has been canceled along with the debit order.\n\nI keep hearing the same story over and over again which is automated bot responses. We are really sorry and we have escalated the matter please allow us some time. How much time do you need? Time is a more valuable than anything in life and you are wasting mine.\n\nSR**********41, let me spel it out, EVERYTHING has already been installed, so please do not send a team unannounced to my home again over a weekend, them having no knowledge of the issue and merely informing me there is nothing they can do, a Technical team needs to come out to adress the low connection issue. I have spoken to industry experts saying it is such a small fix, yet i have now been waiting from the 7th of April for this Team to be in contact. Worst of all, knowing the lead time of this so long, I started my enquiry in February already to ensure we do not sit in this situation, yet its more than two months with zero connection and i have to carry the burden of extremely high mobile data cost. \n\nI urge you to please get this resolved within the next 24 hours.\n\nJohann", "business_slug": "vodacom"}}
