{"chatbot": {"related": 1, "evidence": "The customer mentioned trying the Tobi chatbot", "classification": "customer support", "description": "The customer complained about the chatbot being useless and not providing any assistance", "suggestion": "Improve the chatbot's functionality and provide more helpful responses"}, "complaint": {"classification": "service issue", "service": "Vodacom Apple Watch Cellular", "description": "The customer's Apple Watch cellular service stopped working despite being activated and charged for it", "suggestion": "Investigate and resolve the issue with the Apple Watch cellular service"}, "meta": {"id": 3897850, "created_at": "2022-04-20 11:16:21", "review_rating": 1, "review_title": "Vodacom Apple Watch Cellular service not working", "review_content": "The apple watch cellular saga continues with Vodacom. If you are thinking on using them...DON'T! I purchased an Apple Watch cellular last year and what an absolute nightmare it was getting it activated with Vodacom. This year, my watch was replaced and I activated the cellular service again through the Watch app on the iPhone. Everything appeared to be in working order. I was charged for the activation and have been paying a monthly fee for the OneNumber service. Unfortunately, the service has mysteriously stopped working. I have tried emailing Vodacom - no reply. Then I tried the Tobi chatbot - useless. Then I spoke to a consultant - equally as clueless. She kept telling me to activate the service that is already activated!  I am still being charged for a service that does not work. The iPhone Watch app shows the Vodacom plan as \"not in use\". The watch, when tapping the icon to activate mobile data, shows a black screen. Turning everything on and off DOES NOT WORK VODACOM. Nobody seems to know what the hell is happening. I delayed upgrading with Vodacom for years but eventually succumbed and boy do I regret it. I cannot seem to get any competent assistance with this.", "business_slug": "vodacom"}}
