{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Terrible service", "service": "Vodacom", "description": "I purchased I phone online as an upgrade. The person who did the order instead of using my number he gave me a new SIM card and one item was missing from the order. I tried to complain in the first 7 days and now it has been two months and nothing happen. I called multiple times but I couldn't get hold of a real person . I went to Vodacom store, he said he can't help me as the purchase was made online and all he can do is to email them. A team leader emailed him back and said that i have to call a number that they gave me. I spent 2 hours and one person throw me to another and they keep cutting the call or sending me to the robot. When I ask to talk to a manager they cut the call or they say I'm working from home ot the manager is not here ....ect. They wasted my time and my money. Before I did all this I tried to change my number to Telkom and Vodacom refuse to migrate the number. Unacceptable and terrible service , poor quality customer service. Their call center is more useless and have no manners to cut the call on a customer and never call back. They don't even know what they are doing. They just receive calls and transfer it to another useless person and carry on like that.", "suggestion": "Improve customer service by ensuring that customers can easily reach a real person for assistance. Train call center staff to be knowledgeable and helpful. Address issues promptly and provide appropriate solutions to customer complaints."}, "meta": {"id": 3898226, "created_at": "2022-04-20 13:40:23", "review_rating": 1, "review_title": "Terrible service", "review_content": "I purchased I phone online as an upgrade. The person who did the order instead of using my number he gave me a new SIM card and one item was missing from the order. I tried to complain in the first 7 days and now it has been two months and nothing happen. I called multiple times but I couldn't get hold of a real person .\nI went to Vodacom store, he said he can't help me as the purchase was made online and all he can do is to email them.\nA team leader emailed him back and said that i have to call a number that they gave me. I spent 2 hours and one person throw me to another and they keep cutting the call or sending me to the robot. When I ask to talk to a manager they cut the call or they say I'm working from home ot the manager is not here ....ect.\n\nThey wasted my time and my money.\nBefore I did all this I tried to change my number to Telkom and Vodacom refuse to migrate the number.\nUnacceptable and terrible service , poor quality customer service.\nTheir call center is more useless and have no manners to cut the call on a customer and never call back. They don't even know what they are doing. They just receive calls and transfer it to another useless person and carry on like that.", "business_slug": "vodacom"}}
