{"chatbot": {"related": 1, "evidence": "The customer mentioned the chatbot named TOBI and expressed frustration with its inability to address the issue.", "classification": "Customer dissatisfaction with chatbot", "description": "The customer is complaining about the chatbot TOBI's inability to resolve the issue regarding a defective number assigned by Vodacom.", "suggestion": "Improve the chatbot's capabilities to handle nuanced issues and provide options for customers to speak to a live person when necessary."}, "complaint": {"classification": "Telecommunication service issue", "service": "Vodacom", "description": "The customer is unable to use a number assigned by Vodacom for calling and receiving SMS. The number is defect and calls from a cellphone do not go through. Additionally, the customer receives marketing texts and notifications meant for the previous user of the number.", "suggestion": "Resolve the issue with the defective number and ensure that the customer can use it for calling and receiving SMS. Also, ensure that the customer does not receive irrelevant texts meant for the previous user of the number."}, "meta": {"id": 3908402, "created_at": "2022-04-29 08:47:29", "review_rating": 1, "review_title": "Unable to use a number assigned by Vodacom.", "review_content": "I have been calling 135 numerous times and there is no option to be assisted by a real life Consultant. On my online queries I have found their victual robot ''To be'' unable to resolve the issues I had. Theoretical scenarios were given as a resolution which, and the only thing achieved was a waste of my time, and infuriating.\n\nI got a contract with Vodacom for a Tablet for my son, the number that came with it is defect. By that I mean I can not call him, calls from a cellphone do not go through, regardless of the network.\nAlso, he can not receive sms's, he only gets marketing texts and Nedbank notifications meant for user that Vodacom assigned the number to prior to me/my son (I assume).  I have tried multiple times as mentioned before calling the call center but the options given by TOBI do not address this issue.\n\nI sent an email which seemed to attract a back and forth that required me to do authentication. The type of work I do and responsibilities at home as a mother, wife, daughter in-in-law does not allow me the luxury of leaving things unresolved the first time, hence I preferred calling but 135 (Tobi's play ground) has been unable to assist or give an option to speak to a live person who can hear and understand nuanced issues not pre-programed on Tobi.\n\nThe number in question is **********. I can be reached in **********.", "business_slug": "vodacom"}}
