{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "customer service", "service": "Vodacom", "description": "I contacted Vodacom on 18 April to change my debit order date from the 25th to the last day of the month. Since the last day of April falls on a Saturday my debit order was supposed to be on 3 May - this was done via the TOBI WhatsApp robot. A Vodacom representative phoned me after making this arrangement and confirmed my debit order date. 4 May comes - no debit order went off. I phone and since I phoned 'after 12pm' the debit order can only go off on 5 May. 5 May comes - no debit order went off. I phone and since I phoned 'after 12pm' the debit order can only go off on 6 May. 6 May comes - I phone at 1pm as my debit order still did not go off, explain to the lady the whole history of the debit order and phoning Vodacom only to be told I had to make proper arrangements and if the debit order did not go through I will pay penalties!! And every time I phoned and had to go through the long pre-voice recording **** the system says my account is in arrears!!!! I have been with Vodacom for many many years but this is totally unacceptable. PATHETIC to be exact.", "suggestion": "Vodacom should ensure that customer requests, such as changing debit order dates, are properly processed and implemented. Additionally, the customer service representatives should be more knowledgeable and provide accurate information to customers."}, "meta": {"id": 3917219, "created_at": "2022-05-06 13:20:50", "review_rating": 1, "review_title": "PATHETIC service", "review_content": "I contacted Vodacom on 18 April to change my debit order date from the 25ht to the last day of the month. Since the last day of April falls on a Saturday my debit order was suppose to be 3 May - this was done via the TOBI WhatsApp robot. A Vodacom representative phoned me after making this arrangement and confirmed my debit order date. \n4 May comes - no debit order went off. I phone and since I phoned \"after 12pm\" the debit order can only go off 5 May. \n5 May comes - no debit order went off. I phone and since I phoned \"after 12pm\" the debit order can only go off 6 May.\n6 May comes - I phone 1pm as my debit order still did not go off, explain to the lady the whole history of the debit order and phoning Vodacom only to be told I had to make proper arrangements and if the debit order did not go through I will pay penalties!! \nAnd every time I phoned and had to go through the long pre-voice recording **** the system say my account is in arrears!!!! \nI have been with Vodacom for many many years but this is totally unacceptable. PATHETIC to be exact.", "business_slug": "vodacom"}}
