{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "", "service": "Telkom", "description": "Telkom leaves a bitter taste in my mouth. I've been a telkom customer for more than 3 years now with a Fibre line that I've recommended to about 20 of my friends and family, this year I decided that I'm going to take out not 1 but 2 iphone contracts with Telkom. In April 2022 I went and applied for the first contract. Filled in the exact same forms we filled in with the Fibre line application, we were approved for the application under a week, it's May 9th and my istore agent keeps phoning to update me telling me my contract is still pending. When I contacted telkom on their Twitter page they told me it been denied due to incorrect address information. Which is impossible as I applied with all my correct documents and it's the same address my Fibre line is linked to. They gave me a case number telling me my issue has been resolved but WHAT ISSUE??? Is my contract now approved??? No information what so ever from their chatbot. I was initially planning on taking out 5 contracts with telkom but if I cannot even see to the first one why would I go forward? Im contemplating taking myself as a customer completely away from telkom. I got a message that it's been resolved please tell me what this means my case number is 62967*** . When can I collet my iPhone from the istore??? Can I get a call for some clarification or atleast a discussion about the matter. I'm not going to reapply and start this process again because reading other reviews from telkom you will be double debiting me when you messed up a pending application", "suggestion": ""}, "meta": {"id": 3919083, "created_at": "2022-05-09 08:29:09", "review_rating": 1, "review_title": "Telkom leaves a bitter taste in my mouth", "review_content": "I am becoming a very disgusted telkom customer. I've been a telkom customer for more than 3 years now with a Fibre line that I've recommended to about 20 of my friends and family, this year I decided that I'm going to take out not 1 but 2 iphone contracts with Telkom. In April 2022 I went and applied for the first contract. Filled in the exact same forms we filled in with the Fibre line application, we were approved for the application under a week, it's May 9th and my istore agent keeps phoning to update me telling me my contract is still pending. When I contacted telkom on their Twitter page they told me it been denied due to incorrect address information. Which is impossible as I applied with all my correct documents and it's the same address my Fibre line is linked to. They gave me a case number telling me my issue has been resolved but WHAT ISSUE??? Is my contract now approved??? No information what so ever from their chatbot. I was initially planning on taking out 5 contracts with telkom but if I cannot even see to the first one why would I go forward? Im contemplating taking myself as a customer completely away from telkom. I got a message that it's been resolved please tell me what this means my case number is 62967*** . When can I collet my iPhone from the istore??? Can I get a call for some clarification or atleast a discussion about the matter. I'm not going to reapply and start this process again because reading other reviews from telkom you will be double debiting me when you messed up a pending application", "business_slug": "telkom"}}
