{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "No assistance from Vodacom. Went to shop in Cape Gate and they directed me to Customer Care. Called several times and could not get through. Emailed my question, no reply after a week. Tried the robot, no option for using roaming when overseas. Tried the live chat line and got Lindi Stembile Ndlovu who asked if she can assist. Gave through my question regarding roaming. After 20 min she still did not respond. Is this customer service. Where are moving towards if you can't get hold of anybody where in the past you would go into a shop and issue would be resolved or you could call and speak to somebody on the phone about your problem. I really don't know what to do next as I used all the platforms on Vodacom and cannot get hold of someone to activate my roaming before I go overseas????", "suggestion": "Vodacom should improve their customer service by ensuring that customers can easily reach a representative through various channels and receive timely responses to their queries. Additionally, they should update their chatbot to include an option for using roaming when overseas."}, "meta": {"id": 3920948, "created_at": "2022-05-10 10:00:58", "review_rating": 1, "review_title": "No Customer Care from Vodacom", "review_content": "No assistance from Vodacom. Went to shop in Cape Gate and they directed me to Customer Care. Called several times and could not get through. Emailed my question, no reply after a week. Tried the robot, no option for using roaming when overseas. Tried the live chat line and got Lindi Stembile Ndlovu who asked if she can assist. Gave through my question regarding roaming.  After 20 min she still did not respond. Is this customer service. Where are moving towards if you can't get hold of anybody where in the past you would go into a shop and issue would be resolved or you could call and speak to somebody on the phone about your problem. I really don't know what to do next as I used all the platforms on Vodacom and cannot get hold of someone to activate my roaming before I go overseas????", "business_slug": "vodacom"}}
