{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Poor Service", "service": "Vodacom", "description": "Extremely poor service from Vodacom on two occasions. My prepaid cellphone number was suddenly suspended and could not get assistance from vodacom customer care service and instore service. When one contacts Vodacom customer care number 135, call volumes are always high and Toby the robot is always available to assist, in which my case he was unable to assist. There is no way of speaking to a human except if you go to a vodacom store. I have been there three time to the Vodacom store with this issue and was told it will be resolved but yet still the same issue. I also previously bought a phone which was part of a promotion where one receives extra items like free data and minutes etc. That too was a hopeless case as I found myself constantly calling 135 for assistance or going in store but still those extra items I have not received. It the third month and all seems hopeless. If this is the treatment one receives from a popular cellular service, it is time to opt in to service providers who can fulfill their promises at all times", "suggestion": "Vodacom should improve their customer care service by reducing call volumes and providing better assistance. They should also ensure that promotions are properly fulfilled and customers receive the extra items promised."}, "meta": {"id": 3922660, "created_at": "2022-05-11 09:35:14", "review_rating": 1, "review_title": "Extremely poor service from Vodacom on two occasions.", "review_content": "My prepaid cellphone number was suddenly suspended and could not get assistance from vodacom customer care service and instore service. When one contacts Vodacom customer care number 135, call volumes are always high and Toby the robot is always available to assist, in which my case he was unable to assist. There is no way of speaking to a human except if you go to a vodacom store. I have been there three time to the Vodacom store with this issue and was told it will be resolved but yet still the same issue. \n\nI also previously bought a phone which was part of a promotion where one receives extra items like free data and minutes etc. That too was a hopeless case as I found myself constantly calling 135 for assistance or going in store but still those extra items I have not received. It the third month and all seems hopeless. \n\nIf this is the treatment one receives from a popular cellular service, it is time to opt in to service providers who can fulfill their promises at all times", "business_slug": "vodacom"}}
