{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Unethical Service", "service": "Vodacom", "description": "Unauthorized line activated on my name. Multiple mistakes made by Vodacom staff. Poor customer service and lack of communication. Unauthorized credit checks performed. Unauthorized debit order taken from my account. Threatening to cancel debit order and escalate complaint to NCR and telecommunications Ombudsman.", "suggestion": "Investigate the unauthorized line activation and credit checks. Provide a resolution for the customer's desired package. Improve customer service and communication. Refund the unauthorized debit order. Address the customer's concerns to prevent cancellation of the debit order."}, "meta": {"id": 3974262, "created_at": "2022-06-18 08:12:31", "review_rating": 1, "review_title": "UNETHICAL SERVICE CONTINUOUS LET DOWNS", "review_content": "Attention: Vodacom \n\nRe: Unauthorized line activated on my name.\n\nTo whom it may concern, \n\nOn Monday I saw an ad vodacom had a special. 2x iPhone 8 for R329pm. I called around your stores to see who had stock.\n\nYour store, Vodacom 4u Berea, East London told me they can do it on the same phone, however only the 256gb model as they did not have stock of the 64gb model on special. Melozan told me it will cost a bit more, I was happy with this. I gave her my ID number to see if I qualify. \n\nTuesday afternoon after various emails to your staff member, I went into the store to follow up. I was told only 1 has approved, the other is still in. I was a bit confused as I am aware of it only being 1 deal. Wednesday morning I got an email from vodacom with a quote on the package approved. I saw it was 1 phone and it was R299. This was not what I wanted. I then made a call to the store and spoke to Angus and he told me Melozan was on leave. I was a bit annoyed and asked what is going on, Angus asked for my details and he would call back (I'm still waiting) during this time I called online sales for the correct package to order online. I was told the following by your online sales.\n\n- the store had done 4 applications on me\n(I asked for 1, who gave permission to do 4?)\n\n- she told me 2 separate packages were put through and 1 was declined as they approved 1 and only 1 contract can be taken out at a time which confused me even more.\n\n- I was then told that the store had to reverse the activation before online can do anything. (This made me very cross that someone was activated on my name without my authority)\n\n- online told me the reversal is very quick and I can then call back to proceed.\n\nWhat a mission! Your store was not concerned about me and my request for the stuff up they made. I am now dealing with Angus as Melozan is off and Angus is ignoring me.\n\nSince then I have had many emails sent to your complaints (you keep emailing me to authenticate my account) which I do yet get no response. This is typical of vodacom. I have been speaking to comeone on your social media but feels like I am speaking to a robot because the same questions get asked and things get lost in translation. Still no phone call from anyone! Have even written on hello peter.\n\nThe same time I got notification that vodacom did 4 credit checks on me. Do you know 1 credit check alone drops an individuals score? Nevermind you did FOUR in 1 day without my permission!\n\nI then see a number that is not part of my numbers all of a sudden appear on my dashboard on the app. This must be the unauthorized line activated.\n\nEventually I got a sms yesterday that the activation was canceled. I gave the reference number to your robot on fb so they could proceed with the correct online double deal I wanted.\n\nI now get a msg saying I was declined recently, I can only try again in 6 months. How was I declined if we had to reverse an activated line? If there was any decline that is because your store messed up! \n\nWith all of this I had to do the running around. Your PATHETIC complaints team kept telling me to follow up with the store, the same store who was ignoring me.\n\nI wake up this morning and an unauthorized debit order has now been taken off my account..  who gave you this permission? I have reversed this debit as you cannot take money that does not belong to you. This reversal now costs money. Again still not a single thing on the package I requested.\n\n15 years of being a contract customer with vodacom. Not once have 1 ever missed a payment or chosen to leave, but I am now fed up with your service service actually how you don't care. You have done many things above without my authorization and against my will.\n\nI am escalating this to the NCR and the telecommunications Ombudsman and until then I will be sure to cancel my debit order with vodacom.", "business_slug": "vodacom"}}
