{"chatbot": {"related": 1, "evidence": "The complaint mentions a chatbot", "classification": "Customer dissatisfaction", "description": "The customer is complaining about the chatbot's role in changing their order and providing incorrect information", "suggestion": "Improve the chatbot's accuracy and ability to handle customer orders"}, "complaint": {"classification": "Service complaint", "service": "Vodacom online deals", "description": "The customer is complaining about Vodacom's online deals being misleading and their order being changed without confirmation", "suggestion": "Resolve the issue with the customer's order and improve the transparency and accuracy of online deals"}, "meta": {"id": 3979819, "created_at": "2022-06-22 14:12:16", "review_rating": 1, "review_title": "Vodacom online deals are a SCAM", "review_content": "This company may as well rename itself to Vodascam, or Voda****s, or something of that nature, because their ONLINE deals are not a reflection of their actual contract prices. Their stupid robot changed the order I made for my wife's phone the next morning, adding a whopping R120 to the monthly bill for exactly the same thing. We thought this was erroneous, so we ignored the SMS. We did not confirm it, but they shipped the order anyway. Then they shipped it to the wrong address. They refused to accept a third party delivery (a.k.a. Me, because my wife cannot receive deliveries during the day), even though my work address was already verified under her account as a 3rd party. This meant that we never even got the phone after a month of waiting. They wasted everyone's time, including the courier (RAM) who went to the same old address where she no longer lives, about 5 times. Upon phoning the after-sales number we got from a Vodacom shop employee, they told me she could change the delivery address over the phone, so I relayed this to my wife and told her to phone them. Then they told her that they can't. That's the point when they also told her that the contract we bought does not allow Top-Ups and is actually R419/pm instead of R299/pm as per the \"online exclusive\" - and that they will change out-of-bundle rates for going over 500MB/month, which is NOT WHAT A TOP-UP CONTRACT IS. But they defended themselves, because if you go onto their website, their description of top-up and normal contracts are exactly the same. Top-up now also bills you after you use your data. This company is scamming people with misleading advertising and wording and a stupid ****ing robot that is utterly useless. It's swallowed my airtime before expiry multiple times before, but that's another issue entirely.", "business_slug": "vodacom"}}
