{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "The customer is complaining about the lack of support and difficulty in reaching a human representative. They also mention that their prepaid sim card is not working in their tracking device and the operator is unable to provide the necessary information.", "suggestion": "Vodacom should improve their customer service by ensuring that customers have access to a human representative for support. They should also address the issue with the prepaid sim card not working in the tracking device and provide the necessary information to the customer."}, "meta": {"id": 3980949, "created_at": "2022-06-23 10:34:36", "review_rating": 1, "review_title": "Vodacom customer NOT care number", "review_content": "I wonder if the mighty Vodacom even has someone that watches complaints on forums. You certainly have no way of complaining to someone that can do something about it. Anyway here my complaint sent to them. It is self explanatory.\n\nDear Vodacom......I do not even know why I am bothering with this email as it will probably be swept under the rug like everything else.\n\nI tried your so called “CUSTOMER DON'T CARE” number but it sends me to a BOT (because everyone is busy) that just goes round in circles seeing as the correct “CHOICE” is not available.\nI tried the BOT on the internet BUT it gets stuck and tells me to call “CUSTOMER DON'T CARE” number. Another circle.\nClicking on “frequently asked questions” has no reaction on your site.\nI few days ago I got through to a HUMAN (Imagine that)…..but, alas, they were clueless and I got the wrong info.\n\nIs Vodacom now also being managed by the government?\nIs there NO way one can complain about rubbish service?\n\nTo make it worse the question is not even difficult.\n\nI purchased a prepaid sim.\nIt does not work in my tracking device. \n\nUpon getting support from the manufacturer they tell me to:\n\"Please ask the operator what the APN of the new SIM card is, and the user name and password of the APN”\nNow that seems a reasonable request…..except that my OPERATOR is clueless.\n\nSo here goes. An email that will probably not be answered or sent from pillar to post.", "business_slug": "vodacom"}}
