{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Cancellation", "service": "Telkom.co.za", "description": "Telkom Services came around each household explaining their product and services. I signed up as a happy customer and they installed the fiber. However, I am not happy with the poor and low-quality services they provide. I have tried contacting their customer service but have not received any assistance. I have also tried canceling the services online and through email, but have not been successful. I am paying for a service that I am not happy with and I deserve better customer care and service delivery.", "suggestion": "I request that Telkom improves their customer service and provides a higher standard of service delivery. They should respond to customer queries and assist with cancellation requests promptly."}, "meta": {"id": 3983959, "created_at": "2022-06-25 18:40:38", "review_rating": 1, "review_title": "Telkom.co.za/ Cancellation services / ***********", "review_content": "Telkom Services came around each household explaining there product and services. Which i have signed as a happy customer and thereafter they came to install the fibre, as a Customer I am not happy with such a poor and low services they provide. I am the customer and I have all the rights as a customer I am paying money for telkom fibre services and in return customers should be satisfied with services in great high standard  not such poor service delivery. I call in as per the numbers on the invoice which is as follows\n 10210 most of my airtime got went as I waited for a long period of time on the line to speak to someone in the customer service center which couldn't even assist me waited and wasted my time and airtime be it as it may they advised me to call 10213 and press option 2 which I was in the incorrect option to the wrong department unfortunately they weren't able to assist but advised that I should go online to do it which I further advised that I did do so but I am unsuccessful as it wasn't allowing me to cancel my services with telkom after that I must call again 10213 and press option 5 which is the cancelation option as a customer looking for a way forward did do so. OPTION 5 advised that I should go online and do the cancellation services according to the robot over the phone, no physical person spoke to me . I tried it again was no success I have tried an alternative technique of emailing Telkom fibre broadband Services on the following address; *********** my first attempt was on the 24 April 2022 ref: ********** explaining the situation in this email and on another attempt which would be on the 3 May 2022 ref: ********** in all methods and attempts have recieved no call level of service or a response or  assistance till date. I really do regret as Customer to why did I go for this service very dissassifying. I cannot pay for a service that I am not happy hence its my money I am paying so I do deserve a good customer care service and a high standard of delivery as I am the Customer. This service is not coming free to do as your please with customers I am paying for it and should be galdy satisfied as a paying customer bear that in mind. I do not know the way forward as a customer we are already and June and my money is going to a service I don't need according to my explained email on on above mentioned dates. This is not  right and fair to me as a customer. This service don't even deserve one star. Very disappointing..... with such a service. VERY UNHAPPY to such services in my life. Honestly......", "business_slug": "telkom"}}
