{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "MTN Online Upgrade", "description": "My husband did an Online upgrade on 24 May but we heard nothing further. We logged a call with Customer Care on 4 June and received an SMS stating that the handsets were reserved but awaiting approval of the contract. We heard nothing further and received a notification SMS on an unspecified date stating that the order had failed. We have no explanation for this. We spent 5.5 hours on various calls with MTN, DSV, and Mondo on 17 June but no one was able to help us. We were given conflicting information and were told that Online Upgrades don't have a department. Finally, we got someone willing to help and a new upgrade was done over the phone. We were told that the credit check would take 3 days and then the handsets would be delivered in 7-10 working days. However, after waiting for a week and a half, we were told by a representative from Mondo that we needed to go in-store to change our physical address as our Gauteng address was still on the system. We went to a store and changed our address, but when they tried to do the upgrade, it said that there were handsets out on delivery. We called DSV, but they had no record of any packages for us. We have made numerous calls and logged tickets, but have not received any help or resolution. We have now decided to cancel our whole contract.", "suggestion": "Please provide a clear explanation for the failed order and the conflicting information provided by your representatives. Improve communication between departments to ensure a smooth and efficient upgrade process. Train your customer service representatives to provide accurate and helpful information. Ensure that the delivery process is properly coordinated with DSV to avoid any further issues. Provide better support and assistance to customers who are experiencing difficulties with their upgrades or orders."}, "meta": {"id": 3992752, "created_at": "2022-07-01 23:24:52", "review_rating": 1, "review_title": "MTN Online Upgrade- don't do it!!", "review_content": "My husband did an Online upgrade on 24 May\n\nWe heard nothing further\n\nOn 4 June I logged a call with Customer Care\nThey sent an SMS to my husband,  The handsets were reserved but that they were awaiting approval of the contract (I assume my credit check?)\n\nWe heard nothing further\n\n On the 10, 16 and 17 June I sent follow-up replies on my ticket \n\nAt some point we received a notification sms advising that the order had failed \n\nHave no clue what it means, no explanation, nothing!\n\nOn 17 June I spent 5.5 hours on various calls with MTN, DSV and Mondo\nI was pushed from one call centre to the next and back again with no-one able to help me\nI was told Online Upgrades don't have a department and that I needed to wait for the phones to come and then send them back and cancel and redo the transaction with a real person\nI was told to go to retentions and cancel the upgrade\nI was told that the handsets were with DSV and I must contact them\nI was told its an online upgrade and no-one can cancel or help me\n\nFinally I got someone willing to help. She did a whole new upgrade on the phone with me and said that the credit check would take 3 days and then the handsets would go out on delivery, altogether about 7-10 working days\n\n Waited a week and a half and followed -up and called MTN and Mondo and no-one knows this lady, but I was helped by a lady called Amanda from Mondo who said I needed to go in-store to change my physical address as my Gauteng address was still on the system and that's why they have been unable to deliver the handsets\n\nI went into a store and changed my address. They offered to do the upgrade instore but when they went online the account is not available for upgrade as it says there are handsets out on delivery\n\nOnce they changed the address I called DSV (cause the system says the handsets are out on delivery right!), so DSV take my ID and say they have nothing from Mondo or MTN for me\n\nI called Mondo back and was given a different DSV number and 2 reference numbers (these are the same reference numbers that 'fsiled' No surprise there, they have  no reference numbers like that and no parcels from MTN or Mondo under my ID number\n\nI called Mondo back again and spoke to a friendly gent named Albertus who was going to send an email to DSV with the phone references and my correct address so that they could deliver the phones\n\nJust before closing I thought I'd better give them a call to see that they received the Email and that they would be organising the delivery of the handsets (because they have been reserved you know, and I can't upgrade instore because the handsets are \"out on delivery\"). Shockingly DSV still had no knowledge of any packages for me under my ID number\n\nI've logged tickets, made hundreds of calls and spoke to a delightful bot on Mondos completely useless Whatsapp system who told me that Mondos didn't do the upgrade but SADMIN did it. I've Googled SADMIN, they don't seem to exist. Who is SADMIN!!\n\nI went in store to speak to a flesh and blood person who also was unable to help me \n\nI have now decided to cancel my whole contract not just the upgrade. I called 135 3 times this afternoon \nI'm on hold for over 18 minutes each time and then promptly cut off\n\nIf anyone at MTN ever bothers to read this, a little help would be appreciated", "business_slug": "mtn"}}
