{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Rain", "description": "At this point I am livid and shook by the level not being bothered I have received from Rain, 1st of all someone out in their company decided to cancel my subscription unprovoked and that on its own is a big concern because it means that someone might have my informed I mean how else would have they have just canceled my services without me authorizing it .Let's get to the 2nd point I have now been calling their call center which has proved to be even more useless they all sound like they are robots \"we have escalated the matter to our billing team\" is the only resolution they could come up with and not even one of them Has bothered to call me back to advise on the progress of the issue as I have requested. It's almost a week now with no connection and the service provider seems to be non existing to give me answers,I want to know who requested my service to be canceled and if they're still interested in reinstating my service, if not can they say so ,so that I can find another provider that knows what customer service is.", "suggestion": "Investigate the unauthorized cancellation of the subscription and provide a clear explanation to the customer. Improve communication with the customer by providing regular updates on the progress of the issue. Reinstate the customer's service if requested or provide a clear explanation if the service cannot be reinstated."}, "meta": {"id": 4025131, "created_at": "2022-07-27 06:45:13", "review_rating": 1, "review_title": "Pathetic Customer Service", "review_content": "At this point I am livid and shook by the level  not being bothered  I have received from Rain, 1st of all someone out in their company decided to cancel my subscription unprovoked and that on its own is a big concern because it means that someone might have my informed I mean how else would have they have just canceled my services without me authorizing it .Let's get to the 2nd point I have now been calling their call center which has proved to be even more useless they all sound like they are robots \"we have escalated the matter to our billing team\" is the only resolution they could come up with and not even one of them Has bothered to call me back to advise on the progress of the issue as I have requested. It's almost a week now with no connection and  the service provider seems to be non existing to give me answers,I want to know who requested my service to be canceled and if they're  still intrested in reinstating my service, if not can they say so ,so that I can find another provider that knows what customer service is.", "business_slug": "rain-internet-service-provider"}}
