{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Billing", "service": "Telkom", "description": "Telkom scam former clients when the contract has ended and cancellation was requested. The customer received an invoice for multiple R99 charges despite terminating the contract at 24 months and not agreeing to R99 monthly instalments. The customer also informed Telkom via email about the contract termination. Telkom continued to access the customer's bank account and debited unauthorized amounts. Telkom is not responding to emails and their chatbot named Karabo does not address the customer's queries.", "suggestion": "Telkom should investigate the unauthorized charges, refund the customer for the debited amounts, and ensure that the customer's contract termination is properly processed. Telkom should improve their customer service by promptly responding to emails and ensuring that their chatbot is capable of addressing customer queries effectively."}, "meta": {"id": 4034958, "created_at": "2022-08-02 19:13:47", "review_rating": 1, "review_title": "Telkom scam former clients when the contract has ended and cancellation was requested", "review_content": "The below email was sent to Telkom on the 14th of June on the social media account and was never attended.\nI have used all mediums to try to get this Telkom scamming to stop accessing my Bank account\n\n\nAttention Telkom\n\nI have received an invoice you sent on 6/06/2022. Find the invoice below attached. Telkom Modurm no: **********\n \nThe invoice states that I owe you multiple R99.\n \n1. I told your consultants on multiple calls that I would not be upgrading the account. I am terminating the contract. I instructed them to terminate my contract at 24 months. \n \n2. I have never agreed to R99 monthly instalments. The previous contract that reached its termination period was R139  monthly. I did not give you the authority to deduct any other amounts from my account. Therefore this is a criminal act. \n \n3. Upon the end of the contract I also email you to inform you that I am terminating my contract. So not only did I inform your sales consultants who were trying to upgrade my contract but I also emailed you.  I did not sign a contract that was beyond  24 months. \n \n4.  Since you continued to access my account against my wish I then disputed the debit order as unauthorized, as is the case. \n  5: In June  debit my account R499\n6: July debited my account R539\n\nWhat business do you have with accessing my account when I do not have a contract with you Telkom? \nI use prepaid data and I have never asked for or requested your data post the end of the contract.\nTelkom is not responding to emails, clearly not applying my request on call when they were trying to upgrade you. On Social media, they use a Robot named Karabo which does not address my queries because it is pre-programmed.\n\nThis is my last email to you. I will not pay any cent that I did not use not authorize. I will also share this email with the consumer protection office since you have started sending SMSes demanding payments and making suggestions.", "business_slug": "telkom"}}
