{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Billing", "service": "Internet Service", "description": "Canceled service but still being charged. Poor customer service and policies.", "suggestion": "Resolve the billing issue and improve customer service and policies."}, "meta": {"id": 4035657, "created_at": "2022-08-03 10:38:06", "review_rating": 1, "review_title": "Bad all round", "review_content": "Unfortunately there's no option to give this place 0 stars because that's what I think they need.\nI had the service in Cape Town and had no issues with the internet, the problems came when I canceled my service and still being charged, I canceled back in April but was charged in May because of data being used the first few days and then nothing ever again but then charged in June as well. I call them up and they tell me that you are charged in advance. I canceled the service but still being charged. Your company's customer service is horrific and your policies are worse. I have all the evidence to prove this but I unfortunately can't attach that here. I will make sure to stay away from you people going forward, your advertising has people all giddy but once you have them pulled in you just leave a bad taste in their mouths.\n\nAnd Rain, please I don't want your bull**** robotic response, it shows how much you care (which is 0 in my book) . Generic responses doesn't do it. Every situation is different so you need to speak about that and not make as if we are all the same so please don't send me the below **** response:\n\nWe're really sorry your rain experience hasn't been as good as you expected.\n \nWe're going to get on this asap.\n \nThank you,\n\nBut wait you probably are or you'll ignore me.\n\nDon't respond, get someone to call and give my money back. You have 72 hours or I'll be moving on to social media.\nWord of advice. Bad news travels faster than good news.", "business_slug": "rain-internet-service-provider"}}
