{"chatbot": {"related": 1, "evidence": "The complaint mentions receiving calls from a BOT.", "classification": "Harassment", "description": "The customer is complaining about receiving calls from a BOT, which they find annoying and consider harassment.", "suggestion": "Improve the chatbot system to avoid simultaneous calls to all customer lines and ensure a better customer experience."}, "complaint": {"classification": "Billing", "service": "Vodacom", "description": "The customer is complaining about being contacted by a BOT for an outstanding payment of R100.88, even though they made the payment via EFT and their account is up to date.", "suggestion": "Update the customer's account with the correct balances and ensure fair business practices by not charging additional fees for payments made via EFT."}, "meta": {"id": 4044267, "created_at": "2022-08-10 13:13:43", "review_rating": 1, "review_title": "Unsatisfied Loyal Customer", "review_content": "Good day,\n\nI have a problem, which I believe should not be a problem - You went to my personal banking account for the monthly debit order, and there was no money on the account, though there was no money on the account however I managed to make the payment via EFT for the outstanding balance, and right now I have been receiving calls from a BOT which is threatening to suspend my line if I don't pay R100,88 - VODACOM LAST I CHECKED, I HAVE MULTIPLE WAYS OF MAKING MY MONTHLY PAYMENTS WHICH INCLUDE EFT, DEBIT ORDER ETC, and my contract is up to date with the payments, can someone explain to me why I'm now receiving calls from BOT stating that my account is in arrears? can someone explain to me when did I agree with VODACOM that they can charge me R100,88 if there's no money in my banking account? MY ACCOUNT IS UP TO DATE I DON'T OWE YOU ANYTHING - except the monthly instalment of August 2022. Again I will not have money on the 22 August 2022, however I will make a payment via EFT does this mean that you will charge me R100,88 say that my account is in arrears?\n\nWhich product am I paying for that I took with Vodacom for R100,88 or are you just  exploiting your customers for more money and justify it by saying that we didn't find money into your account on the debit order date.\n\nPlease update my account with the correct balances - I don't owe you that money. Let's practice fair business - I made the payment, whether it's via EFT or debit order - payment was made.\n\nOne more thing the BOT is very annoying, it calls all lines you have with VODACOM simultaneously and from my side that's harassment.", "business_slug": "vodacom"}}
