{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Billing", "service": "Vodacom", "description": "I've been having a problem with Vodacom ever since last year 2021 May. They called me and offered a new contract, I declined but they opened it anyway. Ever since then, my monthly billings went high but I kept paying my usual amount. Calling Vodacom to resolve my issue became messy as their people had no solution and ran me from one department to the other. They told me they cancelled the unauthorized contract but the billing continued. Matters got worse when I lost three of my phones and my account was in arrears. The insurance could not pay before I cleared my account. I explained my issue to Vodacom but they said the insurance is not theirs, it's a third party. I paid the money and cleared my debt, but the billing started accumulating again and their irritating daily robot calls escalated. I'm so disappointed with Vodacom.", "suggestion": "Vodacom should improve their billing system and customer service to resolve these issues."}, "meta": {"id": 4078985, "created_at": "2022-09-04 04:09:56", "review_rating": 1, "review_title": "Vodacom can scam you", "review_content": "I've been having a problem with vodacom ever since last year 2021 May, they called me and offered a new contract, I declined but they opened it any way and ever since then my monthly billings went high but I kept paying my monthly usual amount  and calling vodacom to resolve my issue became a messy one because some, if not most of the times, their people had no solution and they ran me from one department to the other and told me they cancelled the unauthorised contract but the billing continued.  Matters got worse when I lost three of my phones where my account was in arrears by R3000 and the insurance could not pay before I cleared my account, well I went back to vodacom explained my issue but it didn't help because they said the insurance is not theirs, it's the third party. Fine, I paid the money and cleared my debt, and continued to pay my monthly fee however it started again to accumulate bit by bit and their irritating daily robot calls escalated.  I'm so disappointed at vodacom is not funny. \nThey blocked some of my numbers that in order to make them work again I have to pay the accumulated R2000.", "business_slug": "vodacom"}}
