{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Service", "service": "Wifi", "description": "Worst service! Absolute the worst service provider I have dealt with. I have spoken to a consultant to cancel my Wifi contract on the 1st of August, however he said he will provide a reference. Before I could get a reference, it took me to a survey. Afterwards, I sent an email stating the above. I then called on the 1st of Sept after my account was debited again, after the gentleman confirmed that it would not be debited at the end of the month. I spoke to another lady and she advised no note was made. It is not fair towards the client to be penalized for incompetencies of consultants. Afterwards, I sent an email to *********** an email address a lady called Nelsie provided 7 mails later and still not even an acknowledgment. I need to get this sorted, as I will not be paying anymore fees towards this as my contract has ended.", "suggestion": "Resolve the issue by refunding any unauthorized charges and providing a reference for the cancellation of the Wifi contract."}, "meta": {"id": 4082774, "created_at": "2022-09-06 19:29:19", "review_rating": 1, "review_title": "Worst service !", "review_content": "Absolute the worst service provider i have dealt with .\n\n \nI have spoken to a consultant to cancel my Wifi contract on the 1st of August, however he said he will provide a reference.\n \nBefore I could get a reference, it took me to a survey. Afterwards i sent an email stating the above\n \nI then called on the 1st if Sept after My account was debited again , after the gentleman confirmed that it would not be debited at the end of the month. I spoke to another lady and she advised no note was made.\n \nIt is not fair towards the client to be penalized for in competencies of consultants.\n\nAfterwards i sent an email to *********** an email address a lady called Nelsie provided 7 mails later and still not even an acknowledgment.\n \nI need to get this sorted , as i will bot be paying anymore fees towards this as my contract has ended.", "business_slug": "telkom"}}
