{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Cell C", "description": "Cell C has poor customer service. The customer has experienced issues with data depletion and lack of response to a request for contract cancellation after the customer's mother passed away.", "suggestion": "Improve customer service by training agents to listen to customer concerns, provide accurate information, and resolve issues promptly. Address the data depletion issue and ensure that cases are resolved within the promised timeframe."}, "meta": {"id": 4102856, "created_at": "2022-09-22 09:13:21", "review_rating": 1, "review_title": "Good products, the worst customer service", "review_content": "Cell C is by far one of the worst companies I have experienced with regard to customer service.  I have been a customer of theirs for far too long and it is something I am regretting.  It is a pity because some of their offerings are attractive but good luck if something goes wrong.\n\nMany of their customer service agents stick to reading their scripts like robots and don't have the insight to listen to what is being said.\n\nIn the most recent incident, in preparation to conduct business during load shedding, I purchased a 2GB daytime data for 7 days bundle.  I also have more than sufficient night time data available,  On Tuesday morning when I woke up I was greeted with a message that my data balance was 0.  I contacted Cell C customer care and they had me believe that something on my phone had used my data from 6am onwards.... even though my phone was on wifi and my personal hotspot switched off.  I then bought an additional 2GB of data to get me through the day's loadshedding.  I also restarted my phone.  My data was again depleted when I checked at around 10am.  Again I contacted customer care and another robotic employee told me I didnt pass the security questions even though I answered all correctly.  I asked to speak to a supervisor and was told I cannot because I didn't pass the security questions.  A subsequent helpful agent looked into the data and also admitted something odd was going on and that it was impossible for me to have used all that data in the short space of time she could see on her system.  She informed me that a case was opened and told me that I would receive feedback within 2 working days.  I explained the urgency of this needing to be corrected as it would also be futile to purchase more data if it just depletes within minutes.\nWithout hearing from anyone that day, I decided to switch my mobile data completely off before going to bed.  The next morning, my 2 GB allocation was again depleted.  Again I contacted customer care and again explained the urgency.  Again the case was 'edged' or flagged for attention.  Again nobody contacted me.  It is now the 3rd day and no surprise, my 2GB daily allocated data is depleted and also no surprise the case is still not resolved.\n\nThis type of customer service opened up another wound I have with Cell C.  In 2020 my mother, who's Cell C contract I was paying passed away.  I sent an email to *********** on 16/11/2020 providing a copy of her ID and death certificate and requesting her contract to be cancelled.  After no response and calling the dreaded customer care I was provided with an email address *********** and advised to also state that I am the next of kin.  I did that and no surprise, was no response ... and the debit orders continued to go off my bank account,  I cannot even tell you how many hours of calls I made to customer care ... and experiencing the same promises of being contacted within 2 days which never materialized.  As the debit orders continued to be debited I decided to reverse the last few I could, all the while phoning and phoning customer care.  I was eventually provided with another email address, ***********.  When emailing that email it returned with an error that the mailbox was full.  I sent an email to all addresses providing them with a letter of executorship and requesting re-imbur*****t for the moneys debited out of my account since first providing proof to them of my mother's death.  To date they have not bothered to pay me back a cent although it seems they did eventually close down the account.", "business_slug": "cell-c"}}
