{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "I have never dealt with such incompetent people as the customer care at vodacom, it is a joke. I have not been able to phone out since Tuesday last week (20/09/2021) as vodacom keeps telling me I do not have enough airtime?? I have loaded up to R160.00 since and get the same results. After spending 2 days and more than 7 hours on the phone, dealing with robots and people that should not be holding their positions. I am still in the same boat. I lost it on friday and appoligise for my swearing when I was told that they have only put in a request for technical assistance for data and not the phone issue even though I phoned and spoke to different people about this issue. As a pensioner I get jobs very seldom and need to deal with clients for equipment requirements, I am lucky to get jobs in future due to not been not able to use my phone. Vodacom you can keep the R160.00 rand airtime that I kept on loading without one phone call as I want nothing further to do with your company and once my data sim is used up, I am also changing that over to MTN starting today with my phone as I am waiting for them to transfer my number over, which should be in the next hour.", "suggestion": "Vodacom should improve their customer care service and ensure that technical issues are addressed promptly to avoid inconveniencing customers."}, "meta": {"id": 4105711, "created_at": "2022-09-24 11:16:41", "review_rating": 1, "review_title": "Vodacom Customer Care a Joke.", "review_content": "I have never dealt with such incompetent people as the customer care at vodacom, it is a joke. I have not been able to phone out since Tuesday last week (20/09/2021) as vodacom keeps telling me I do not have enough airtime?? I have loaded up to R160.00 since and get the same results.\nAfter spending 2 days  and more than 7 hours on the phone, dealing with robots and people that should not be holding their positions.  I am still in the same boat. \n \nI lost it on friday and appoligise for my swearing when I was told that they have only put in a request for technical assistance for data and not the phone issue even though I phoned and spoke to different people about this issue.\nAs a pensioner I get jobs very seldom and need to deal with clients for equipment requirements, I am lucky to get jobs in future due to not been not able to use my phone. Vodacom you can keep the R160.00 rand airtime that I kept on loading without one phone call as I want nothing further to do with your company and once my data sim is used up, I am also changing that over to MTN starting today with my phone as I am waiting for them to transfer my number over, which should be in the next hour.", "business_slug": "vodacom"}}
