{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Poor Customer Service", "service": "Vodacom", "description": "Vodacom failed by suspending my number without notice and no one can sort it out. I have been without service for the last 4 days, which is very challenging for me as I work remotely while traveling. I have contacted the call centers and visited Vodacom shops multiple times, but no one can resolve the issue. Vodacom's lack of communication, poor mobile app, unresponsive bot, and absence of an escalation service are all contributing to the poor customer service experience.", "suggestion": "Vodacom should improve their communication with customers by providing notice before suspending a service/line. They should also enhance their mobile app to make it more functional and address the issues with their bot. Additionally, Vodacom should establish an escalation service to handle customer complaints more effectively."}, "meta": {"id": 4121013, "created_at": "2022-10-05 15:28:39", "review_rating": 1, "review_title": "Vodacom fail by suspending my number without notice and no one can sort it out", "review_content": "Eish Vodacom. You have failed me dismally after being a loyal customer for 26 Years (and paying top VIP Red price for most of this time). My phone has been stolen and albeit me reporting this the morning after to obtain the ITC number, there was still fraudulent transactions happening on the old Sim card. \nWhen I phoned accounts, they said I must wait for the month end run before I could lodge a query on the account. Now working with the different call centers and loosing valuable billable time I've decided to take the knock. \nA good 6 weeks later you decide without notice to Suspend my number. No sms, no call, no emial, just suspend the account. \nI have been without service for the last 4 days, and working remotely whilst travelling is to say the least very challenging, try that without your old trustworthily network.   \nI've been calling the call canters, made 3 visits to Vodacom shops and the funny thing is, the helpful people at the shops can't even sort out the issue, since there is no answer at the fraud line. \nHow can you operate like this? Vodacom it is clear you are not interested in Customer Service at all:\n- No communication to loyal customers (or any customer for that matter)when you are disabling a service/line\n- extremely poor mobile app. Even the consultants at the shops complain about the inability to basically to anything on the app\n- your bot is hanging when I try to interact with the same\n- no escalation service. \nCan you please get your house in order, spend a little less on marketing and bring your systems processes and client service to a level that one expect of a group like yourselves. \nI've cried and screamed at your poor call Centre agents and shop assistants, but they are just as lost as me in your not serving corporate broken structures and systems.\nAt this stage I think the South African Police service gives better service than Vodacom.", "business_slug": "vodacom"}}
