{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Billing", "service": "Vodamail", "description": "Vodamail service was changed without consent and deductions are being made from airtime without authorization", "suggestion": "Investigate the unauthorized deductions and provide a refund to the customer"}, "meta": {"id": 4150251, "created_at": "2022-10-26 15:31:59", "review_rating": 1, "review_title": "Vodamail Vodacom grabs your airtime? - SHAME ON YOU!!", "review_content": "Vodamail has been available to Vodacom customers for many years as part of the service & at no charge to users. Some months ago SMS's were sent to customers to opt in subscribing to some premium Vodamail service at R29/month. Then Vodacom changed the service (seemingly) to some web based email service and one could no longer log into Vodamail web page - downgrading the service in effect. Eventually the SMS said \"if you don't opt out by return SMS the R29/month would be deducted off airtime\". I opted out as I do not need any premium Vodamail account, yet I have been using my Vodamail email for many years. Somehow I am paying for the service anyway. Since yesterday (and again today) I've received SMS's from a Vodacom SMS service (which you can not respond to) saying \"to keep your Vodamail service active, please ensure that you have an airtime balance of R29,00 between 25-30 October 2022\". At no point in time have I agreed to this deduction and can't call the Vodacom \"customer care\" center as the call is diverted to some robotic AI gimmick which is totally useless. There is no option to resolve a matter with a staff member! REALLY???? How is this kind of \"corporate mafia bullying\" of clients who have been dealing with Vodacom for more than 15 years allowed by law? It simply is (borderline) fraudulent tactical games to deduct any amount off a pre-paid balance without explicit authorization!!! The amount is irrelevant - it is the basic principle of integrity vs greed.", "business_slug": "vodacom"}}
