{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Network", "service": "Vodacom", "description": "Network outage in Kibler Park, JHB South. When you eventually manage to get through to someone on 082 135 number, all they can do is log a service request for Monday. This will take up to 5 days to resolve. There are no technicians available to resolve it sooner. This is despite Vodacom and competitors tariffs being higher than most countries in Africa; and the record profits you are raking in. As you are fully aware, people are still working from home and require an adequate network in order to do their jobs. Problem is, even your competitors have similar, poor service...South African endemic, I suppose? You also need to upgrade the Vodacom app by creating other options to log issues: How can you report a network outage by calling the Customer Support number when there is no network? You can't use your self help bot Tobi, because it sends an sms. How can you get an sms when there is no network? Your whatsapp service has no option for logging network outages?", "suggestion": "Improve network reliability and response time for resolving outages. Provide alternative methods for reporting network outages, such as through the Vodacom app or via WhatsApp."}, "meta": {"id": 4154347, "created_at": "2022-10-29 12:04:37", "review_rating": 1, "review_title": "Vodacom outages", "review_content": "Network outage in Kibler Park, JHB South.\n\nWhen you eventually manage to get through to someone on 082 135 number, all they can do is log a service request for Monday. This will take up to 5 days to resolve. There are no technicians available to resolve it sooner. This is despite Vodacom and competitors tariffs being higher than most countries in Africa; and the record profits you are raking in.\n\nAs you are fully aware, people are still working from home and require an adequate network in order to do their jobs. \n\nProblem is, even your competitors have similar, poor service...South African endemic, I suppose?\n\nYou also need to upgrade the Vodacom app by creating other options to log issues:\n\nHow can you report a network outage by calling the Customer Support number when there is no network? \n\nYou can't use your self help bot Tobi, because it sends an sms. How can you get an sms when there is no network? \n\nYour whatsapp service has no option for logging network outages?", "business_slug": "vodacom"}}
