{"chatbot": {"related": 1, "evidence": "The complaint mentions a rude chatbot that cuts the call and refuses to let the customer speak to a human.", "classification": "Customer service", "description": "The customer is complaining about not being able to contact customer care due to a rude chatbot on WhatsApp.", "suggestion": "Improve the chatbot's behavior and allow customers to easily reach a human representative."}, "complaint": {"classification": "Connectivity", "service": "Telkom", "description": "The customer is experiencing connectivity issues after a power outage and is unable to reach the technical department due to the chatbot redirecting their calls.", "suggestion": "Provide an alternative phone number for contacting the technical department and improve the call routing system to ensure customers can reach the appropriate department."}, "meta": {"id": 4217615, "created_at": "2022-12-08 14:08:26", "review_rating": 1, "review_title": "can't contact customer care as rude chat bot WhatsApp overlord won't let me speak to a human and just cuts my call.", "review_content": "my connectivity issues mostly started about 3 days ago with a storm that cut power to my area for 26 hours. since then, I've had constant disconnects (I have full coverage and can make and receive phone calls but absolutely no internet connectivity) I have this problem with all my 4G devices so it's definitely the tower, can i please speak to the technician about my connectivity issues  \n\nneed help with a problem with internet connectivity but phoning Telkom customer care just sends me a WhatsApp link and cuts the call (which is very rude). so, I have to try a random combination of numbers to eventually speak to someone, but I can't reach the technical department after multiple attempts and call redirects by other Telkom agents. they just redirect my call to the useless rude chatbot that tells me to use WhatsApp and cuts my call. \n\ncan i please have another phone number to contact technical? and another phone number in general to contact customer care as 081180 and 180 and 10210 dont work as it just takes me to the rude chat bot that is religiously obsessed with WhatsApp that always cuts my call, refuses to let me speak to an agent, have no idea if its holding hostages but I'm very suspicious that it won't let me talk to someone to make sure your Telkom agents are still alive. I've confirmed that only your people at retentions and accounts are alive as i spoke to them, but they just redirected me to the Telkom chat bot WhatsApp overlord that cuts my calls and won't let me speak to its hostages", "business_slug": "telkom"}}
