{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Poor Service", "service": "Rain internet service provider", "description": "Unprofessional, incompetent, dishonest, disrespectful and flippant - these are just a few terms that describe this internet provider called \"Rain\". I cancelled my account with them, but they kept forcing their product on me and taking my money out of my account for almost a year, all for me to have to endure more and more of their ridiculously terrible service. The connection was bad most of the time, I sounded like a robot in work meetings (when the internet was actually working). I had to constantly buy data and hotspot using my cell phone for reliable internet. Why was I being forced to pay Rain R699 every month? After having to repeat the same thing over and over (several hours and money wasted) to get someone to take my request for account cancellation seriously, it all became a circus again. On 25 November 2022, they debited my account after telling me explicitly that no more debits will be made. When I finally reached someone about this, they specifically said that I will get a refund in 7 - 10 working days. I never got my money. After waiting about 12 working days for my refund, I called them and was told that someone from Billing would call me back. No one called. All I received was an email saying that they don't owe me money and that I owed them money. Plus, I received an sms saying that my account will be debited early for December 2022. Which account? The one I requested that they close in February 2022? This company has caused me extreme stress and anxiety, I'm actually traumatised by this ongoing experience. They seem hell-bent on not giving me my refund, and trying to take even more money from my bank account for no service delivered. I cannot believe that a company like Rain is actually allowed to operate - they do not treat their customers fairly. Even though it can never take away the suffering this company has caused me, I just want my refund and for them to never touch a cent of mine ever again.", "suggestion": "Provide a prompt refund to the customer and improve customer service to prevent similar issues in the future."}, "meta": {"id": 4220519, "created_at": "2022-12-10 19:41:16", "review_rating": 1, "review_title": "Rain internet service provider - extremely poor service", "review_content": "Unprofessional, incompetent, dishonest, disrespectful and flippant - these are just a few terms that describe this internet provider called \"Rain\". \n\nI cancelled my account with them, but they kept forcing their product on me and taking my money out of my account for almost a year, all for me to have to endure more and more of their ridiculously terrible service. \n\nThe connection was bad most of the time, I sounded like a robot in work meetings (when the internet was actually working). I had to constantly buy data and hotspot using my cell phone for reliable internet. Why was I being forced to pay Rain R699 every month?\n\nAfter having to repeat the same thing over and over (several hours and money wasted) to get someone to take my request for account cancellation seriously, it all became a circus again. \n\nOn 25 November 2022, they debited my account after telling me explicitly that no more debits will be made. When I finally reached someone about this, they specifically said that I will get a refund in 7 - 10 working days. I never got my money. \n\nAfter waiting about 12 working days for my refund, I called them and was told that someone from Billing would call me back. No one called. All I received was an email saying that they don't owe me money and that I owed them money. Plus, I received an sms saying that my account will be debited early for December 2022. Which account? The one I requested that they close in February 2022?\n\nThis company has caused me extreme stress and anxiety, I'm actually traumatised by this ongoing experience. They seem hell-bent on not giving me my refund, and trying to take even more money from my bank account for no service delivered.\n\nI cannot believe that a company like Rain is actually allowed to operate - they do not treat their customers fairly. Even though it can never take away the suffering this company has caused me, I just want my refund and for them to never touch a cent of mine ever again.", "business_slug": "rain-internet-service-provider"}}
