{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Billing", "service": "Cell C Account", "description": "Cell c has failed me as their loyal customers by handing over my account to this company Shapiro Shaik Defries & Associates. This company is the most unprofessional company in the and poor service and useless employees. On 2021/09/09 at 12.24, I received an email that I owe Cell R11 365.51 which I agreed to pay R550 today. When I called, they are saying I owe R12 012.96. I have all the emails and have shared them with the employees of Shapiro Shaik Defries & Associates, but it's like I am talking to robots. They do not respond to emails. I have called them at my own cost and asked them what is going on with this Cell C account. As a customer, this is terrible service at its best. I want to settle this account as it is affecting my credit score and record, but I cannot because Cell C handed this account to a useless company that wants to rip me off with an unknown amount that I owe to Cell. I have been a loyal paying customer to Cell for the past years since I have been having contracts with them, but during the COVID time, life was difficult on my side. Now this is how they pay back my loyalty to them by handing over my account to a useless company. I want to pay what is due to Cell C for good.", "suggestion": "Cell C should investigate the issue with Shapiro Shaik Defries & Associates and ensure that accurate and clear communication is provided to customers regarding their outstanding balances. They should also improve their customer service and responsiveness to emails."}, "meta": {"id": 4224040, "created_at": "2022-12-13 14:07:23", "review_rating": 1, "review_title": "Cell C Account", "review_content": "Cell c has failed me as their loyal customers by handing over my account to this company Shapiro Shaik Defries & Associates this company is the most unprofessional company in the and poor service and useless employees in 2021/09/09 at 12.24 i received e-mail that owe cell R11 365.51 which i agree to pay R550 today when i call to they are saying i owe R12 012.96 how on earth can it be possible i have all the on e-mail i have shared all with the employees of Shapiro Shaik Defries & Associates but its like i am talking to robots they do not respond to e-mails i have call them which in my own cost and ask them what is going with this cell c account as customer that terrible service at its best.  i want to settle this account as it is  affecting my credit score and record but i can not because cell c handed this account to useless company that want to rip me off with unknown amount that i owe to cell i have Loyal paying customer to cell for pass years since i have been having contracts with but during covid time life was difficult on my side now this is how they pay back my loyalty to them but handing over my account to useless company i want to pay what is due to cell c for good.", "business_slug": "cell-c"}}
