{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Poor service", "service": "Telkom network", "description": "Telkom deducted money for a bundle but did not load it. Customer had to buy more data to query the issue and is frustrated with the lack of customer care.", "suggestion": "Resolve the issue by loading the purchased bundle and provide better customer service."}, "meta": {"id": 4224811, "created_at": "2022-12-13 23:59:23", "review_rating": 1, "review_title": "Everyone is right, Telkom is the WORST NETWORK EVER!!! They don't even deserve the benefit of a doubt!!!!", "review_content": "I wish I could say this the worst service I have received but I can't because I didn't get any service at all. I mean what kind of a network service providers tells you that you have called outside their operating hours? So people must die cause y'all don't wanna employ people but your useless robot tshepo?? Then whenever you eventually manage to request a call back your lazy agent calls after  and keeps quiet for a whole 2 mins after that he ends the call by ending task on the pc and I'm left with dead air on the call. I am absolutely ashamed that I even advocated for y'all, telling people that they are the one's who went wrong but now I see that everyone is right. Y'all don't care about your clients at all and I'm absolutely disgusted with the way treat customers. I bought a bundle on Saturday, you guys deducted money from my airtime immediately but even today you have not loaded my bundle. Had to get more data to even query this with y'all and all that you do is make a fool out of me. Even to write this review I had to buy more data to try and get data that I bought from y'all. So when y'all see this you must make sure you resolve this matter so I can get my data. I will use it up so quick together with the rest of my balances so I can part ways with y'all  because I am so done with y'all.", "business_slug": "telkom"}}
