{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "Recently signed contract. Top 3 worst experiences of my life.", "suggestion": "Improve customer service and address the specific issues mentioned in the complaint."}, "meta": {"id": 4225419, "created_at": "2022-12-14 11:07:58", "review_rating": 1, "review_title": "Vodacom - Recently signed contract. Top 3 worst experiences of my life.", "review_content": "Dear Vodacom,\n\nI have recently signed up for a contract with your establishment, the sales people where brimming and full of enthusiasm, in contrast to the utterly abysmal services rendered.\n\n1. I have paid for extra 40mins a day Any time Voice. But it does not seem to have worked this past two months - the robotic voice asking me to recharge every chance it gets. I require my phone in order to do my business. This cuts of my hands and disables me from doing what I need to. Even with mundane tasks such as phonining a mechanic to checkup on my car's servicing.\n\n2. The mobile data only works for 15 minutes after resetting my phone, this adds to immense frustration with your establishment as I require it for Google Maps to give real time information. Picture driving on the N1 and the internet just dropping. Now I have to juggle around to reset the phone which takes atleast 5 minutes, then switch on mobile data and type in coordinates again. This can easily take 3 -4 hours a day and runs the risk of my attention elsewhere whilst in traffic.\n\n3. The phone itself is giving of echo's while phoning customers. Its not even 5 months old.\n\n4. Trying to get a human on the other end of your customer care line is near impossible.\n\nI have to say I had no queries being on prepaid due to the costing schemes you use. It does not seem you have any systems or trained professionals in place to maintain your contracts. I'd pay you R1000 000 if there was no other issues like this which I'm quite sure you have on a regular basis indicating decay of your administrative institutions.\n\nI will be going forward bringing up in every conversation to friends, colleagues and strangers that I walk into, that they should avoid Vodacom like the black plague or air born Ebola.\n\nThank you for your time and attention reading the abovementioned - I hope it can at least cause some self reflectance and improvement to Vodacom. I am utterly disappointed and regret ever signing a contract with an institution so inept in a super saturated market regarding telecommunications.", "business_slug": "vodacom"}}
