{"chatbot": {"related": 1, "evidence": "The complaint mentions the use of a chatbot named 'Tobi'", "classification": "Customer service", "description": "The chatbot 'Tobi' is not able to provide adequate assistance and keeps redirecting the customer", "suggestion": "Improve the intelligence and capabilities of the chatbot to better understand and address customer queries"}, "complaint": {"classification": "Poor service", "service": "Vodacom", "description": "Vodacom has failed to deliver the correct product, provide proper customer support, and cancel the contract as promised", "suggestion": "Vodacom should rectify the delivery issue, improve customer support, and promptly cancel the contract as requested"}, "meta": {"id": 4230430, "created_at": "2022-12-19 10:44:46", "review_rating": 1, "review_title": "Vodacom does not care one second about delivering honest service to their customers or honoring their contracts / terms.", "review_content": "Vodacom does not care one second about delivering honest service to their customers or honoring their contracts / terms. Their systems & procedures are rigged to only get access to your bank account and take your money. \n\n1 November 2022 I signed up for a new Data SIM on contract with Vodacom SA. After many! attempts for nearly 2 weeks to actually speak with someone on a call or email, their system just keeps pushing you into loops with their stupid \"Tobi\" robot that does not even have the intelligence to recognize your question. The package was delivered Thursday 10 Nov. But it was the wrong product. The SIM did not work in my mobile router as ordered. \n\nI could not get any answer from Vodacom via phone, email or Whatsapp system. Email auto reply says this channel is discontinued and to contact \"Tobi\" by phone or Whatsapp. On phone & Whatsapp, \"Tobi\" is programmed to tell you to email them. I even tried Twitter but those people could not even read simple English as they failed to answer to my actual question. Immediately Monday 14 Nov (3 days after SIM activation), I went in to their shop and there I was put in phone contact with an actual person. To fix the problem of the wrong product, they had to cancel the contract and collect the delivered product. \n\nI had to contact Vodacom again on 17 + 23 + 28 Nov because both the contract calcellation or the product collection has not been done yet. So the product was finally collected 30 Nov. \n\nBut on 8 December I phoned Vodacom again to find out why I have not yet received the contract cancellation notice via email as I was told repeatedly. I only goy a voice recording that said \"Our call center detects a high number of calls from your number. Your number is blocked to protect the system from fraudulant activity. You have to call ********** / ********** @ R2.00/minute for further help.” SERIOUSLY!!! blocked for fraudulant activity!? \n\nOn 9 Dec I called the same Vodacom Billing Support numbers using family members phone. After speaking with someone I spoke with on 17 Nov, she put me through to the \"cancellation dept\". There I was put through to someone else again. After having to explain EVERYTHING AGAIN and a very long conversation, this guy confirmed his job was just to GET ME TO BUY ANOTHER CONTRACT! He was not able to cancel the contract but he said \"did send an email to the \"cancellation dept\". \n\nAt the shop they say they can not help me and I have to speak with those people on the phone. It just keeps going in circles and every time they lead you to *just another sales person* trying to sell you something.\n\nToday after 49 days Vodacom is still taking my money from my bank for this contract of an incorrect product which I do even not have any longer after they collected it from me.\n\nSo what are we to do? How do we get Vodacom to actually deliver the product & service they sell us?\nCan anyone help me please?", "business_slug": "vodacom"}}
