{"chatbot": {"related": 1, "evidence": "The customer mentioned using the Tobi SMS bot and contacting 'Tobi' via WhatsApp", "classification": "Roaming Assistance", "description": "The customer activated international roaming but is unable to connect to any mobile network in the UK", "suggestion": "Investigate the issue with international roaming and ensure that the customer can connect to a mobile network"}, "complaint": {"classification": "Roaming", "service": "Vodacom", "description": "The customer is unable to connect to any mobile network in the UK despite activating international roaming", "suggestion": "Contact the customer on an alternative UK number to urgently activate their roaming"}, "meta": {"id": 4231616, "created_at": "2022-12-19 23:47:19", "review_rating": 1, "review_title": "Roaming not working despite activating prior to departure", "review_content": "Last week I went into the Vodacom branch at Mall at Reds and explained to them that I wanted to change from MTN due to issues I had been having. I explained that I work abroad and would need international roaming to be active to receive OTP's from my SA bank accounts. The consultant advised me this was easy to setup and reassured me that I can have international roaming on a Vodacom PAYG SIM card. I stressed to her the importance of needing this to work properly as I depended on it for conducting business back in SA while working abroad. After again being reassured by her that this would not be a problem, I purchased a new phone and SIM card, on a 'Power bonus' PAYG package. I followed her advice and activated international roaming by calling 082 135 and then using the Tobi SMS bot. I then rechecked before departure and again received SMS notification that Vodafone world roaming was indeed active. I have subsequently switched and updated all my banking and investment contact details to my new Vodacom number however, upon my arrival in the UK, I am unable to connect to any mobile network here. If I search manually, networks of the Vodacom roaming partners are available but all show 'forbidden' and prevent me from connecting. I cannot receive any calls or smses to my new Vodacom number. I have restarted my phone numerous times without. If I go on the Vodacom app it says I am ineligible for roaming but if I contact 'Tobi' via WhatsApp (using WiFi) it says that I am already setup for roaming with Vodafone World. I don't understand this discrepancy. I tried emailing customer care and was again referred to the chatbot Tobi which is useless as it keeps telling me I am already registered for roaming despite it not working. I need this resolved ASAP as I need to be able to access my internet banking and other financial institutions. I was promised by the consultant prior to sale that I would not have an issue with roaming yet here I am, stick without connectivity and needing to do business. I cannot be called on my Vodacom number and I cannot call the call centre either as I am already abroad and have no mobile network connectivity. I need someone to email me or call me on an alternative UK number to urgently activate my roaming!! Please help!!! I have been unable to reach Vodacom thus far!", "business_slug": "vodacom"}}
