{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "This account was suspended for non-payment of fraudulent charges allocated to my account. Vodacom is full of criminals and useless consultants, call centre agents, account managers. I have written several reviews, none of which are attended to, or responded to. Thembi Melapi does not attend to issues that arise because of her incompetence. Zinhle Ntshalinthsali does not respond to queries or attempt to help. DeskPam is a useless bot that rivals the idiocies of the Vodacom service staff - between the bot and the staff, there is no resolution, just transferred calls to lines that ring unattended and are never answered. My account has been handed over for debt collection, but no statement or invoice has been sent since May 2022. How do customers resolve issues with Vodacom? Being told to go into a store for assistance is a joke. Why should I sacrifice my time to remedy Vodacom's internal culture of fraud and crininality. The new office ethos of incompetence and stupidity.", "suggestion": "Vodacom should improve their customer service by addressing complaints promptly, training their staff to be more competent and responsive, and ensuring that statements and invoices are sent to customers in a timely manner."}, "meta": {"id": 4234120, "created_at": "2022-12-21 13:01:59", "review_rating": 1, "review_title": "VODAC*NTS", "review_content": "ACCOUNT VB024520-5\n\nThis account was suspended for non-payment of fraudulent charges allocated to my account.\n\nVodacom is full of criminals and useless consultants, call centre agents, account managers.\n\nI have written several reviews, none of which are attended to, or responded to.\nThembi Melapi does not attend to issues that arise because of her incompetence.\nZinhle Ntshalinthsali does not respond to queries or attempt to help.\nDeskPam is a useless bot that rivals the idiocies of the Vodacom service staff - between the bot and the staff, there is no resolution, just transferred calls to lines that ring unattended and are never answered.\n\nMy account has been handed over for debt collection, but no statement or invoice has been sent since May 2022.\n\nHow do customers resolve issues with Vodacom?\nBeing told to go into a store for assistance is a joke.\nWhy should I sacrifice my time to remedy Vodacom's internal culture of fraud and crininality. The new office ethos of incompetence and stupidity.", "business_slug": "vodacom"}}
