{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Telkom", "description": "After taking out a new contract with Telkom, the customer was promised 20gigs of once-off free data. However, the customer is unable to retrieve this data and keeps receiving messages saying they have reached their daily limit. The customer has tried seeking help through various channels such as Telkom WhatsApp, Telkom Messenger on Facebook, and the Telkom app, but has not received any assistance. The customer has also visited a Telkom store twice and encountered unhelpful staff. The customer suspects that the supposedly free once-off 20gigs will be cancelled on 01 January 2023.", "suggestion": "Telkom should investigate the issue with the customer's data and ensure that they receive the promised once-off free 20gigs. Additionally, Telkom should improve their customer service by providing more efficient and helpful support through their various channels."}, "meta": {"id": 4236814, "created_at": "2022-12-23 11:16:15", "review_rating": 1, "review_title": "USELESS TELKOM", "review_content": "After taking out a new contract with Telkom I was promised 20gigs ONCE OFF FREE DATA. What a joke. I cannot retrieve this data. I keep getting messages saying OUT OF DATA. YOU HAVE REACHED YOUR DAILY LIMIT. I have loads of screenshots and have tried getting help via Telkom whatsapp (ABSOLUTELY USELESS) I've tried via Telkom messenger on Facebook (Karabo the robot is USELESS) I've tried via the Telkom app. When I log in it says I don't have any products with Telkom. In FACT I  have TWO (A mobile contract AND a Data contract) I've been into Telkom Bayside Mall TWICE. Yesterday I saw the Technician Romano - TOTALLY USELESS. This morning after spending EIGHTEEN MINUTES on the phone, first with JACKSON MORRIS who then transferred me to the equally USELESS BULELWA LAZOND I was cut off. I can bet you that on 01 January 2023 this SUPPOSEDLY FREE ONCE OFF 20GIGS WILL BE CANCELLED. VERY SNEAKY FALSE ADVERTISING.", "business_slug": "telkom"}}
