{"chatbot": {"related": 1, "evidence": "The customer mentioned trying to chat with 'Lu****a Hlomza' on the TOBi chat bot.", "classification": "Customer support", "description": "The customer had a negative experience with the chat bot and did not receive a response to their query.", "suggestion": "Improve the chat bot's responsiveness and ensure that all customer queries are addressed."}, "complaint": {"classification": "Service", "service": "Vodacom", "description": "The customer received incorrect information about a package upgrade and is now being charged more than expected. They have been unable to reach Vodacom for assistance.", "suggestion": "Provide accurate information to customers and improve customer service response times."}, "meta": {"id": 4243166, "created_at": "2022-12-31 12:04:55", "review_rating": 1, "review_title": "Disappointing service", "review_content": "This is my first ever bad review and I honestly don’t think Vodacom could disappoint me any more than I already am. I had a call from Vodacom last month as my current package has “expired”. The consultant offered me a lower package at R400 with more data and of course I accepted as this is lower than I am currently paying. I received an sms this morning telling me that my premium is now almost R300 more that what I was advised. I have tried to contact Vodacom since before 8am on all platforms, from calling them to requesting call backs to trying to chat to ‘Lu****a Hlomza’ on the TOBi chat bot who ended the chat without responding to my query? \n\nAfter speaking to different consultants on 4 calls who promise to assist and escalate, I finally get through to a nice gent who transfers me through to after sales so that they are able to cancel this “package upgrade”. Knowing that they are likely short-staffed I gladly stay on hold for over an hour to have someone drop the call. As I’m typing this, this is probably my 6 or 7th call Nd I have been waiting for a consultant for 20 minutes already.", "business_slug": "vodacom"}}
