{"chatbot": {"related": 1, "evidence": "The complaint mentions the service bot being useless and not providing the promised reconnection.", "classification": "Poor chatbot performance", "description": "The customer is complaining about the service bot not being able to reconnect their phone despite promising to do so.", "suggestion": "Improve the service bot's ability to handle reconnection requests and ensure that it follows through on its promises."}, "complaint": {"classification": "Poor customer service", "service": "Phone reconnection and conversion to pay as you go", "description": "The customer is frustrated with the lack of assistance and care from the company's staff in reconnecting their phone and converting their number to pay as you go.", "suggestion": "Contact the customer promptly to resolve the reconnection issue and provide better training and support to staff members to improve customer service."}, "meta": {"id": 4250158, "created_at": "2023-01-06 17:01:09", "review_rating": 1, "review_title": "Useless bunch", "review_content": "I am absolutely disgusted by the service levels I have received in the last 24 hours.\nWe had admittedly fallen behind in payment and had been cut off. I made plans to take time off work to go in and make the payment required including the month ahead. I also inquired about converting my number to pay as you go. As happy as they were to take the money they immediately shut up shop and mentioned I'd have to get in queue and have a different person help me. I did not have time for that, so they said I could call a number for reconnection. That number gives you very little option, either for upgrade or a service bot. The whole time informing you of how they care. The service bot is so friggen useless. It said I would be rconected twice. This did not happen. It has been a whole day. I have turned off after an hour after each call as instructed and still nothing. I even lied and contacted someone about an upgrade, which I do qualify for and asked them to put me through to someone about reconnecting. They did... They promised to call back they didn't. The 4 times I have tried since then I have been hung up on all four times. I give up. Someone needs to contact me. I just want to have my phone connected again. I'm over the exhaustive ineptitude of your entire company. Once that is done, I want to covert my number to pay as you go. The lack of care and  malice from your staff is excruciatingly painful. I am over you", "business_slug": "vodacom"}}
