{"chatbot": {"related": 1, "evidence": "The customer mentioned receiving a response from the BOT regarding the cancellation.", "classification": "Customer Service", "description": "The customer is complaining about the chatbot's response regarding the cancellation and the continued deduction of money from their account.", "suggestion": "Improve the chatbot's response to cancellation requests and ensure that contracts are properly terminated to avoid unauthorized deductions."}, "complaint": {"classification": "Billing", "service": "Contract cancellation", "description": "The customer complains about Vodacom continuing to deduct money from their account even after they stopped the contract and paid the penalty for early cancellation.", "suggestion": "Resolve the issue by refunding the deducted money and ensuring that the contract is properly terminated."}, "meta": {"id": 4252121, "created_at": "2023-01-09 13:04:59", "review_rating": 1, "review_title": "Thieves!!!!!!!", "review_content": "IMPOSSIBLE TO CANCEL THE CONTRACT! They are thieves and continue taking my money months after I cancel my contract! My contract was due to expire end of December 2022, and I moved to Namibia in November 2022, so I stopped my contract at the end of October 2022 and paid the penalty for prematurely stopping the contract. I spoke with numerous agents and sent all the documentation to the cancellations department, where I got a response from the BOT saying that my early cancellation had been received. The problem is now, even after stopping the contract and paying the penalty, Vodacom is still taking money off my account. They took money, Nov, Dec and now JANUARY as well, which means that they - without my approval continued the contract!!! This company is a scam and has NO CUSTOMER SERVICE! I need this matter resolved as soon as possible, and I would like the money taken from my account to be paid back!!!!!!! I am staying in Namibia now, and I can't get in contact with a real person other than a BOT. Please contact me via email to resolve this matter.", "business_slug": "vodacom"}}
