{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Product", "service": "Cell C", "description": "The customer received a faulty tablet that could not properly insert a SIM card. The tablet was sent for assessment but the repairs were deemed too expensive. The customer is now left with a device that has limited use.", "suggestion": "Cell C should ensure that devices are fully functional before delivering them to customers. They should also provide a satisfactory resolution for the customer, such as a replacement or refund."}, "meta": {"id": 4253907, "created_at": "2023-01-10 12:44:24", "review_rating": 1, "review_title": "Once Upon a Tablet...", "review_content": "Dear Reader, happy 2023. I can't believe that it's been almost 7 months since this whole mess started. This means that I am about a quarter of the way into my journey with Cell C - time is flying.\n\nFirst off a quick reminder of how I go here and why I'm posting this message.\n\nIn July of 2022 I decided to exercise a long overdue upgrade option on my contract with Cell C. I opted for a Samsung Tablet [that could take a Sim and SD card - more on this later] \n\nThe Tablet delivered promptly. For various reasons it was a few days before I unboxed the tablet and took it out for a test drive. I switched the Tablet on and followed the onscreen prompts and after a few minutes I arrived at the Home screen. So far so good.\n\nTo insert a Sim card one needs to power down the device, eject the sim tray with the tool provided, place the sim card in the tray, then insert the sim tray back into the device. This is where the fun begins.\n\nWhen I tried to insert the sim tray, there was resistance. I immediately put the tablet back in the original packaging and headed towards the nearest branch of Cell C - this was a fruitless exercise. \n\nFast forward about 2 months - after having given up on getting this matter resolved - I was contacted by someone at Cell C who arranged for me to hand the tablet in for assessment. Photos were taken, the tablet was switched on and off - it was then packaged up and sent in for 'assessment' \n\na couple of days later I received a call from an assessor, he advised me that the repairs to the tablet would cost about the same [or more] than a new tablet. my response can't be published as there was quite a bit of profanity involved. Needless to say I rejected the assessment and the device was returned to me.\n\nSo I am now the proud owner of a device that has limited use. I advised Cell C that I would post on this platform every month until my contract expires. There have been responses to my posts. Someone at cell c called me a liar and said I damaged the tablet on purpose [which makes no sense - if it got damaged during the last month of my contract then.....]. On another occasion I was contacted and arrangements were made to have the tablet re-assessed, having low expectations of Cell C I wasn't surprised when the device was never collected.\n\nSo, in summary, if you get a device from these guys, OPEN IT WHILE YOU ARE IN THE STORE - make sure it does what it is supposed to do and that everything fits where it's supposed to fit.\n\nAnd to the Cell C robot that reads this message, please don't bother calling me, I will not pick up - our relationship, is over.", "business_slug": "cell-c"}}
