{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Billing", "service": "MTN", "description": "Overcharged for MTN's system failure. Upgraded contract in June but was invoiced for the old contract until October. Billed double the amount of the new contract. Branch and call center agents unable to resolve the issue.", "suggestion": "Investigate the overcharges and provide a refund for the excess amount. Improve communication and coordination between branches and call center agents to ensure accurate billing."}, "meta": {"id": 4264900, "created_at": "2023-01-18 18:21:36", "review_rating": 1, "review_title": "Overcharged for MTNs system failure!!", "review_content": "I wish I could rate 0.\nI upgraded my contract in June 2022 and was advised I would pay X amount which I agreed to. After receiving the devices I called the call center several times to enquire when the new package will commence and was told they couldn't find my upgrade on the system.\n\nEvery month from June - September I was invoiced for the old contract, but I paid XX amount for my own sanity.\n\nIn October I went to Maponya mall branch, still no contract found. However after I left I started receiving SMS's, I ignored it. October invoice arrives, I am billed double the amount of the new contract I took in June. I paid the agreed X amount. November again I am billed double. I went to Southgate branch, where I was advised the overcharges are due to validation issues they had during that period and it's for activation fees and pro rata. I left the branch being reassured by 2 consultants that I will be charged X amount with my new invoice.\n\nSurprise Surprise, new invoice received, still the same double charge.\n\nI called the branch and spoke to Katlego who advised me that she is looking into it and will call me back. I'm still waiting.\n\nBranch consultants can't assist, call center agents can't assist. MTN might as well hire robots with no ability to think because WoW!!", "business_slug": "mtn"}}
