{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Fraud", "service": "Vodacom", "description": "Fraudulent upgrade on my Vodacom account. Unauthorized debit of R1895.75. Multiple unauthorized upgrades done under my name. Requested documents used for upgrade but not provided. Need resolution and removal of fraudulent activity from my name.", "suggestion": "Provide a fraud department to handle the complaint. Investigate and resolve the fraudulent activity. Close the account and issue a letter stating that I am a victim of fraud to protect my credit status."}, "meta": {"id": 4266620, "created_at": "2023-01-19 18:50:07", "review_rating": 1, "review_title": "Fraudulent upgrade", "review_content": "So frustrated now with Vodacom and disappointed.October received sms that my email address has been changed.Went to fourways mall  beginning of November to query this and that it was not me who changed the email address.Ask the consultant where did this happen she said she is unable to see the information and changed back to my email .and advised her have not received my monthly statement since i had the contract and she advised me she updated everything.I asked her there will not be funny things happening again and she said yes.20 Dec 2022 my account is deducted with R1895.75 from Vodacom.Never authorized this kind of a debit contact my bank to reverse it as I did not authorize this .My Monthly installment for the contract I know is R99 .can I really go from R99 contract to R1800.money was reversed but im worried about my credit record never reversed a debit order in my life but I find myself in this situation because Vodacom is not doing their work properly.This happens I don't even get any contract/agreement on my email.1 Jan 2023 I get an agreement for an Samsung S22 base .5th January im back in Gauteng from Limpopo to sort this out .Get to Vodacom fourways Mall to query and report the matter .they tell me I need to phone i advise them im not going back because when you phone you talk to a robot.Told them my story and when the consultant check the system two upgrades have been done under my name samsung Z-Flip November and Samsung S22 base.and they advise me to go do an affidavit.Affidavit done ,6 January back to Vodacom fourways mall the consultant log a fraud query and I ask the consultant for the documents used to upgrade.She advise me she cannot give me she is not allow then I asked her who can assist me to get the documents .she phones upgrade department and the lady says to me the consultant next to me can provide the documents as they are using the same system which she mentioned the name but cant recall it.was printed the documents guess what fraudulent ID ,ID number its mine,name are mine,face not me ,issue date not the same as mine as I have 2 Id. green and smartcard all in my position.never lost an Id before.and when i took the two alcatel tablets for my kids i used a smart Id not green ID.So in my mind im saying to myself this consultants they check our accounts and check which accounts are due for upgrades.maybe i might be wrong.but how can i upgrade from 99 to 1800 ,how do you verify people.im staying in gauteng ,upgrades are done in cape town Pinelands .I don't even know the place neva been in cape town before.\n\nWent to Vodacom work Midrand the 9th looking for a fraud department and they said they do not have fraud department .this is affecting my expenses and my life.was help my a consultant to log a fraud query again.took both my ID ,made copies and made me to sign both copies.and she said should the be any feedback she will update me.To date  I have not received any feedback.emailed her back for any update.no reply.\n\nAll I want is this matter to be resolved ,and everything out of my name as its definitely impacting my credit status.and account to be closed.\nAnd this to be cleared on my name\nHave a later issued for me that im the victim of fraud as this will affect me to apply for any credit,home ,vehicle finance etc.", "business_slug": "vodacom"}}
