{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Product", "service": "Samsung Fold Z4 Flip", "description": "I have a phone that I can hardly use for 3 hours a day without losing battery power. The battery does not last for more than 4 hours and the phone overheats, making it unusable. This is causing inconvenience and affecting my work as I need to take photos of buildings on site. I am disappointed with the quality of the phone and the lack of warning about its faults.", "suggestion": "I suggest that Samsung addresses the battery and overheating issues with the Samsung Fold Z4 Flip. Customers should be informed about these problems before purchasing the phone."}, "meta": {"id": 4271613, "created_at": "2023-01-24 09:09:20", "review_rating": 1, "review_title": "Samsung Fold Z4 Flip", "review_content": "So good day\n\nI realized I had enough of complaining to you and hearing I must take the phone into the store to have it looked at. The only store in Vereeniging is in Three Rivers Mall and without having transport it makes it difficult for me to go there. I took the phone to Vaal mall with a taxi only to find that they are just an outlet, just there to sit and turn people away.\n\nSo, I have a phone that I can hardly use for 3 hours a day without losing battery power. I was stuck on the freeway with my GPS that just died last month. I then checked all the problems that comes with this phone and yup this is one useless piece of nonsense I have to pay R1217x36months for??\n\nYou should have warned me before sending me this **** about all the faults this phone comes with. How do you expect me to pay CellC this amount of money and not have a phone available all day?\nOVerheating Overheating Overheating. THe battery does not last for more than 4 hours which means it is useless as the phone will heat up so much that it actually feels like it will explode in your hands. \n\nMy phone is forms part of my income as I need to take photos of buildings when I go to site. I cannot even use this useless phone to do my work, I have to walk around with 2 phones when I go to site\n\n\nPAGE CONTENTS\n•\tCommon Problems in Samsung Galaxy Z Flip and Solutions\no\tConnectivity Problems\n\tBluetooth connectivity problems\n\tWi-Fi/Internet connectivity problems\n\tMobile data not working\no\tSlow Performance\no\tOverheating Problems\no\tSlow Charging\no\tPoor Camera Quality\no\tPoor Battery Life\no\tEarpiece Sounds Robotic\no\tScreen not working properly\no\tApps not working properly\no\tSIM/Network Problems\no\tSamsung Galaxy Z Flip Fingerprint Sensor Issue\no\tSamsung Galaxy Z Flip Not Turning ON\no\tSamsung Galaxy Z Flip not getting charged via cable/charger\no\tUnfortunately camera has stopped", "business_slug": "cell-c"}}
