{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Service", "service": "Cell C Fibre and their Call Centers", "description": "Bad service levels at Cell C Fibre and their Call Centers. Payment allocation issues, lack of billing statement, unhelpful customer agents, difficulty in contacting management.", "suggestion": "Contact the customer to resolve the payment allocation issue, provide a detailed billing statement, improve customer service and communication, ensure a functional contact number for the Head-Office."}, "meta": {"id": 4287045, "created_at": "2023-02-03 08:42:07", "review_rating": 1, "review_title": "Bad Bad service levels at Cell C Fibre and their Call Centers!", "review_content": "I was called by Cell C Fibre Collections department to inform me that I was in arears on my Fibre account on the 16th of January 2023 which was nonsense.. I then went and paid an amount as to show that I am paid in advance on the account and then also phoned in as to enquire if they have received it and to send me a detailed billing statement.\nSince I have paid my Cell C Fibre acccount in advance on the 16th of January 2023, all hell broke loose becaue they have allocated my money into another account, telling me that it was me who did it wrongly. \nI have been using the same account number for Easypay for almost over a year now with no issues - WHY USE ANOTHER SWIFT ACCOUNT NUMBER???\nOn contacting them on the 16th of Januuary 2023 to ask fo a billing statement, they could not provide me with one. I wrote e-mails upon e-mails, only to receive back answers the the cace has been closed, thanking me for contacting the .... HOW BIZARRE!!!\n\nThis morning, 02 February 2023, I went onto the Cell C phone- app as to see if I can find any joy there regarding my in advance payment because my phone line payment did not go off my bank account as usual via debit order.\nOnly to find that the money that was paid for Fibre was allocated into the phone into the phone account - NO ONE GIVING ANY FORM OF NOTICE THAT THIS WAS GOING TO HAPPEN.\n\nThe point is....\nSince the 16th of January 2023 have I been trying to resolve this matter with them - with customer agents not knowing how to assist. I have been sent from one corner to the other with no prevail. \nOn phoning the Customer Care-line this morning, 03 February 2023, asking to speak to a manager on duty with the name of Lerato, I was told that she is busy on a line and will phone me back later on. UNACCEPTABLE because this will not happen, due to the fact that I have no trust because of all the calls I have been waiting for from them since 16 January 2023.\nI only received a sms that they have received my query and will attend to it shortly with a reference number and then..... AN SMS WILL BE SENT TO YOU SHORTLY WHEN YOUR QUERY HAS BEEN RESOLVED. \n\nDo these people think that they are dealing with robots or non-intelligent people???\nHow can the matter be resolved without talking to me first???\nHow can they send such \"hoggwash\" to customers, thinking they will await such nonsense any further???\n\nPLEASE ASSIST for I am desperate!\n\nI also asked to provide me with a telephone number for their Head-Office to complain about my issue regarding, taking my money and allocating it to whatsoever account without my consent, on which I received a number which does not exist! **********\nI went onto the network as to Google for their number only to find that their number is ONLY ans**** by their Call Center on 135 fromm a Cell C phone number.\nI then phone the 135 number and asked for a Head-Office number, being placed on hold for 12 minutes to come back with a number. Eventually I received a number - ********** which goes ont an answering machine setup.\n\nI am up in arms with the service level of this company and would like to sincerely like ANY MANAGEMENT to contact me as to resolve my issue. \n\nIf I had an option as not to grade this comany, I would have. That is why I had to give it one star,", "business_slug": "cell-c"}}
