{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Poor service", "service": "Vodacom", "description": "Faulty devices, unethical conduct, and poor customer service", "suggestion": "Cancel the contract, provide a refund, and improve customer service"}, "meta": {"id": 4293023, "created_at": "2023-02-07 14:36:08", "review_rating": 1, "review_title": "Faulty devices, poor service and unethical conduct", "review_content": "On 12 December 2022 I took out a new 24 month contract with Vodacom for a Lenovo tablet. \n\nThe device is faulty.  Its response time is extremely slow, it freezes and has to be restarted several times a day, it is frequently not responsive to touch, and often cuts off calls or the other party can no longer hear me.\n\nI took the device to a Vodacom4U shop today, and the service consultant tested the tablet and agreed that it is unacceptably defective.  However, he also informed me that I was not permitted to cancel the contract, and said the only way to remedy the situation would be to take out yet another contract with a new device, while continuing to pay for a contract that includes a device that doesn't work, until December 2024.\n\nIn terms of the Consumer Protection Act, this conduct by Vodacom is illegal. I have tried to raise the matter with your customer care line, but was directed to a bot that was unable to assist me.  It was impossible to find an actual human to assist me.\n\nIn terms of applicable legislation, I have the following rights:\n\n   The supply and use of goods that are free of defects and of a quality that consumers have a right to expect. Suppliers are required to remedy defects in goods supplied or refund. \n\n    Goods of good quality, in good working order, and free of defects.\n\nIn terms of the Act, Vodacom implied a warranty of quality by making the offer, i.e. that I should have been provided with goods that are good quality.  It is my right to return the defective tablet, without penalty and at Vodacom's risk and expense, within 6 months if it is of inferior quality or defective - which it is, as confirmed by your representative this morning.  I then have the right to choose whether Vodacom refunds, repairs or replaces my device, and I want a complete refund.\n\nNaturally I also want to cancel this contract due to poor quality & defects in the device you supplied, and the Act clearly states that Vodacom may not use this as grounds to enter into a new agreement (which is what your consultant to whom I spoke this morning tried to do).\n\nI am justifiably frustrated with the poor performance of the device, the untruthful advice from Vodacom that I may not cancel the contract, and that Vodacom's customer care call center is, in fact, a bot.\n\nAs a loyal and longstanding client, I am disappointed in your service and the obstacles Vodacom has put in the way of resolving these issues. Please reply with a confirmation that this contract has been cancelled and details of my refund.  I expect this matter to be resolved within 24 hours of making this complaint.", "business_slug": "vodacom"}}
