{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Contract and Data Plan", "description": "Customer was mis-sold a contract with incorrect information about data plan options. Customer received poor customer service and was unable to get assistance from a manager. Customer experienced difficulties in upgrading their LTE plan and was given incorrect information about contract end date.", "suggestion": "Investigate the mis-selling of contracts and ensure accurate information is provided to customers. Improve customer service by training agents to provide accurate information and resolve issues promptly. Provide better communication channels for customers to reach managers and escalate complaints. Review and improve the process for upgrading data plans and ensure agents have the necessary knowledge to assist customers."}, "meta": {"id": 4320551, "created_at": "2023-02-25 16:53:21", "review_rating": 1, "review_title": "Kavisha", "review_content": "If I could give this company 0 rating I would definitely!!! \nThey customer service is diabolical! It's like speaking to a bunch of clowns who don't know their jobs and so not professional. \nI took a contract with last year march and I was told by the person who was doing my application that I could take the lowest data plan that comes with the phone and remove it after 3 months since I told him I don't want the data plan as I would take a separate plan with them for data due to what he said I taken the contract. Last Sunday I decided to chat with their agent which felt like I was speaking to a bot because of the copied and pasted templates and they refused to answer my questions but at that point I understood I was mis sold at point of sale and they clearly wasn't Willing to help so I asked for a manager I was given an email to email which when I did email they email failed because their inbox was full so I got back the chat line and the agent logged me a complaint and said a manager will contact me within 72 working hours. I told her I was off Wednesday so can she get them to call me then and she agreed I got an email and SMS as well. They call me on Tuesday whilst I'm at work the manager from the store that I took the contract called I told her call Tomorrow after 10am as I was busy at work she agreed and we ended the call. Wednesday comes no call so I call in and I had such a nightmare I was passed to so many departments the agent that helped me in the billing team couldn't even tell me when my contract ends I also asked to increase my LTE plan as the data had become too less and she told me it isn't possible I must wait till 2024 when my contract would be long over then I spoke to the retentions team who didn't even understand they called retentions because they are a last resort in trying to maintain a customer the guy then transferred me to sales who agreed to do the upgrade after speaking but at that point I wanted a manager and for cheaper data plan because he was selling me some unnecessary plan I did not need he then went twice to get a manager and placed a very long hold twice he then comes back and says a manager will take the call places me on hold and never gets back to me I eventually had to drop the line I called again and was pasted to pillar to post and was refused a manager I requested for a subject access request as I wanted to take this further but I don't think they understand by law how serve that request is it was dreadful customer service and experience especially being mis sold if you are looking for a company please don't choose this one they may be cheaper but they are the worst they internet connection is even worse don't waste your time", "business_slug": "telkom"}}
