{"chatbot": {"related": 0}, "complaint": {"classification": "Praise", "service": "Call Center", "description": "I would like to give praise to Mpho Dumiso on your customer service line on 135. I called in for the second time to complain about robotic calls I've been receiving saying my account is in arrears when it's not and I had this confirmed in my previous call. Got through to your consultant Mpho Dumiso who immediately disarmed me with her light-hearted plea for me to not kill her and I can't really put into words just how incredibly personal she made the call feel which immediately made feel like I was being treated like a valued human being and that my complaint would be handled with care and the seriousness I was requesting. She deserves better than to be stuck in a call center, but that's just my 2 cents. I hope she's recognized for this praise, because I rarely take the time out my day to compliment due to how busy I am but I really felt she deserved it. If only ALL your consultants were more like her.", "suggestion": "Recognize and appreciate the excellent service provided by Mpho Dumiso and consider providing her with opportunities for growth and advancement."}, "meta": {"id": 4334165, "created_at": "2023-03-06 19:05:22", "review_rating": 5, "review_title": "EXCELLENT CALL CENTER CONSULTANT", "review_content": "I would like to give praise to Mpho Dumiso on your customer service line on 135.\n\nI called in for the second time to complain about robotic calls I've been receiving saying my account is in arrears when it's not and I had this confirmed in my previous call.\n\nGot through to your consultant Mpho Dumiso who immediately disarmed me with her light-hearted plea for me to not kill her and I can't really put into words just how incredibly personal she made the call feel which immediately made feel like I was being treated like a valued human being and that my complaint would be handled with care and the seriousness I was requesting. She deserves better than to be stuck in a call center, but that's just my 2 cents. I hope she's recognized for this praise, because I rarely take the time out my day to compliment due to how busy I am but I really felt she deserved it. If only ALL your consultants were more like her.", "business_slug": "vodacom"}}
