{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "On 3 January 2023 I contacted Vodacom Cancellations on ********** to cancel my existing contract due to expire at the end of February 2023. I was informed by the lady who took my call that the last debit order would be at the end of February 2023. On 2 March I noticed that this contract has not been cancelled. I AGAIN phoned Cancellations and the woman that answered the call was extremely rude telling me that the no. does not belong to me and said to phone the billing department. I phoned Billing and gave the exact details that I gave to this unmannered woman at cancellations and the lady tried assisting but said I have to contact Cancellations. Another call (and 1 hour later!!!!!!) I spoke to Mvelo who informed me that the contract was not cancelled instead the lady that I spoke to on 3/1/23 cancelled A CANCELLED CONTRACT OF A YEAR AGO!!!!! How incompetent. Mvelo assured me that the matter will be escalated and I will receive feedback with 48 hours. Needless to say, NO FEEDBACK!!!!!!! This is totally unacceptable and I WILL NOT be held liable for Vodacom’s incompetency. Should this matter not be resolved IMMEDIATELY, I will report this to ICASA! As Vodacom’s robot informs you ALL CALLS ARE BEING RECORDED!!!!!!!!!!!!!!!!!!! I suggest you go listen to the recordings AND REVERT BACK IMMEDIATELY. ICASA will be contacted on 8/3/23!!", "suggestion": "Resolve the issue by cancelling the contract as requested and provide feedback to the customer within 48 hours as promised."}, "meta": {"id": 4334509, "created_at": "2023-03-07 08:36:02", "review_rating": 1, "review_title": "Vodacom", "review_content": "On 3 January 2023 I contacted Vodacom Cancellations on ********** to cancel my existing contract due to expire at the end of February 2023. I was informed by the lady who took my call that the last debit order would be at the end of February 2023. On 2 March I noticed that this contract has not been cancelled.  I AGAIN phoned Cancellations and the woman that answered the call was extremely rude telling me that the no. does not belong to me and said to phone the billing department.  I phoned Billing and gave the exact details that I gave to this unmannered woman at cancellations and the lady tried assisting but said I have to contact Cancellations.  Another call (and 1 hour later!!!!!!) I spoke to Mvelo who informed me that the contract was not cancelled instead the lady that I spoke to on 3/1/23 cancelled A CANCELLED CONTRACT OF A YEAR AGO!!!!! How incompetent.  Mvelo assured me that the matter will be escalated and I will receive feedback with 48 hours.  Needless to say, NO FEEDBACK!!!!!!! This is totally unacceptable and I WILL NOT be held liable for Vodacom’s incompetency.  Should this matter not be resolved IMMEDIATELY, I will report this to ICASA!  As Vodacom’s robot informs you ALL CALLS ARE BEING RECORDED!!!!!!!!!!!!!!!!!!! I suggest you go listen to the recordings AND REVERT BACK IMMEDIATELY.  ICASA will be contacted on 8/3/23!!", "business_slug": "vodacom"}}
