{"chatbot": {"related": 1, "evidence": "The complaint mentions the use of the TOBI BOT for the sim swap.", "classification": "Sim Swap", "description": "The complaint is about the sim swap process and the use of the chatbot for the sim swap.", "suggestion": "Improve the sim swap procedure and ensure that chatbots are not used for sensitive transactions like sim swaps."}, "complaint": {"classification": "Sim Swap Fraud", "service": "Vodacom", "description": "The customer experienced a sim swap fraud where their bank account was emptied during the time their number was off. They suspect an inside job from Vodacom.", "suggestion": "Revise the sim swap procedure to enhance security measures and prevent fraud."}, "meta": {"id": 4335067, "created_at": "2023-03-07 11:48:50", "review_rating": 1, "review_title": "Sim Swap Fraud", "review_content": "I have recieved a sim swap notification on my number yesterday. I imediatly phoned Vodacom customer care and strugled to a point where I eventually got connected to a Agent....well I think it was an Agent. She strugled to understand plain English but I got through to her and she said she reversed the the sim swap and flaged my number for future sim swaps. Then the BOMB. the sim swap went through!!!!!! How the hell did that happen????? I used my daughters phone to phone customer care again as soon as I realized that the network was not down its my number that's not working. Now this is where things get weird. I had the best experience with the Agent that help me this time.....I think his name was Kabelo. He spoke A grade english and helped me with ease. He checked my number but could find no evidence of me phoning in that afternoon( How the hell is that possible?) He assisted in giving me relevant information and reversed the sim swap at the speed of light. Very satisfying service from him. He also flagged my number so that no sim swaps could be done without ID verification. Now I wonder and red flags are flaring up in my head.....This had to be a inside job from vodacom. 1. The sim swap was done using the useless TOBI BOT.\n2. All the security questions was verrified.\n3. After reverising the sim swap the first time it was set to still go through.\n4. No records of me phoning in the first time to do the reversal.\n5. My bank acount was emptied in the time my number was off and I hold Vodacom pesonnally responsible for this.\n\nI remember when I was working for vodacom the Security was very strict on sim swaps. How did Vodacom sink so low as to let a robot do a sim swap?\n\nVodacom realy has to revise their sim swap procedure.", "business_slug": "vodacom"}}
