{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Poor service", "service": "Phone and internet", "description": "Signal issues and inability to access the internet for 10 days. Difficulty in contacting customer service. Agent blamed the problem on the customer's device. Instructed to test with another device, which yielded the same result. Wasted 5 hours without resolution.", "suggestion": "Resend network settings for the customer's device to allow reconnection."}, "meta": {"id": 4347384, "created_at": "2023-03-15 15:17:08", "review_rating": 1, "review_title": "Beyond pathetic", "review_content": "The service provider just keeps going from bad to worse. I have not been able to use my phone for the better part of 10 days, the signal has been sporadic at best and I have not been able to access the internet at all. after numerous attempts I eventually had to have someone contact them on my behalf just to speak to an agent (it would appear their customer service # has been adapted to only allow contract subscribers through. \nI've been at it since 10am, it is now 14:49 with no luck, made my first attempt from a contract phone a few minutes ago and I eventually got something other than their useless chat bot, almost immediately).\n I eventually get a call back from an agent named Daniel who then proceeds to patronize me insisting that the problem is in fact with my device and not on their end (\"have you got airtime? is your phone on airplane mode? Are you sure your data isn't finished?\"), making me perform every single action I've already performed 3 times to no avail, I was then instructed to get another phone to put my sim card into to test it as there is nothing wrong on their end so it has to be my device (I guess everybody has a spare device lying around that is 100% compatible with the current one, not sure how because I had to actually get a whole new sim card for this device because the old one simply wouldn't fit).\nI took the abuse and tried what the gentlemen suggested even though I knew there was nothing wrong with my device, and lo and behold... the exact same thing happened when I put my sim card into a colleagues device, proving that there is in fact nothing wrong with my device. So in short I've wasted close to 5 hours just end up back at square one only now I'm back at the bottom of the queue for the very same issue I tried to report at 10:00 am.\n\nThis is beyond pathetic, you don't get to blame this one on load shedding as I am pretty sure this is simply an issue of re-sending the network settings for my device to allow me to reconnect, you simply cant be bothered.", "business_slug": "vodacom"}}
