{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Service", "service": "Caller ID", "description": "Vodacom charges for Caller ID on contract while it is free for prepaid users and on other networks. This prevents the customer from having control over their contract number and protecting their privacy. The customer is being harassed and cannot prove it to the police without Caller ID.", "suggestion": "Provide Caller ID as a free service for contract users to ensure their privacy and safety."}, "meta": {"id": 4357763, "created_at": "2023-03-24 10:28:09", "review_rating": 1, "review_title": "SECURITY BREACH BY VODACOM-\"CALLER ID\"", "review_content": "I understand that vodacom is advanced in their services compared to other networks but chatting with the chat bot is very time consuming and nothing gets resolved. My issue with you is that why is \"Caller ID\" a value added product?!\n\nAll the other networks have this feature, free of charge. You, as vodacom, also have it free of charge for all your prepaid users as well, I am one of them.  Now why is it considered a VAP on contract?\nIn this day and age, with all of these scams, harassments and bullying happening, why would vodacom take away this function from contract users? Now, because I don't have this VAP, that everyone on prepaid has for free, my right to privacy has been taken away because I can't choose whether I want to answer or reject an incoming call or sms, because I don't see who is calling. I can't block a number/caller because the \"Caller ID\" is not available.\nI have an individual that is continuously harassing me and I don't have any control on my contract number to stop it. I also can't prove it to the police because I don't have this \"VAP\".\nWhy is it charged for contract users and not charged for prepaid?!\nI am paying you for my contract but I'm being harassed on your network because you want me to pay an additional fee for \"Caller ID\" which is free for your prepaid users and on all other networks. I'm am angry at you as a company and disappointed that Vodacom, in making their VAP, did not think and consider the risk of such a VAP to a contract user.\n\nKindly advise urgently as I want feedback.", "business_slug": "vodacom"}}
