{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "Good service turning into a nightmare. The customer had a phone call with Vodacom to cancel their contract and was offered a special deal to keep them as a customer. However, when they went to collect the phone and watch, the store did not have the correct stock. The customer then had multiple interactions with Vodacom employees, but the issue was not resolved. The customer received conflicting information and the promised upgrade with the agreed pricing was not processed. The customer is frustrated and wants the issue to be resolved or they will cancel their contract.", "suggestion": "Resolve the issue by providing the customer with the agreed upgrade at the correct pricing or allow them to cancel their contract without any penalties."}, "meta": {"id": 4363202, "created_at": "2023-03-28 15:15:05", "review_rating": 1, "review_title": "Good service turning into a nightmare", "review_content": "I phoned Vodacom Friday the 17th of March to cancel my contract as I wanted to port my number to Cell C. The reason for this is that I could get the same contract (that Vodacom charges R2438 per month) at Cell C for R1719 (at Cell C this included 3 000 minutes, 10GB Data, a Samsung S23 Ultra and a Samsung Galaxy 5 Watch). The consultant that was on the phone did not want me to cancel as I've had this contract with Vodacom for more than 20 years already. He asked what the reason for the cancellation was and I told him. He asked me to hold on to see if they can possibly match the deal. I heard him talking in the background (I assume to one of his supervisors), after a while he came back and said they can offer me the Samsung S23 Ultra, Samsung Galaxy 5 Watch, Unlimited minutes and 15GB data for R1878 per month. I reckonded this is a good deal and it will save me the hassle of having to port to another service provider, so I accepted the offer. He then offered to deliver the phone and the watch, but I am not at home / at the office a lot, and giving someone else a certified copy of my ID to receive the delivery on my behalf is apparantly not an option either, so I asked to arrange to collect the phone and the watch on Tuesday 21 March at Waterfall Mall in Rustenburg. This was agreed to. I asked him to repeat all the details of the upgrade which he did at least 3 times. I then asked him if he should not perhaps check with the store if they do have stock, as I do not want to go there and then find out they have no stock. He assured me that they do have the stock and will keep it for me. So far so good, what a wonderful experience and great customer service convincing a customer wanting to cancel his contract to keep him and offering him a good deal.\n\nOn Monday 20 March, I phoned Vodacom Upgrades again to confirm that all is in order for the collection at Waterfall Mall in Rustenburg. The consultant confirmed that the upgrade has been processed as discussed.\n\nNow this is where the disappointment kicks in......\n\nOn Tuesday 21 March, I went to Waterfall Mall in Rustenburg as arranged (they have 2 Vodacom shops in the mall). I arrived at the first shop and guess what.... They only had the S23 Ultra in Lavender (I asked for black) and they did not have the watch in stock at all. The second shop in the mall did not have stock of the phone or the watch. I then phoned the shop in Rustenburg Mall, and surprise surprise, they do not keep stock of the phone, they only order it in once a customer requires one. By now I am starting to get a little frustrated. I phoned Clearwater Mall in Krugersdorp and yippee they do have stock of the black S23 Ultra, but not of the watch. I said it's ok, I will collect the watch at a later stage.\n\nPart 2 of the dissapointment begins when we arrived at Vodacom Clearwater Mall..... I walked in and told the entire story to the consultant. She asked what device I want, what contract, etc etc etc, why I do not understand, as everything have already been captured, I am just there to sign the upgrade and collect the phone. She then asks me if I want the contract on 24 or 36 months. On the phone doing the upgrade, I clearly understood that for Vodacom to give me that deal, they will have to do it on a 36 month contract, which is fine, because the deal from Cell C (for R1719 per month) is on a 36 month contract as well. She then tells me on 36 months, the monthly price will be R2438. I think she saw the disbelief on my face, but I kept my composure and told her nicely : \"No, that is your normal price and that is the reason I wanted to cancel the contract, but on the phone when I wanted to cancel, the consultant arranged a special deal to keep me as a customer\". She went into the profile and printed the upgrade quotation (which for some reason has now been deleted). Now on the cancelled upgrade (for R1878), the consultant only chose a normal S23 Black and not the S23 Ultra like I told him and he confirmed between 5 - 10 times. I told the agent that is the contract I want, but with the S23 Ultra and not the normal S23. She advised that she can give me the same deal in store (with the normal S23), for R1899. What is wrong with the staff at Vodacom, can't they hear the word Ultra????????? I don't want the normal S23, I want the S23 Ultra. After explaining this very calmly to her, she told me then she can't help me, but she sees the upgrade was processed by the Rewards department, and perhaps if I phone them they can sort it out, but I should be careful as this is exactly what they do (promise you one thing and then deliver something else) and then you will have endless problems sorting it out..... Well it seems this was only the beginning of all my problems.\n\nOn my way home I then phoned Vodacom Upgrades again. I asked to speak to the Rewards department. Apparently this is not possible, so I do not know how they managed to process my upgrade in the first place if I can't speak to them. I then explained the situation to the Upgrades Consultant, but she will try to get hold of them and sort this out. Why can you speak to them, but I am not allowed to. He / she (I can't remember anymore to whom I spoke to, as I spent half the day talking to Vodacom employees), then said that a service request will be logged with the Rewards department as it seems they are closed on a public holiday as she can't get hold of them. I received the sms with the service request number. She told me they will listen to the call recording of the 17th of March and give me a call back between 48 and 72 hours. I knew I was spending a lot of time trying to sort this out, but didn't know that it will take them 2 - 3 days to listen to a 30 minute call recording.\n\nI then decided I will wait patiently, and still belief that somehow they will get the recording (which is the first thing you should notice when you speak to them that all calls are recorded) and see somewhere someone made a mistake and just upgrade my damn contract with the pricing as agreed on over the phone. \n\nBy Thursday 23 March (48 hours later), I received my next sms stating that my request is now being processed and should be resolved by 17:00 on the 28th of March (this is another 5 days). Ok, I decided I will give them the weekend to try and figure this out, but hey they managed to act very quickly as I received another SMS on Friday 12:18 saying they are very optimistic that I enjoyed their service experience and the support ticket is now closed. Really, do you really think I enjoyed this service experience, and now the ticket is closed with absolutely nothing done about it. I did not even get a phone call, the ticket was just closed.\n\nI decided that I will go into the weekend and get as far away from a Vodacom signal as possible, maybe I will feel a bit better on Monday, or perhaps something stranged happened over the weekend and by Monday someone with some common sense will walk into the Vodacom Call Centre and answer the phone when I phone them again and start this entire process from scratch.\n\nSo I had a wonderful weekend and by around midday on Monday I decided to take on the dreadful task of calling Vodacom Upgrades. I am going to keep this part short, as it was a real long and painful experience.\n\nI started by explaining the entire situation above (took me about 20 minutes) to the consultant. She then said, no problem she can do the upgrade for me, the monthly cost will be R2438 per month. Really, did you not listen to a single word I just told you? I then asked her how can I get the call recording to take this up with the legal department. She said she will transfer me and I must select option 2. I did exactly as she told me to, unless I have been **** to my entire life and the number 2 is not the same as the word two. Anyway, after pressing 2, I was connected to cancellations. Explained the entire situation again, and guess what, they can't help me because I have reached cancellations. I should phone ********** and select option 2. And guess what department is that..... Maybe you guessed right, it is cancellations. Looks like all the departments that you want to contact is **********, option 2. \n\nSo now I am really frustrated, about another hour wasted on Vodacom. I decided maybe I should rely on technology and sent a Whatsapp to Toby (the Whatsapp chatbot). After going through the options, I was contacted by an Upgrades consultant. I told her I am not going to repeat myself again. They must look at the service request logged and give me my upgrade at the agreed price or cancel my contract. She quickly told me that this was processed by retentions and she will give them a call. After about 5 minutes, I was then connected to the retentions department. This lady seemed on top of it, as she knew exactly what my problem was and told me the service request was mark as resolved because the upgrade was cancelled (yes it was cancelled because the incorrect device was loaded), but maybe if you phoned me you would've known this. She sincerely apologized and promised to have an answer for me within 24 hours. About 1 hour later, I was called back and told that Vodacom will do a Deal Match, asking what this means, I was told Vodacom will give me exactly the same deal as Cell C (Samsung S23 Ultra, Samsung Galaxy 5 Watch, 3000 minutes and 10GB data for R1719). WOW, eventually someone with some common sense rocked up at Vodacom. I was told that the upgrade will now be processed and they will call me back.....\n\nWell, this morning I received a call back, and guess what. Now they can't do the deal match anymore, the best Vodacom can offer me is that contract at R1978, but without the watch. I then said, just leave it and transfer me to cancellations, as I have really had enough now and just want to cancel and port to Cell C. It's been 11 days already and you can still not sort this out. When I spoke to cancellations, once again I was told, I am so sorry about this, and I know you have heard this before, but please can I sort this out for you...... So here I am now, still waiting to have it sorted out. \n\nIf this is not sorted out by close of business tomorrow, I will cancel my contract (if at all possible, maybe I will manage to get this done in less than a month) and I will go to Cell C, MTN, Telkom or maybe even just get myself a homing ***eon to get my messages delivered, but I will not stay with Vodacom any longer after tomorrow if this is not resolved.", "business_slug": "vodacom"}}
