{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Poor Service", "service": "Vodacom", "description": "Vodacom used a used or demo laptop for a new contract deal and provided horrible service. The customer had multiple issues with their contract sim card and faced rude behavior from the staff at the Carnival Branch. The laptop provided by Vodacom requires a password and the customer has been unable to get assistance from the after-sales and customer service teams. The customer is requesting the cancellation of the deal and the return of the used laptop.", "suggestion": "Vodacom should improve their customer service, ensure that new devices provided are not used or demo units, and promptly resolve customer issues."}, "meta": {"id": 4373133, "created_at": "2023-04-04 15:10:01", "review_rating": 1, "review_title": "VODACOM USED LAPTOP FOR A NEW CONTRACT DEAL AND HORRIBLE SERVICE", "review_content": "If I could I would give vodacom a miuns 20. really I am very angry and disappointed. No one at vodacom cares anymore not sure if they changed managed or what but the staff does not care. Past few weeks have been nothing but pain. I had issues with my contract sim card. Went to the Mall at Carnival Branch I was turned away 3 times the 4th time I went there they wanted to turn me away again. 1st time they told me that I must come before 5pm after 5 pm their rica system for contracts does not work. 2nd time they told me it was loadshedding cool tried understood. 3rd time they turned me away again telling me that they had ****** cables requested that they sell me the sim cards I will rica myself. Thats what your twitter team advised me. They refused saying they not allowed to sell sim cards to client and not rica them wow okay. the 4th time I went there the lady wanted to turn me away again telling me there was loadshedding earlier on their system is still back. I refused told her I am not buying that cause this was the 4th time. Walla out of no where they could assist me. But the lady helping me was so rude she was busy on the phone without excusing themselves or asking for permission to make a call while I sat her and she did what she did.\n\nfast forwards your rewards centre call me and offers me a laptop mecer move perfect I accapt the deal and I am all good. waited for delivery. I recieve delivery today. Open the device try to switvh it on boom the device says that it wants a password.Just as I switch it on it shows username defaultuser0 and asks for password. So vodacom gave me a used laptop or demo laptop that they were using for God knows what. And i must take up that deal pay 399 every month for the next 36 months. I call the after sales team for the passowrd they tell me to call the customer service. service team they know nothing they cut the cal. I call customer service again spent almost 20 to 30 minutes on the line with the lady who then said she is putting me onhold to get help on to cut the call. In my world thats a dismissable offence. I call after sales team to request that they come take their used laptop and cancel the deal, the guy said he was arranging for that kept saying I will get a collectionsreference number almost 2 hours later I still have not recieved the sms. Tried to reach out to your twitter they are just robotic and useless. Am I suppose to call vodacom again and ask for the collection reference number? The service is poor. You honestly do not care. I used to love adore vodacom but the past montn has been a nightmare and have no choice but to gradually cancel everything with them. I know my business might be a drop in the ocean. But I am human I deserve proper service and respect but lately vodacom has done nothing but abusive.", "business_slug": "vodacom"}}
