{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "", "service": "Vodacom", "description": "I have been experiencing data loss and slow download speeds with Vodacom. I have lost a significant amount of data due to failed downloads. I am frustrated with the lack of customer support and the inability to speak to a human representative. I suspect that Vodacom is intentionally deducting more data than necessary. This issue has been ongoing and I have not received a response from Vodacom.", "suggestion": "Vodacom should investigate the data loss issue and improve their customer support. They should ensure accurate data deductions and provide a solution for failed downloads. Prompt and effective communication with customers is essential."}, "meta": {"id": 4423357, "created_at": "2023-05-14 18:29:37", "review_rating": 1, "review_title": "******s of Pretoria Zoo. Don't take up the position of Vodacom directors as you may find yourself in jail, despite the fact that you will out do your predecessor's by far.", "review_content": "Once again Vodacom *****ing from us. I have been in JHB General now for 5 days and will most probably be here for another 21 days. In these five days I have averaged 2 gig a day. Of which I have lost at 30% if not more from downloads that seem to fail not as they start. Not half way , but at the end. . \nI am not even bothering to try contact Vodacom because I refuse to speak to a robot that doesn't understand and leads you in circles in the hope that you will give up and sweep it under the rug. \nAnd guys my last review apologies to the Pretoria zoo ******s for nominating them as the board of directors of Vodacom . Really guys don't take these positions as you may end up in jail for theft as they have been *****ing like in my last review Vodacom is *****ing Billions from us South Africans because for every 1 mb I downloaded 2 mb came off. . \nMysteriously the next day it was fixed and my downloads became accurate and now I find they just adopt another method. The thieving *******s are worse than our government. . They should all be jailed together. Now I find my self tonight not being able to complete my downloads due to our friends raking in my data and it's so weird that it happens everyday exactly the same way. I download for example two files of say 150 mb each and the download speed is terrible slow and I keep my phone doing absolutely nothing else so that I don't mess with them . As it's getting to the end 45 minutes later all of a sudden one download fails and dissapears and when I go to the Vodacom app the other one goes. Like tonight I was fortunate to have enough data to download one of the files I started and what would happen when I initiate the download. Zim zalla bim it downloads the entire 150 mb in less than 3 minutes done. But now I can't down load the other file because these *******s have ****** my data. Other nights I was not fortunate to have data to download the files again. \n\nAnd surprise surprise, I always get a email from Hello Peter saying Vodacom has responded and I am still waiting from the first review. \nBecause Vodacom are confounded ****'s. \nThey never get back to me . I mean I even leave my number for them**********", "business_slug": "vodacom"}}
