{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Refund Struggle", "service": "Cell C", "description": "I have been fighting with Cell C since the 4th of May to return my money and process a refund. I have spoken to about 17 different people until today. The refund process has been delayed and I am struggling to feed my kids and pay for essential expenses.", "suggestion": "Cell C should expedite the refund process and provide better communication and support to customers."}, "meta": {"id": 4445175, "created_at": "2023-05-30 11:16:00", "review_rating": 1, "review_title": "Cell C - Refund Struggle", "review_content": "This is going to be a long post. \n\nHowever I need to expose how useless Cell C are with their service. How I continue to struggle to get my money back. \n\nI have been fighting with Cell C since the 4th of May to return my money and process a refund. \nOn the 23rd of May , I was at my wits end. I posted on Hello Peter with a complaint. \nI got a \"Private\" response, so I wanted to post what Cell C has done to assist me, publicly. \n\nMy original post said the following ( Posted 23rd May 2023) \n\nPathetic service , Theives , Emotionless , Robots , Script readers, Useless , inompetant staff. \nI have been fighting with Cell C since the 4th of May to return an amount of R1400 that they debited off my account after an EFT payment was already made on their instruction. \n\nI have spoken to about 17 different people until today. The sequence of events between then and now is as follows. \n1. Was told to send proof of payment - no response \n\n2. was told to send proof of payment again, - no response\n\n3. I was told to email collections. No response \n\n4. phoned call centre, and was asked to email proof of payment, I also added in my banking statement so they could see what i was referring to for extra clarity. \n\n5. getting desperate now , running low on food money , I call again, and eventually on the May the 15th somebody with a brain cell , raised a refund ticket for me, I was told someone would be in contact with me within 2 days  - no one phoned. \n\n6. I followed up the next day , I was told that the refund would be escalated but this process takes 72 hours. \n\n7. Friday 19th of May I eventually demanded to speak to a manager , who also was not very helpful, His name is Tshepho , he said the process takes 10 business days, ( not true I looked on their company site and its 7 working days ) he just said he had marked my refund as urgent in a mailbox. yes in a mailbox with 5000 other emails. I have almost no money at this point. I need electricity as I work from home, I need food to feed my kids, I need fuel to get them to school. No one cares. they dont care. \n\n8. Monday 22nd May - I phone early in the morning and asked to speak to Tshepho the manager from Friday. I was told he will phone me in ten minutes that was at 8:39am. I phoned the call center back at 11am , who then said they are transferring me to him  but instead I was on hold for 39min  until eventually I dropped the call. I eventually got hold of Tshepho , and all he could say was he can see its in the approval process. Not once has anyone offered to take ownership and keep me updated. \nI burst into tears begging that he help me , I need to feed my kids. \nIts almos time for the next debit order run. He doesnt care, he cant go the extra mile, he said he has not contacts in finance to call and ask for assistance. We had bread for supper last night. \n\n10. Its Tuesday the 23rd of May , I call again at 10:30am this morning, I ask to speak to Tshepho , I am told he is on lunch, but I must not worry he will phone me back as soon as he gets in. You guessed it , its almost 4pm and no one has called me. I phone back at 3pm this afternoon , I am told that they can see that the refund has been approved, but that does not mean that the money is on its way to my account. Keep in mind today is the 7th working day since I raised the refund ticket. The lady tells me that it takes 7 days after the refund has been approved. \n\nI feel defeated. I have no food in my house, both my kids went to school hungry today , I have almost no fuel left in my car , I have 8 units of electricity to last me until I get paid. \n\nHow is it that you F&*&(&(*&*& C(*&()*&)*(&)(*7 can affect my life like this ? Emotionless. YOU STOLE MY FOOD MONEY TO FEED MY KIDS THIS WEEK. NO BODY CARES THAT YOU HAVE KIDS TO FEED AND TO BE ABLE TO WORK. \n\nI AM AT MY WITS END, PLEASE CAN SOMEONE DO SOMETHING. THIS IS REDICULOUS TO FIGHT FOR WHAT IS MINE. \n\nYOU DID THIS NOT ME . YOU HAVE CRIPPLED ME THIS MONTH YOU STUPID TWITS. \n\nCAN SOMEONE IN CELL C WAKE UP AND FIX THIS . YOU CANNOT GET THROUGH TO ANYONE THAT IS ABLE TO ACTUALLY HELP YOU. \n\nITS WORSE THAN GOING THROUGH A DRIVE THROUGH AND ASKING FOR THE LETTUCE TO BE REMOVED, BUT INSTEAD THEY REMOVE ALL THE GARNISH, YOU ARE WORSE !!! \n\nHOW ON EARTH MUST I FEED MY KIDS THIS WEEK.\n\nResponse Cell C : \nGood day\n\nPlease accept our sincere apologies for any inconvenience caused by this.\n\nOur records indicate that a refund was prepared today (23/05/2023).\nThe refund takes anytime from 3 to 7 working days to reflect in your account.\n\nMy reply: \nExactly , another 7 days , what the hell . Again, what about the fact that you took it from me on the 4th of May  and I have been fighting for my money back. How must I feed my kids  ?  Another example of a half scripted answer. No one is willing to push this through or try to make a call and escalate , as a result of an internal error , in other words make it right. I am your client after all.  As I said no one gives a f**k right ?  Let me go tell my kids that unfortunately there is still no money. You have caused my kids and myself to go hungry this month because you are idiots, now you just go and put your foot in it and say the same thing I am complaining about. How can you tell me its another F**king 7 days. Do you have children ? \n\nResponse Cell C: \nPlease receive our apologies for the unpleasant experience received thus far, \n\nThe refund has been prepared and the funds will reflect within 7 working days.\n\nMy reply: (Same day 23.05)\nPlease confirm exact date of payment ? Surely you can make a call and confirm , please I beg you \n\nResponse by Cell C: \nUnfortunately, we cannot confirm the exact date of payment.\n\n30th of May 2023: \nI have just called Cell C , I was just told that there was nothing they could do for me if the refund has been approved. \n\nI educated the agent on the process of escalation. After being put on hold for another 3 minutes, I was told she will escalate for me to the escalations department. \n\nGuess what. The escalations department has 72 hours to get back to me. Another 3 days to wait for feedback. Are you kidding me ? \n\n4 - 15th of May = 8 days of continously emailing and phoning until eventually being told to log a refund ticket. (Business working days) \n\n15 May - 23 May = 7 business workiung days to process a refund \n23 May - to date  = 6  business working days and counting ......\n\n21 Business Working days dealing with Cell C to get my refund sorted. \n\nand now you want to tell me another 3 days to have it escalated.", "business_slug": "cell-c"}}
