{"chatbot": {"related": 1, "evidence": "The customer mentioned contacting Vodacom Tobi Chatbot and described it as unhelpful.", "classification": "Poor customer support", "description": "The customer complained about the unhelpful response from Vodacom Tobi Chatbot.", "suggestion": "Improve the chatbot's ability to provide helpful and accurate responses."}, "complaint": {"classification": "Poor customer service", "service": "Vodacom", "description": "The customer's sim card was deleted despite being active and loaded with airtime and data. The customer was unable to reach a live agent through the customer care line or Twitter support.", "suggestion": "Review the sim card deletion policy and improve customer support channels to ensure customers can easily reach live agents for assistance."}, "meta": {"id": 4448339, "created_at": "2023-05-31 19:52:52", "review_rating": 2, "review_title": "Vodacom Horrible Customer Care Service-Deleted Active SImcard", "review_content": "Vodacom had a sim card policy to delete a sim card that is inactive for a period of 120 days. On Sunday, 28th of May 2023, Vodacom deleted my sim card which has been active for the past 6 years and was last active on the 27th of May 2023 at 22:00 loaded with airtime and data of R600-00. I contacted Vodacom Tobi Chatbot, it simply gave me an unhelpful answer. I then contacted the Vodacom customer care line, and the answering machine said \"Enter the number you are querying\". After I entered the number, it answered: \"We can't recognize your number\". There was not even an opportunity to talk to an agent. I then contacted Vodacom support on Twitter. The machine on Twitter was as unhelpful as Tobi the Chatbot. The Vodacom support simply said, \"The number has been deleted because inactive sim cards are deleted as per Vodacom policy. Then it sends me the link to the Vodacom terms and conditions website. \nAll the numbers which Vodacom provided were just so unhelpful and left me frustrated because I was spending almost R1000-00 every month on Vodacom services. \nTobia CHatbot is a horrible Vodacom support and so is their Twitter Support.\nI can imagine how many sim cards are erroneously deleted by Vodacom and people who forfeit their data and airtime because of such bad customer support.", "business_slug": "vodacom"}}
