{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "Vodacom blocked my sim after I requested to go back to prepaid after my contract ended for no valid reason. I received an SMS stating that my sim was now prepaid, but when I tried to make a call, my sim was blocked. I contacted Vodacom customer care and was told to go to the Vodacom store to get my sim Rica'd and re-registered, even though I have been a Vodacom customer for 10 years. The Vodacom store was unable to help me and my sim is still not working.", "suggestion": "Vodacom should resolve the issue with my sim being blocked and ensure that I can make calls as a prepaid client."}, "meta": {"id": 4448209, "created_at": "2023-05-31 17:50:48", "review_rating": 1, "review_title": "Vodacom Blocked My Sim After I Requested To Go Back To Prepaid After My Contract Ended For No Valid Reason", "review_content": "I ended my vodacom contract and the contract is supposed to end 31 May. This morning I received an sms stating that my sim was now prepaid. After that I bought 60 anynetwork minutes as I had to make an Urgent call only to find my sim is blocked and I cannot make calls anymore. I keep receiving an automated vocemail  message saying my sim is blocked and I should contact my service provider everytime I try to make a call. I cant even call Vodacom customer care (the actual service provider) . I had to get a robot \"Tobi\" to actually help with getting someone from Vodacom to call me. The consultant I spoke to told me I had to go to the Vodacom store to get my sim Rica'd and re registered, after 10 years of Vodacom having my details on file I must still go to Vodacom to rica my sim. Does Vodacom only allow contract sims now. Can we no longer be prepaid clients? Cos I just came from the vodacom store and they told me my number is not on the system where it requires me to rica again and they did a network boost or something like that which another consultant already tried to do. Did I just go to the Vodacom shop for NOTHING!!!?? My sim STILL not working. I STILL cannot make calls. Only because I changed from contract to prepaid. IS vodacom a ****?", "business_slug": "vodacom"}}
