{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "Vodacom deleted the customer's cellphone number and their bank account was hacked.", "suggestion": "Investigate the deletion of the customer's number and provide proper support for resolving the bank account hacking issue."}, "meta": {"id": 4453087, "created_at": "2023-06-04 22:00:21", "review_rating": 1, "review_title": "Vodacom Delete Numbers is a **** to Withdraw Money from your Bank Account", "review_content": "On the 30th of May 2027, Vodacom deleted the cellphone number I have used for the past 6 years and which I actively used daily for all transactions, banking, internet logging, making daily calls, and many more. Although Vodacom offers 99% coverage, their customer service care offers only 1%. Tobia Support offers no alternative to talk to the agent. In my opinion lacks any common sense nor intelleigence. The second customer care line is 082135 which simply is a machine prompt simply like Tobi. It keeps asking you to press 1 or 2 or 3 with no choice to be able to talk to a human being who may seek to understand what really transpired. Vodacom Twitter Support is another Tobia support with no heart or care.  These Vodacom chatbots write some narcissistic sympathetic messages such as \" We are sorry for the inconvenience this might have caused you...\" and with no real sympathy at all. How does a reputable company like Vodacom delete a number which has never been inactive for more than even 24 hours yet these Vodacom support chatbots will send the \"Vodacom Terms and Conditions\" violated by the same company?\nThe night my number was deleted, it's the same night my standard bank account was hacked and R1600 was transferred from my account. My Vodacom number was deleted, yet the same number was activated to authorize transactions from my bank account. And the only help and assistance or support I could get from Vodacom support was to buy a new sim card and register it.", "business_slug": "vodacom"}}
