{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Vodacom", "description": "Vodacom blocked and suspended my number after migrating back to prepaid. I have been unable to make calls and have been seeking assistance from Vodacom store and customer care, but with no resolution. The employees provide conflicting information and transfer me to the wrong departments. The chatbot, Tobi, ends the call without providing assistance. I am frustrated with the lack of support from Vodacom.", "suggestion": "Please activate my number so that I can access my bank details. Once the issue is resolved, I will consider terminating my Vodacom service due to the poor customer support."}, "meta": {"id": 4455291, "created_at": "2023-06-06 09:47:00", "review_rating": 1, "review_title": "Vodacom Blocked My Sim Just For Mograting Back to Prepaid and now no one can assist me since I am a prepaid customer. They suspended my Sim for  NOTHING. PLEASE ASSIST", "review_content": "Vodacom can no longer assist me as I have now migrated back to prepaid from a contract. Vodacom just blocked and suspended my number and now I can't make calls all because I asked to go back to prepaid. I have been going to the Vodacom store and calling customer care since last week all to no resolution. The employees at Vodacom keep telling me 5 different things and transferring me to the wrong departments. Your robot Tobi just ends the call and says he can't assist. Do you even train your employees ? Why is everyone at Vodacom failing to assist me ? Do I have to be a celebrity to get some assistance from Vodacom ? All they keep telling me is my contract is upto to date. I have no liabilities but since I am prepaid they can't help me. So now that I'm on prepaid I can't use me Sim and number ?  Really? What's with the horrible service. Can someone just activate my number so that I can get my bank details in order then once all is sorted I will seize to be a vodacom customer since you fail to assist me.", "business_slug": "vodacom"}}
