{"chatbot": {"related": 1, "evidence": "The complaint mentions bots answering the phone", "classification": "Customer service", "description": "The customer is complaining about the use of bots to answer calls and the lack of availability of customer care agents", "suggestion": "Improve availability of customer care agents and provide a more efficient way for customers to get assistance"}, "complaint": {"classification": "Billing", "service": "Vodacom", "description": "The customer is complaining about being billed almost twice the amount they signed up for and the lack of response to their email", "suggestion": "Provide an explanation for the increased billing and improve response time to customer queries"}, "meta": {"id": 4459963, "created_at": "2023-06-08 13:37:55", "review_rating": 1, "review_title": "VODACOM AVOIDS CONSUMER QUERIES BY USING ROBOTS TO ANSWER CALLS...", "review_content": "Vodacom is unbelievably unavailable when customers have queries. These bots that answer their phones are just a barrier that they are creating to rip people off. I'm trying to get an itemized bill for my vodacom account because they are billing me almost twice the amount that I signed up for. So yes I paid but I sent an email with clarity seeking questions more than a week ago, to date they have not rep****. I'm trying to call their customer care line and it's only bots that answer the phone and there's just no call centre agent available because their lines are just \"too busy\" according to these bots .. Really??? Its laughable. \n\nWhat is it with these network businesses? Its not the first time i experience this, i moved to vodacom thinking that I'd get better service and I'm grossly disappointed, when you're billed more than you signed  up for  there must at least be an explanation. In the absence of an explanation, it is THEFT. You sell a package that the consumer is comfortable to pay then suddenly you bill them for twice this amount, when they seek an explanation you are simply nowhere to be found. When Vodacom sells you products, they don't send bots to talk to you but when a client wants to query a bill, they have bots on the line. This is unacceptable. If this persists, we will have to establish an online campaign against vodacom on all social media platforms. Consumers cannot continue to be ********** like this! It's not right.", "business_slug": "vodacom"}}
