{"chatbot": {"related": 1, "evidence": "The complaint mentions the possibility of getting an AI bot response", "classification": "Customer service", "description": "The customer is complaining about the difficulty in speaking to a human and receiving conflicting or no information", "suggestion": "Improve the customer service by ensuring that calls are properly directed and that accurate information is provided to customers"}, "complaint": {"classification": "Appalling service", "service": "MTN", "description": "The customer describes MTN as one of the worst service providers they have dealt with, mentioning difficulty in speaking to a human, misdirected calls, conflicting information, and lack of follow-up", "suggestion": "Address the customer's specific issues and improve the overall service quality to prevent similar complaints in the future"}, "meta": {"id": 4478296, "created_at": "2023-06-22 07:33:15", "review_rating": 1, "review_title": "Appalling service", "review_content": "MTN, in my experience, has to rate as probably the very worst service provider I have ever had the misfortune to deal with, and right up there with Telkom and ADT. Without going into specifics, because it would take too long, MTN, for me, incorporates huge difficulty in speaking to a human to start with, then it is almost impossible to speak to the right human amongst calls being misdirected, those on the receiving end having conflicting information or supplying no information, and then, after applying tenacity of an almost impossible degree, amongst dropped calls, to be told that someone would definitely come back to me as the problem has been escalated, and then deathly silence. Let's go 135 again and set aside a day, I say. After three hours I valiantly admit defeat. You win, MTN. I need to now extricate myself from a debit order and change service providers which should take possibly another two or three days of effort. However, MTN, you will receive the very worst feedback from me to everyone I know, unfortunately. I have no doubt that this email will either be ignored or I will get an AI bot asking me for my name and number and to explain my problem.", "business_slug": "mtn"}}
