{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Incompetence and Deceit", "service": "MTN", "description": "In March 2023 I approached MTN for a Pay as you go LTE until my fibre is installed. I paid upfront R1982 for the LTE Modem and bought two months unlimited data. I made sure to tell the assistant it should be a month to month, but they insisted I sign a contract. My Fibre installed in May and now MTN phones constantly for an arrears account. I explained the situation, they requested I contact the Alberton Branch to cancel the \"contract\" Alberton says they are unable to cancel the contract. Today alone I had 6 phone calls from a robot requesting payment. In the last week there was approx 11 agents from MTN that phoned and harassed me for payment. I explained the scenario over and over. Thus was told to cancel the contract, but nobody will assist me. People warned me before I got myself into this mess, and said MTN will eventually blacklist me over their incompetence. I sent to emails to MTN Customer complaints but have not received any feedback. Even when you phone they transfer you from accounts to cancellations and all of the relevant departments pass the buck. STAY away from MTN", "suggestion": "MTN should provide better customer service and resolve the issue promptly."}, "meta": {"id": 4487635, "created_at": "2023-06-28 13:12:00", "review_rating": 1, "review_title": "MTN Incompetence and Deceit", "review_content": "In March 2023   I approached MTN for a Pay as you go LTE until my fibre is installed.\nI paid upfront R1982 for the LTE Modem and bought two months unlimited data.  I made sure to tell the assistant it should be a month to month , but they insisted I sign a contract.  My Fibre installed in May and now MTN phones constantly for an arrears account.  I explained the situation , they requested I contact the Alberton Branch to cancel the \"contract\" Alberton says they are unable to cancel the contract.  Today alone I had 6 phone calls from a robot requesting payment.  In the last week there was approx 11 agents from MTN that phoned and harrased me for payment.  I explained the scenario over and over.  Thus was told to cancel the contract , but nobody will assist me.  People warned me before I got myself into this mess, and said MTN will eventually blacklist me over their incompetence.   I sent to emails to MTN Customer complaints but have not received any feedback.  Even when you phone they transfer you from accounts to cancellations and all of the revelant departments pass the buck.  STAY away from MTN", "business_slug": "mtn"}}
