{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Customer Service", "service": "Telkom", "description": "Telkom has been charging me an incorrect amount for more than 2 years. When I tried to resolve the matter, I received no assistance. The branch personnel and telecommunications said the issue needs to be resolved with the accounts department. After months of back and forth, I still haven't received a solution. To add...I took up a contract with Telkom contract with a sales rep at the store, on the contract it states the contract is for 24 months while the system says it's for 36 months. I am now receiving messages to say I am going to be handed over to lawyers and I will be blacklisted. Telkom is an absolute waste of money and energy. The deals are enticing but the service is disgusting. There is NEVER anyone who can assist and every number you call gives you a voice prompt with a self-help service. Is this a robot company who only has automated services with no personal concern?. The staff at the outlets are just the same as your self-help options, they can do nothing, provide no information, and claim to be working independently, hence they themselves cannot contact anyone when there is a problem. Your company is the first to black first and threaten to hand the client to legal authorities but you cannot fix your mistakes.", "suggestion": "Improve customer service by providing better assistance and resolving issues promptly. Ensure that contracts and system records are aligned to avoid confusion and incorrect charges. Train staff to be more knowledgeable and helpful. Improve communication channels to allow customers to easily reach a representative for assistance."}, "meta": {"id": 4507260, "created_at": "2023-07-11 12:38:39", "review_rating": 1, "review_title": "No service", "review_content": "Telkom has been charging me an incorrect amount for more than 2 years .When I tried to resolve the matter ,I received no assistance.The branch personal and telecommunications said the issue needs to be resolved with tha accounts department .After months of back and forth I still haven't received a solution .To add...I took up a contract with telkom contract with a sale rep at the store,on the contract it states the contract is for 24months whilst the system says its for 36 months. I am now receiving messages to say i am going to be handed over to lawyers and i will be blacklisted.Telkom is an absolute waste of money and energy .The deals are enticing but the service is disgusting. There is NEVER anyone who can assists and every number you call gives you a voice prompt with a self help services .Is this a robot company who only has automated services with no personal concern?.\nThe staff at the outlets are just the same as your self help options they can do nothing,provide no information  and claim to be working independently ,hence they themselves cannot contact anyone when there is a problem.Your company is the first to black first and threaten to hand the client to legal authorities but you can not fix your mistakes.", "business_slug": "telkom"}}
