{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Poor Service", "service": "MTN", "description": "MTN provided a poor service with unreliable coverage, a router that was not load-shedding proof, and did not deliver on promised features such as fast 5G and uncapped Wi-Fi without throttling. Customer care was unhelpful and automated responses did not solve any problems.", "suggestion": "MTN should improve their coverage, provide routers that are truly load-shedding proof, deliver on promised features, and provide more effective customer care."}, "meta": {"id": 4514618, "created_at": "2023-07-15 13:42:15", "review_rating": 1, "review_title": "MTN HORRIBLE UNCAPPED DATA ****MING SYSTEMS", "review_content": "I received a call from a telemarketer regarding an uncapped non-contract pay as you go data contract offered by MTN. The lady promised that the promotion was non-biding and not a contract. She further promised that the router to be supp**** is load-shedding proof, meaning that it would not be affected by load-shedding and it is self-reliant. I noted my concerns regarding MTN coverage in our area that is was always poor but she insisted that her system and the router had a strength power to ensure we get the best uninterrupted and uncapped wi-fi signal for our family.\nI requested her to send me the contract first via my email but she promised that I could cancel the contract any time within 14-days if I am not satisfied. \nThe router was delievered with a sim-card (mtn) and to my amamzement, the router was like any other normal router which had no back-up supply. The router failed  the loadshedding proof.\nWe started to be 5 -days without signal from our router which is normal for MTN coverage in the Zeerust Northwest. \nIn February 2023, I requested MTN to cancel my service because it was the worst service I ever had. I was paying R524-00 monthly by would only have 4 days per week on average coverage. The router provided me with the worst experience, however MTN customer care would only provide me with sweet automated messages as if they really care.\n\nI send them a notice of cancellation of the contract because it was not worth it. It was not\n\n1) Load shedding proof\n2) fast 5G as promised\n3) worth to supply me with uncapped wi-fi without throttling.\n\nMTN customer care acknowledged my letter but later reverted back to me that I cannot cancel my contract which was a PAY as You Go. They notified me to pay an early cancellation fee of R2500-00. \n\nThey are still debiting my account for R542-00 every month since the notification period which is a violation of the contract terms. \n\nCalling MTN customer (horrible) care is waiting for 30 minutes on the phone which is not worth it. Sending them emails is writing to an automated ChatBot system that provides horribly scripted responses of sweet messages which never solve any problem.", "business_slug": "mtn"}}
