{"chatbot": {"related": 0, "evidence": "", "classification": "", "description": "", "suggestion": ""}, "complaint": {"classification": "Poor Service", "service": "Vodacom", "description": "The customer had a difficult and frustrating experience with Vodacom's fiber service. They faced multiple delays, incorrect information, and poor communication. The customer ultimately decided to cancel their service with Vodacom and switch to Rain.", "suggestion": "Vodacom should improve their customer service, provide accurate information, and ensure timely activation of services to avoid customer dissatisfaction."}, "meta": {"id": 4519298, "created_at": "2023-07-18 21:38:08", "review_rating": 1, "review_title": "Is it Vodacom? or should it be Vodapong or VodaGo?", "review_content": "I recently moved into an apartment/townhouse in a complex in Morningside in Sandton.  The unit is fibre ready.  All I had to do was to get a router and get connected.  I have had a Vodacom account for many years for my cell phone, so I thought I would go with them.  They are a trusted name in the industry.\nRound about the 2nd or 3rd of July 2023 I called Vodacom **********.  I spoke to a most obliging, friendly, and helpful consultant.  I was offered a package with Openserve as the fibre provider.  It was what I required, and within my budget.  The router arrived the next day.  I set it up, the wifi was working, but no Internet.  I called the customer service department. It was the first of many, many, many calls,  They told me my application would be activated.  Wonderful, or so I thought.  Nothing happened.  I call again.  \"Mam, it is being attended to.  We will esculate.\" This I heard on several occassions.... Then I was told it is was Openserve who were holding things up.   I contacted Openserve... you cannot speak to person. Commuication is through, initially a Bot and then e-mail.  They advised that Vodacom need to take 'Ownership' of the number.  I duly report back to Vodacom.  I have to say that the consultants are friendly, they have answers to your questions, full of informative advise albeit that the answers are incorrect, and the information is misinformation.  I was offered many reasons for the activation not taking place, \"Your address was incorrectly spelt\" How many ways can you spell Square? Openserve are not in your area.... Then why sell me a package with Openserve? I found out that Openserve are in the area but don't service my complex.  This whole process has now taken two and a half weeks.  Today I was informed by the Body Corporate of my complex to go through Metro Fibre.  I took a deep breath, and contacted Vodacom again.  My question, \"Can Vodacom offer me a package with Metro Fibre?\" This they could do by cancelling the existing order.  Collect the original router, providing me with a new one, and this whole process will take another 7 to 21 working days.... They expected me to wait this time after they had sold me an unworkable package, and being in constant communictation with them for two and a half weeks,.... I think not... On Friday of last week I received a call from a consultant.  She advised that I must cancel my existing application and take out a new one.  I go through the whole sign on process again.  The call ends.  I was about to send her the RICA documents she required when I received a call from the original consultant.. She informed me not to go for the second application as the one she opened is still ongoing and activation is going to take place.  I was told a technician would be coming to my home to to do the activation, another consultant told me it was done remotely. I was even told the name of the technician, and he is the best there is.  When I demanded to speak to a supervisor or a team leader as they are called in Vodacom world, they were always busy.  Today I was told, \"you can hold for him\". They expected me to hold on, for who knows how long, wasting my time and my airtime.  I said to the lady, \"You are the services providers, you get your team leader to call me\".  Obviously, I never received a call.  Today, was the final straw.  When they informed I would have to wait for another 7 - 21 working days.  Yes, for that period I was offered a free LTE service for a month..  Very generous and very nice.  But too little to late.  Sorry Vodacom. but your service here has been deplorable.  As I have stated your customer care consultants are extremely well trained.  Their telephone manner is excellent.  But, please. don't mislead your customers.  Needless to say I cancelled Vodacom, I am waiting for them to collect their router.  Today, I called Rain.  Spoke to a very informative person on the phone, paid the the sum of R1,00 yes, you are reading correctly R1,00 to secure my account.  I went to collect the Rain Box.... Yes, I am now Singing in the Rain.  My devices are connected.  My dealings with Rain, the call, collecting the Rain goodies, and setting it all up, an hour or so.  Please, Vodacom have a little more respect for your customers.", "business_slug": "vodacom"}}
